{
  "chinese": [
    {
      "name": "King Shing",
      "address": "2865 Carpenter Rd, Ann Arbor, MI 48108",
      "phone": "(734) 971-8999",
      "lat": 42.2461082,
      "lng": -83.680332,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-28 17:36:44",
            "text": "King Shing is the epitome of a hole in the wall strip mall Chinese place. The portions are big, the prices are low, and in this case the food is incredible....",
            "rating": 5
          },
          {
            "time": "2022-03-21 20:56:04",
            "text": "Unfortunately, I write this review with distaste. \nFor appetizers, I ordered wonton soup and crab rangoon--I received neither.\nI ordered twice cooked pork...",
            "rating": 1
          },
          {
            "time": "2022-04-19 13:43:03",
            "text": "The food prices were good but the portions were small. Food was okay but nothing special.",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-03-20 17:54:23",
            "text": "King Shing is KING OF CHINESE FOOD! I have been a faithful customer since they opened. Moved out of state, returned and their quality, value and kindness (stop in one day!) is STILL second to none. There's a REASON why they're the KING! King Shing is KING OF CHINESE FOOD!",
            "rating": 5
          },
          {
            "time": "2022-03-19 21:02:58",
            "text": "I ordered the hot and spicy shrimp today. I think it was really good and the shrimp was really tender. I never had this good Chinese food in a while so I enjoyed it. I think the dish was more sweet than it was spicy. But still I enjoyed it and I recommend this restaurant.",
            "rating": 5
          },
          {
            "time": "2021-12-28 17:31:58",
            "text": "Solid strip mall Chinese takeout. This location is convenient for anyone on the southeast side of Ann Arbor, north Pittsfield Township and far west Ypsilanti, and the service has always been very good, but the food used to be only passable with most dishes being overly sweet. The food has changed, for the better in my opinion. This review will likely be updated in a few months as I plan to go back at least a couple of times over the next month or so.",
            "rating": 4
          },
          {
            "time": "2021-11-16 14:52:02",
            "text": "Ordered pepper steak and chicken fried rice for take out and it was ready under 10 minutes! Food was hot and delicious. The lady at the front was using a baby sound monitor to hear the customer better which I thought was ingenious.",
            "rating": 5
          },
          {
            "time": "2022-03-15 19:43:38",
            "text": "These people don’t care about quality or customer service. Twice now we ordered on DoorDash and received sweet-and-sour chicken with no sauce. Basically glorified chicken nuggets. And when we complained they laughed and thought it was funny. We overlooked it the first time, but the second time was the final straw. Will never order from here again.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Yee Siang Dumplings",
      "address": "4837 Washtenaw Ave, Ann Arbor, MI 48108",
      "phone": "(734) 879-1459",
      "lat": 42.25103,
      "lng": -83.664197,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.1
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-29 17:34:04",
            "text": "We have been driving by this place for a few months; wanting to give it a try.  We had an errand to run nearby, so we came in for an afternoon snack.  It...",
            "rating": 5
          },
          {
            "time": "2022-04-19 13:47:29",
            "text": "They tried to charge us a mandatory 12% gratuity for a pick up order. They did not inform us of this extra charge until we noticed and pointed it out after...",
            "rating": 1
          },
          {
            "time": "2022-02-21 07:55:58",
            "text": "I was really grumpy, verging on hangry, and our first choice for dim sum was full to bursting and no idea how long the wait was.  We opted not to wait and...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-12 12:56:08",
            "text": "I was a little nervous based on some of the reviews, but my order was correct, the service was fine, and the food was okay. The rice was a bit overcooked/soft. The beef with broccoli tasted a little bland but everything was cooked properly, the carrots & broccoli were appropriately crunchy. The entree came with a ton of rice and the steamed pork buns were cooked through and tasted fine.",
            "rating": 4
          },
          {
            "time": "2021-02-13 19:52:28",
            "text": "Spicy Beef Noodle soup is delicious and full of beef flavor and chunks of delicious beef. Large enough to share and still get separate orders of dumplings. This place is a hidden gem!",
            "rating": 5
          },
          {
            "time": "2022-03-22 20:47:49",
            "text": "Dumplings are always hot and delicious. The egg and spring rolls lack flavor and the spring roll was a bit mushy the last two times I got them. The chicken with garlic is the only dish I've ever eaten from here and it was fine, just an excessive amount of sauce.  I love to get my dumplings from here for soup when I dont have time to make my own. This is the only place I will get them from. Definitely worth a trip.",
            "rating": 4
          },
          {
            "time": "2021-11-08 21:02:44",
            "text": "Food was OK, B maybe even B+, but that is probably the only thing acceptable about this place.\nFirst, the environment. Too cramped, they put twice the amount of tables the place could hold. Familiar with really tight booth? Get ready for the tiniest booth in town. Sticky table? Check. Non-matching silverware? Check. The chopsticks we were give could not stop rolling. Chipped plates? Check.\nSecond, service. Ever being served appetizer 25 minutes after all other entries? Get ready for such an experience. Order things you want the most from the menu? \" Sorry, we are out of most the stuff because we are closed on Monday\". That totally makes you question when were the food made. Last Monday, Maybe.  If you don't think this is a red flay, I have nothing for you.\n\nUpdate:\nThey changed the tip amount on my credit card bill. I am not sure if that is a crime, but sure not ethical.",
            "rating": 1
          },
          {
            "time": "2021-07-22 19:04:43",
            "text": "I had the shrimp/chicken dumplings. The dumplings were wonderful. However the dump(restaurant), not so much! After eating, l went to the bathoom.  l made the mistake of touching the doorknob. The knob and door were black. Quite literally caked with years of FILTH! I may have gotten the corona virus (or the Spanirh Flu, or Bubonic plague--depending how many decades it has been since the door was cleaned). 5 stars for the food. a minus 9 stars for the horrible and painful death l will endure for touching anything in the building!",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 8:00 PM",
        "Wednesday: 11:00 AM – 8:00 PM",
        "Thursday: 11:00 AM – 8:00 PM",
        "Friday: 11:00 AM – 8:00 PM",
        "Saturday: 11:00 AM – 8:00 PM",
        "Sunday: 11:00 AM – 8:00 PM"
      ]
    },
    {
      "name": "Evergreen Restaurant",
      "address": "2771 Plymouth Rd, Ann Arbor, MI 48105",
      "phone": "(734) 769-2748",
      "lat": 42.30375,
      "lng": -83.705875,
      "rating": {
        "Yelp": 3.5,
        "Google": 3.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-27 15:25:40",
            "text": "Wonderful atmosphere for delicious Chinese cuisine! The scallion pancakes were our favorite appetizer and the steamed garlic flounder was flavorful,...",
            "rating": 5
          },
          {
            "time": "2021-12-19 20:17:53",
            "text": "In the past, Evergreen is usually about a 4/5 (a bit expensive, but typically pretty good food). Depending on what you're feeling, I'd recommend the...",
            "rating": 3
          },
          {
            "time": "2021-09-25 18:06:02",
            "text": "Evergreen is one of the better Chinese restaurants in Ann Arbor, and I have had some good meals here. The beef wide noodles, lunch special chopped pepper...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-02-10 21:37:00",
            "text": "Never order on any holiday as your food will take hours, if it ever gets made. Also, I cannot recommend the Americanized Chinese menu. That being said, the traditional menu is delicious and consistent. One of the best options in the area.",
            "rating": 5
          },
          {
            "time": "2021-12-21 19:39:11",
            "text": "I went in today with my girlfriend and I ordered the Stewed Fish in rice wine sauce and she got the Beef Wide Noodles. The fish was very tender and the rice wine sauce went very well with the delicate fish, the wood ear that was in the stew was also very delicious and had a great crunch. My girlfriend liked the beef wide noodles and says it is her favorite dish from the restaurant now. She is new to Chinese food and the texture of the noodles in this particular dish was new and exciting for her. Overall 10/10 experience and I will be coming back with her to try new dishes and the bubble teas",
            "rating": 5
          },
          {
            "time": "2022-02-17 15:47:52",
            "text": "I cannot remeber ever having a better meal at a Chinese Restaurant. The service was great. The atmosphere was great. The food was not only delicious but top quality as well. We stopped there because we were in the area but I will make a special trip and drive the distance to eat there again.",
            "rating": 5
          },
          {
            "time": "2021-11-29 23:06:07",
            "text": "I have been eating and getting takeout at Evergreen since the pandemic started and they haven’t declined in the quality of the food or service in these hard times. I really appreciate how they have only been working harder for the community and their customers. I wish the staff of evergreen the best and hope we can keep on supporting them and their business.",
            "rating": 5
          },
          {
            "time": "2021-09-25 19:19:05",
            "text": "I hadn't been here in years. They doubled the size and completely remodelled it so it looks sharp and modern. Nice vibe, nice staff and good food. I saw a lot of Chinese people eating here so I take that as a sign that the food is authentic and meets the expectations of a sophisticated and worldly Chinese expat community.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:30 PM",
        "Saturday: 11:00 AM – 10:30 PM",
        "Sunday: 11:00 AM – 10:00 PM"
      ]
    },
    {
      "name": "Lan City Noodle Bar",
      "address": "1235 S University Ave, Ann Arbor, MI 48104",
      "phone": "",
      "lat": 42.27526503799302,
      "lng": -83.7333086990338,
      "rating": {
        "Yelp": 4.0,
        "Google": 3.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-10-24 14:32:50",
            "text": "I came here for an earlier lunch on Saturday. It's order at the counter and seat yourself currently. This worked well. I order the laksa and it was ready in...",
            "rating": 4
          },
          {
            "time": "2021-10-23 14:28:49",
            "text": "Place\nLan city is in downtown AA. I was excited to have a hand pulled noodle place within walking distance. The area is very spacious and I enjoy the...",
            "rating": 4
          },
          {
            "time": "2021-10-23 06:35:39",
            "text": "Lan City Noodle Bar, this newest outpost in the A2 DT area, is the only location offering dine-in seating right. The OG Ypsi location is still take out...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-05 13:00:50",
            "text": "Their food reminds me of home and I don’t know what more I could ask for. Korean Fried Chicken was crispy with a lot of meat on each wing and the duck noodle broth was so rich and savory. The signature beef noodles+fried tofu noodles are great too! Don’t forget the chili oil and the Chinese vinegar.\n\nThey had me hooked with their fantastic food but I became a customer for life after I asked about buying one of their t-shirts and they made it happen! Please support this hard-working and local, family-owned business.",
            "rating": 5
          },
          {
            "time": "2021-11-28 16:26:53",
            "text": "Lan City Noodle Ann Arbor is the best real Chinese Noodle you will find around. The staff is kind, friendly, and responsive. You will often find the place stuffed during lunch or dinner with a line of people waiting to come in and eat. I like #6 Hot Pepper Oil Noodle with Chicken added the best. The brisket with hand pulled noodle is also delicious if you like that cut of meat and the broth is divine. Would recommend you try the Hot Pepper Oil Noodle with Chicken or whatever looks good, everything tastes good so you can’t go wrong. 10/10 and 5 Stars.",
            "rating": 5
          },
          {
            "time": "2022-04-01 14:22:44",
            "text": "I got the sesame tofu and this was the best tofu I’ve ever had! I couldn’t believe it was actually tofu. Kids loved the scallion pancakes.",
            "rating": 5
          },
          {
            "time": "2021-12-19 17:52:23",
            "text": "I accidentally ordered to the Ypsilanti location instead of the Ann Arbor one. Most restaurants are nice enough to offer some kind of refund or re-order your food at the correct location. Lan City Ypsilanti refused to offer any type of reimbursement and offered very very poor and rude customer service. I was a very big fan of Lan city before, but I do not believe I will eat there ever again.",
            "rating": 1
          },
          {
            "time": "2022-02-18 14:31:34",
            "text": "Yum! The noodles were delicious and the menu had many options that you don't see at other places. Will definitely be back!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:15 AM – 3:00 PM, 4:30 – 9:00 PM",
        "Wednesday: 11:15 AM – 3:00 PM, 4:30 – 9:00 PM",
        "Thursday: 11:15 AM – 3:00 PM, 4:30 – 9:00 PM",
        "Friday: 11:15 AM – 3:00 PM, 4:30 – 9:00 PM",
        "Saturday: 11:15 AM – 3:00 PM, 4:30 – 9:00 PM",
        "Sunday: 12:00 – 3:00 PM, 4:30 – 9:00 PM"
      ]
    },
    {
      "name": "One Bowl Asian Cuisine",
      "address": "1220 S University Ave, Ann Arbor, MI 48104",
      "phone": "(734) 747-7006",
      "lat": 42.274783,
      "lng": -83.7333166,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.2
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-12 13:27:13",
            "text": "Very good food. I love that it has a ton of different Asian cuisines. Japanese, Chinese, Vietnamese, Korean. It also has good quantity of food for what you...",
            "rating": 5
          },
          {
            "time": "2022-04-09 18:25:57",
            "text": "Super filling and tasty for 1 person! Ingredients were fresh. The pickles were the standout item for me, moreso than the actual kimchi. It tasted a bit dry...",
            "rating": 4
          },
          {
            "time": "2022-04-18 11:40:24",
            "text": "Small family operated business that really know how to deliver a sumptuous meal and excellent egg by service. I highly recommend this restaurant to you.",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-26 21:13:35",
            "text": "This is one of the best Pho I have had in a long time. The hostess was great and the food was remarkable.  We just found a wonderful place to come and enjoy.",
            "rating": 5
          },
          {
            "time": "2021-08-30 00:15:03",
            "text": "This place was awesome for a casual meal. Wanted some noodles wasn’t disappointed the vermicelli is easily enough for 2 under most circumstances I’d say super clean restaurant as well",
            "rating": 5
          },
          {
            "time": "2022-04-15 21:59:00",
            "text": "Loved the spicy chicken BBQ and the Lo-mein. The staff and manager are just wonderful people. Great place, great people and delicious food!",
            "rating": 5
          },
          {
            "time": "2021-06-26 19:10:39",
            "text": "Nice variety of Asian dishes here! Fast service when I ordered take out. I'll always come back here when I get a craving for their chicken hot pot.",
            "rating": 5
          },
          {
            "time": "2021-10-29 07:35:42",
            "text": "Great house chicken salad with the most tasty ginger dressing that they make in house.\nSoothing atmosphere and quality service.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 9:30 PM",
        "Tuesday: 11:30 AM – 9:30 PM",
        "Wednesday: 11:30 AM – 9:30 PM",
        "Thursday: 11:30 AM – 9:30 PM",
        "Friday: 11:30 AM – 9:30 PM",
        "Saturday: 11:30 AM – 9:30 PM",
        "Sunday: 11:30 AM – 9:30 PM"
      ]
    },
    {
      "name": "Lan City Noodles",
      "address": "2612 Washtenaw Ave, Ypsilanti, MI 48197",
      "phone": "(734) 896-3888",
      "lat": 42.2495183,
      "lng": -83.6527657,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-22 14:49:07",
            "text": "My last meal in Ann Arbor. This was also my first time enjoying Asian food during a business trip. There was something about this place that had me go back...",
            "rating": 5
          },
          {
            "time": "2022-02-03 15:17:02",
            "text": "I was pretty jazzed to see Lan City Noodles delivers to my mom's in Canton, where I've been staying for a few days. We were craving some noodles and...",
            "rating": 5
          },
          {
            "time": "2021-12-08 10:25:50",
            "text": "Wow, the noodles here are fantastic! We ordered through a food delivery service and the food arrived hot and ready to eat. \n\nYou can really taste the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-25 03:49:01",
            "text": "Agree with some previous posts.  Long time customer and yes, my family is asian and have lived extensively in Taiwan and China so we've been to countless hand made noodle bars.\n\nThe knife cut noodles here used to be really good, thin, and consistent (slightly thicker than fettuccine) when they first opened but over the past year been back 4 to 5 times and had several family members regret ordering the knife cut every time (some were literally the thickness of a standard Lego brick), hoping that it was just a fill in chef.  Food quality and taste has definitely taken a hard turn from what it once was.\n\nI'll continue to try it once in a while in hopes that the quality improves because it is unique and super delicious if the restaurant is managed correctly, but for now I'm open to trying other noodle shops.",
            "rating": 2
          },
          {
            "time": "2022-01-21 16:34:53",
            "text": "Food was delicious! Only downside was that my dumplings were packed in a very small to-go container so they kind of melded together and that made them difficult to eat. But still flavorful! Food was hot and fresh, which I really appreciated. Will order again👍",
            "rating": 4
          },
          {
            "time": "2021-12-29 16:14:45",
            "text": "This place is serious quality for a very reasonable price. The noodles and broth were amazing in the Duck Noodle soup! The curry samosas were also a huge hit with the chutney complementing the flavor profile perfectly. First time going but I suspect this place will become a regular spot!",
            "rating": 5
          },
          {
            "time": "2022-03-31 15:47:56",
            "text": "tried it twice, got the bubble guts twice. food wasn’t terrible but definitely nothing special. there won’t be a third time.",
            "rating": 1
          },
          {
            "time": "2021-11-20 21:08:40",
            "text": "I'm from Atlanta and the noodle shops there can't compete. Unfortunately they are only offering take out at the moment, but the food was still totally amazing. The portion size and quality shocked me at that price point. I recommend the hot pepper oil noodle if you like spicy food.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "YP Sichuan",
      "address": "301 E Michigan Ave, Ypsilanti, MI 48198",
      "phone": "(734) 544-1299",
      "lat": 42.2413332585816,
      "lng": -83.6058,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-05 20:44:54",
            "text": "First time there today. They've found a new regular in me for sure. I feel like I could eat the salt miners eggplant and cucumber salad everyday for the...",
            "rating": 5
          },
          {
            "time": "2022-03-18 18:08:32",
            "text": "Yangzhou fried rice and Sichuan cold noodle is great. I will try eggplant next time. Owner is pretty good and ask my for feedback for dishes.",
            "rating": 5
          },
          {
            "time": "2021-06-23 15:16:23",
            "text": "We loved our peaceful delicious meal at YP Sichuan!! \n\nThey have a very diverse menu. When you go make sure you get the American and Chinese menu. I got the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-21 19:31:21",
            "text": "The place is clean, portions are generous and the price is reasonable. We particularly liked the squirrel fish (with sweet and sour sauce) and the ice jelly with brown sugar, which is light and refreshing after a spicy meal. On the other hand, although the dry pot cauliflower was fresh and crispy, it was relatively salty for our taste. We are not from Sichuan, so perhaps this is authentically how it is supposed to be. However, for us, we will ask them to be gentle on the salt (and also chilies) next time. There was only one waitress when we were there, so please be patient if you visit, nevertheless she was very friendly and attentive. The restaurant is rather far from where we live, but definitely worth the journey!",
            "rating": 5
          },
          {
            "time": "2022-02-26 18:01:55",
            "text": "I absolutely love coming to YP Sichuan every time I’m in the area. Super friendly and sweet staff, very helpful. All of the vegetarian options are amazing! I love taking my vegan friends here. This is some of the best chinese food in the area, especially for folks that don’t eat meat!",
            "rating": 5
          },
          {
            "time": "2021-12-23 18:15:14",
            "text": "Very good! You get a good sized portion. The steamed dumplings look flavorless but let me tell you they are so delicious! Packed full of flavor! The spring rolls are so good and packed full of filling. Everything was seasoned perfectly!",
            "rating": 5
          },
          {
            "time": "2022-02-21 12:21:04",
            "text": "The food was really, really authentic and spectacular. I haven't had good Chinese food in a WHILE and you know that moment when you take a bite of something good and you furrow your brows, close your eyes, bring your hand to your forehead, and feel overwhelmed by the yumminess of the yum? Yeah, I had that.",
            "rating": 5
          },
          {
            "time": "2022-03-06 15:17:43",
            "text": "Amazing Chinese food. Get the dried tofu. Delicious",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 8:30 PM",
        "Tuesday: Closed",
        "Wednesday: 11:00 AM – 8:30 PM",
        "Thursday: 11:00 AM – 8:30 PM",
        "Friday: 11:00 AM – 8:30 PM",
        "Saturday: 11:00 AM – 8:30 PM",
        "Sunday: 11:00 AM – 8:30 PM"
      ]
    },
    {
      "name": "TK Wu",
      "address": "510 E Liberty St, Ann Arbor, MI 48104",
      "phone": "(734) 747-6662",
      "lat": 42.279125213623,
      "lng": -83.7425155639648,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.1
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-16 15:55:59",
            "text": "Solid Chinese restaurant, not sure why it's not rated higher. Came here for takeout for myself and two friends. Our order was taken quickly despite it being...",
            "rating": 4
          },
          {
            "time": "2022-03-06 18:15:21",
            "text": "It's a cute, small establishment that was crowded yet we were seated quickly. All of the staff were polite, attentive, and helpful. The spring rolls were...",
            "rating": 5
          },
          {
            "time": "2021-10-26 10:28:51",
            "text": "This is my new favorite Chinese food spot in Ann Arbor. Service was fast, portions were ENORMOUS, and the flavors were authentic, bold, and complex. We...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-15 09:44:17",
            "text": "Great authentic Chinese food and really friendly and attentive staff! We got lucky and arrived at the right time to avoid waiting for a table, but this little place fills up pretty quickly (and for good reason). The photos on the wall are really fun to look at and the atmosphere overall is really comfortable. I will definitely be back!",
            "rating": 5
          },
          {
            "time": "2022-03-19 20:51:52",
            "text": "We were very satisfied with the dishes we ordered for both taste and portion size. If you can't eat a lot, plan to share or take food home. The service was a little slow, but the overall atmosphere was nice. Don't miss it.",
            "rating": 4
          },
          {
            "time": "2021-11-05 19:56:05",
            "text": "TK WU is one of the best places to eat in Ann Arbor. The menu options range from common to rare. For example, I enjoy the Lu Mein. However, I come for the roast duck. The staff there is so kind and accommodating.\nI have been going there almost every week since moving to Ann Arbor in June and I have never had a bad experience.\n\nThere is bad cell connection inside, but that just makes it an idea place to talk to people while you enjoy a meal. Overall, good food and good atmosphere.",
            "rating": 5
          },
          {
            "time": "2021-11-15 13:34:41",
            "text": "First time trying the place and it was amazing. The place was small and had a good vibe. Every bite was filled with flavor and super good.",
            "rating": 5
          },
          {
            "time": "2022-02-06 19:35:19",
            "text": "Very busy with limited help. Menu posted on door vs inside varied slightly. Server was somewhat attentive. Did not get any refills on my soda.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 9:00 PM",
        "Tuesday: 11:30 AM – 9:00 PM",
        "Wednesday: 11:30 AM – 9:00 PM",
        "Thursday: 11:30 AM – 9:00 PM",
        "Friday: 11:30 AM – 9:30 PM",
        "Saturday: 11:30 AM – 9:30 PM",
        "Sunday: 11:30 AM – 9:00 PM"
      ]
    },
    {
      "name": "Asian Legend",
      "address": "516 E William, Ann Arbor, MI 48113",
      "phone": "(734) 622-0750",
      "lat": 42.2776831,
      "lng": -83.7423144,
      "rating": {
        "Yelp": 3.0,
        "Google": 4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-11 16:11:36",
            "text": "Recommend here if you like sweet food. The portion is not big and so you can try more food at the same time. \nThree-cup chicken: \nWuxi Rib：\nChive egg...",
            "rating": 5
          },
          {
            "time": "2021-08-06 13:30:31",
            "text": "I get that covid has turn the restaurant industry up-side down and a lot of creative ideas has to be hatched during government ordered shutdown.  I've heard...",
            "rating": 2
          },
          {
            "time": "2020-12-19 10:55:33",
            "text": "Taiwanese street food is some of my favorite food as I grew up eating it. It's a bit hard to find in MI...until I moved to AA! \n\nA friend, who used to...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-09 08:21:24",
            "text": "Responsive waiter and constantly checking on us! They include 18% tip automatically.\n\nFast service: you don’t wait for your dishes. BUT, it is a *very typical Chinese-American restaurant*: very sweet, oily, too much sauces to fit American flavor. I won’t suggest to go there if you are looking for something authentic: better cook by yourself.\n\nDon’t order the 葱油饼 green onion pancake: it’s deep fried and not the Chinese way of making it at all. 空心菜is fine.",
            "rating": 3
          },
          {
            "time": "2022-03-19 16:55:06",
            "text": "WORST WAITRESS with 18% MANDATORY TIPPING\n\nThe taste is bad. The service is even worse. If you don't care about the taste and service at all and just want to throw your money away, this is your place. Be careful with everything, otherwise you will be lectured by the waitress \"kindly\". This is the first time I got questioned by a waitress \"What is wrong with you? Don't you understand?\" How can you talk to me like that while expecting me to tip you? They would also keep checking on you in case you get too comfortable. An epic experience I will never forget. Now I'm feeling throw up not only because of the greasy food, but also in deep regret of my decision to come here.\n\nBtw, tipping is not mandatory in the United States. Just so the owner know.",
            "rating": 1
          },
          {
            "time": "2022-04-12 18:53:39",
            "text": "My order was not fresh. They didn’t even use Chinese noodles— they used regular spaghetti/linguine. Also, was charged an 18% service fee, but the service and food were not good. I felt like they were trying to just make quick money with cheap ingredients rather than make quality food to keep customers coming back. No interest in returning.",
            "rating": 1
          },
          {
            "time": "2021-02-19 18:06:11",
            "text": "The Schezwan chicken here is amazing! Everyone on the staff is really nice! It's my favorite Asian restaurant in Ann Arbor:)\nDo like my review if you find it useful!",
            "rating": 5
          },
          {
            "time": "2022-04-17 11:02:05",
            "text": "Food is good, but their ATTITUDE is WORST.\nIf I can give zero or negative stars, I'll do it based on their attitude.\n\nThis is the details why I say this. We found that they automatically included an 18% tip when we saw the bill. We tried to argue that, and they said: \"We had already put an 18% tips poster at the entrance. BUT when we read that poster, it said the 15-20% tips.\" Then we turned around to argue with the staff, he GAVE ME ATTITUDE and RUDELY said: \"it is an old poster and we will change it to a new one.\" No matter what we said, he kept repeating the same thing repeatedly.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:30 PM",
        "Saturday: 11:00 AM – 9:30 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Chia Shiang Restaurant",
      "address": "2016 Packard St, Ann Arbor, MI 48104",
      "phone": "(734) 741-0778",
      "lat": 42.2571907,
      "lng": -83.7278519,
      "rating": {
        "Yelp": 3.0,
        "Google": 3.8
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-25 06:19:31",
            "text": "For those coming here for the classic vegan options, those are no longer on their menu. They still have tofu options but the mock meat options are no longer...",
            "rating": 3
          },
          {
            "time": "2019-11-25 07:23:07",
            "text": "Finally got a chance to try the place... it only two years lol!! It was little after 4pm on a Sunday and the place was empty, got seated and reviewed the...",
            "rating": 3
          },
          {
            "time": "2021-06-26 18:42:44",
            "text": "It was good authentic place. I used  to drive 40 min to have my favorite dishes. However I am sure the chef left and every dish is no longer the same even...",
            "rating": 2
          }
        ],
        "Google": [
          {
            "time": "2021-12-31 20:43:14",
            "text": "This used to be a good restaurant. Alas, no longer. Out of the three dishes in our take out order, one was barely edible and two were just nasty. Especially disappointed with the Sichuan boiled beef which was truly foul.\n\nNever. Going. Back.",
            "rating": 1
          },
          {
            "time": "2021-01-17 14:23:38",
            "text": "Previously this is was an excellent restaurant. However the ownership changed and the quality dropped significantly. The food is not bad, but not quite the authentic Szechuan perfectly spiced dishes as before.",
            "rating": 3
          },
          {
            "time": "2022-03-15 02:31:48",
            "text": "Delicious, I usually order for delivery, sometimes Chowbus is busy and I pick up the food instead. Always good and will be back.",
            "rating": 5
          },
          {
            "time": "2021-11-09 14:46:44",
            "text": "Customer service was excellent food was so delicious and fresh I ordered the. Chicken Lo mein I will definitely order from this restaurant again!!",
            "rating": 5
          },
          {
            "time": "2021-03-19 17:06:20",
            "text": "The folks who leave bad reviews here are expecting this place to be a typical Chinese restaurant. While Chia Shiang does have the standard offering of Americanized Chinese food the real treasure is a few more pages into the menu. Yes the menu is large and does not have great descriptions but that does not matter because all the food is awesome. I have tried things here that I would never try other places and it is very rare I have a dish I dont like. The staff does not speak the best English but they do work hard. This place can be a rewarding adventure for those looking to get away from the same old plates. Eat Local, Eat Here!\n\nUpdate 2021: 6/19/2021\nI ordered takeout recently and did not get what I was expecting. So the next time I called I was very specific about what I wanted. I was told they have a new chef and the menu has changed. The guy on the phone did not know what happened to the couple that used to run the restaurant. Not sure what this will be like when they reopen for dine in...but the takeout food I have got has not been the same quality.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": null
    }
  ],
  "cuban": [
    {
      "name": "Frita Batidos",
      "address": "117 W Washington St, Ann Arbor, MI 48104",
      "phone": "(734) 761-2882",
      "lat": 42.2803651,
      "lng": -83.7491532,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-02 18:49:59",
            "text": "Super excellent and filling food!! Comfort food for sure, tasty, customizable and fairly priced. \n\nIt is first-come first serve seating both indoor and...",
            "rating": 5
          },
          {
            "time": "2022-03-23 08:24:53",
            "text": "3.75 stars.  Frita Batidos is definitely something different.  While some would simply call it a glorified burger joint with noticeable Cuban influences, I...",
            "rating": 4
          },
          {
            "time": "2022-03-05 09:33:46",
            "text": "The long picnic style tables are accommodating for any party size. Walk in, stand in line, order, and then the food and drinks are delivered to the table....",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-20 19:08:44",
            "text": "Absolutely loved this restaurant!  Passing through on a business trip and a colleague recommended we stop here.   I had the chicken Frita with an egg and the salsa toppers.  Everything had great flavor and was freshly made.  I tried the guac. and the fried plantains...both delicious!  Inside was clean and bright. Staff was very polite.  It was really busy, but we did not wait too long for the food.",
            "rating": 5
          },
          {
            "time": "2022-03-17 19:08:28",
            "text": "Casual flair and a unique Cuban menu make this spot great.  Everything we tried was delicious and different from other Ann Arbor offerings.  Would recommend stopping by when you're looking for food just off the main street scene.",
            "rating": 5
          },
          {
            "time": "2022-01-25 17:00:14",
            "text": "The best burgers!! They have lots of options to fit any preference. The fries are great. We loved the churro. Staff is always friendly. It is loud on weekend nights. You order before you sit down and then by the time you get through line there will be a table open. They have it done to a science there! The seats are all benches and not handicap friendly or baby friendly.",
            "rating": 5
          },
          {
            "time": "2022-03-09 13:20:04",
            "text": "My son is home for Spring Break and we drove to Ann Arbor to have an AMAZING lunch!  We loved the Frita and the lime fries.  Miranda was very welcoming and Evan was super attentive to our needs.  We can’t wait to bring the rest of the family. Thanks for having us!",
            "rating": 5
          },
          {
            "time": "2022-01-15 22:57:10",
            "text": "Updated review:\nWe have been coming here for 8 years now and past few months we had very bad experience everytime. I am not sure if it was just us, but I appreciate someone taking time to talk to us and trying to address issue. Today’s order was made perfectly hence I am updating this from 1 star to 5 star again. Hopefully they continue to provide good service like they did in past.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 11:00 PM",
        "Tuesday: 11:00 AM – 11:00 PM",
        "Wednesday: 11:00 AM – 11:00 PM",
        "Thursday: 11:00 AM – 11:00 PM",
        "Friday: 11:00 AM – 12:00 AM",
        "Saturday: 11:00 AM – 12:00 AM",
        "Sunday: 11:00 AM – 11:00 PM"
      ]
    },
    {
      "name": "Latin American Cuban Cuisine",
      "address": "2269 Ellsworth Rd, Ypsilanti, MI 48197",
      "phone": "(734) 961-7452",
      "lat": 42.2304216,
      "lng": -83.6460776,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-19 16:04:23",
            "text": "This place is amazing!  Tried 3 dishes and all of them were great. The service was extremely friendly and prices were cheap.  \n\nAuthentic all the way.",
            "rating": 5
          },
          {
            "time": "2022-04-19 18:42:17",
            "text": "This is my second time here and I love it even more. My first time was on door dash but this time I went inside. It's super clean and the young lady at the...",
            "rating": 5
          },
          {
            "time": "2022-04-09 08:49:33",
            "text": "Delicious Cuban food that is my new go-to! The guava pastry is amazingly similar to Porto's guava pastry, but delicious in its own right - same goes for the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-01-17 19:18:28",
            "text": "I very much enjoyed this place. Having moved from Miami to Detroit, it was great to have something familiar and authentic. The ambience was enjoyable and the food was delicious, with flavorful coffee to finish. The manager came out to speak with us and the wait staff was super friendly. I highly recommend this location for anyone looking to enjoy authentic Cuban food.",
            "rating": 5
          },
          {
            "time": "2022-04-09 12:49:56",
            "text": "If you haven’t tried this place yet you’re sleeping 😂 the food is amazing, the place is always clean, the manager and staff has always been super nice and cool, and overall it’s just a real chill place. I pretty much go everyday for lunch and the yucca fries 🔥🔥🔥🤩. Prices are very reasonable to folks go check em out I promise you won’t be disappointed in the flavor 👌🏾",
            "rating": 5
          },
          {
            "time": "2021-11-16 00:36:12",
            "text": "Great Cuban food in Michigan. The long wait for their opening was well worth it. The food was served very hot and perfect. I haven’t had a real authentic Cuban food nowhere in Michigan just like you would in Miami. I highly recommend. The owner is very nice and friendly as well as the staff. They’re very welcoming and very attentive. I wish I could give more than five stars",
            "rating": 5
          },
          {
            "time": "2022-04-01 14:36:02",
            "text": "We REALLY enjoyed our meal here; delicious food and a very inviting atmosphere plus the whole place is super clean. We’ll 1000% be back! 🙂",
            "rating": 5
          },
          {
            "time": "2022-02-17 14:32:32",
            "text": "Amazing fresh delicious.....plus a bunch of other descriptive words that I can't come up with right now.....this place is outstanding!!!!  Best Cuban food I've had!!!  Which isn't a ton....but oh my!!!!  We started with the plantain chips with rojo sauce....when the server delivered it he said let me know if you need more sauce ......YES PLEASE!!!! We also had the Yuka fries....I loved them!!!  The cilantro sauce was was great!!!  I had their steak sandwich....super tasty!!!  The bread was fresh....everything was perfect!!!  My husband ordered some beef dish that came with rice and that is what hit all the flavors out of the park!!!!  We will most definitely be back here.....and you all should go support them and see what their food is all about!!!!  We also had the sugarcane juice.....I highly recommend it!!!  Perfect drink to go with the amazing flavors!!!!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 10:00 PM"
      ]
    },
    {
      "name": "Vicente's Cuban Cuisine",
      "address": "1250 Library St, Detroit, MI 48226",
      "phone": "(313) 962-8800",
      "lat": 42.33447,
      "lng": -83.047077,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-10 07:41:21",
            "text": "Visited Vicentes on date night for my wife's birthday and was really pleasantly surprised! I have been hearing about this place since it opened 15 years ago...",
            "rating": 5
          },
          {
            "time": "2021-12-30 18:37:02",
            "text": "Very good food and menu has a lot of options on it make sure to bring your appetite.\n\n Simple yet refine good food decent food that you can get almost...",
            "rating": 3
          },
          {
            "time": "2021-11-29 08:06:47",
            "text": "Food was ok. OK, for Cuban food it was hella bland- yes I'm a Latino that has grown up with CUBANS. The price for the food and the amount of food is...",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2020-09-06 17:22:11",
            "text": "The white sangria is a must have!!",
            "rating": 5
          },
          {
            "time": "2022-03-09 09:21:27",
            "text": "The food was excellent but the service needed work. I'd have bought another entrée after my kid full stole mine had I seen a waiter between food drop and Bill time. Refills were not a thing. I don't think I would go back, you can get great food and great service for the price elsewhere.",
            "rating": 3
          },
          {
            "time": "2022-04-17 15:11:30",
            "text": "This place has moved to my #1 spot. The food is amazing.  Fresh, hot and seriously so good! Not to mention our waiter  Abraham was the BEST!!! We will make the hour trip her for home.",
            "rating": 5
          },
          {
            "time": "2021-10-15 12:20:07",
            "text": "One of a kind.\n\nVicente's is one of those amazing date night experiences that you want to come back to: a great ambiance and some of the best food in the Detroit area. There are a few other South American /Caribbean restaurants in greater Detroit, but none quite match this one. All of the menu items are delicious, and the food comes out very quickly. The only better Cuban experience I've had was in Miami itself.",
            "rating": 5
          },
          {
            "time": "2021-07-14 10:12:58",
            "text": "Dined here when it first opened.  Was very good.  I haven't been able to get back in (too busy when I try).  I want to go back..'\n\nUPDATE- I went back and was less impressed second time.  Staff was less then attentive, food was mediocre second time around.  Dropped from 5 stars to 3 stars.   An expensive dinner for a lack luster meal/experience.",
            "rating": 3
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 11:00 PM",
        "Saturday: 11:00 AM – 11:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Pilar's Tamales",
      "address": "2261 W Liberty St, Ann Arbor, MI 48103",
      "phone": "(734) 929-4161",
      "lat": 42.273649,
      "lng": -83.777535,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.8
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-04-29 17:55:54",
            "text": "We tried both the pupusas (chicken and black bean) and tamales (chicken & cheese and spicy pork), and everything was delicious. Once I called in the order,...",
            "rating": 5
          },
          {
            "time": "2019-12-21 08:56:04",
            "text": "100% recommend this place. I'm sad it took me sooooo long to find enter this place. \nIt is so friendly, happy, cheery! I mean this place is amazing. \nThe...",
            "rating": 5
          },
          {
            "time": "2021-09-15 09:55:14",
            "text": "Pilar's and Pilar is such an Ann Arbor gem. First, the food is always so well-prepared, authentic, and delicious. I especially love the pupusas and whatever...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-11 08:59:44",
            "text": "Perfectly encapsulates what great food should be. Every dish is superb and made with great care, ingredients are fresh and top notch, and the staff are genuinely kind and loving people. Every item on the menu will treat you well, but make sure to always get plantains because they put every other plantain in Michigan to shame.",
            "rating": 5
          },
          {
            "time": "2022-04-18 10:38:52",
            "text": "Delicious, friendly and had great vegan options. I had this on my list to try for a while and glad I finally made a visit. I placed my order when I got there and didn't have to wait very long. The salad and sauce provided a great compliment to filling tamales. I will be back!",
            "rating": 5
          },
          {
            "time": "2022-01-23 14:21:34",
            "text": "Absolutely delicious. Lots of gluten free options. Thank you so much for making wonderful and safe options. Highly recommend.",
            "rating": 5
          },
          {
            "time": "2022-03-18 17:52:06",
            "text": "Pilar's has the best tamales in town! The prices are reasonable and the customer service is excellent.",
            "rating": 5
          },
          {
            "time": "2022-01-23 23:49:55",
            "text": "Pretty interesting! They had some vegan tamales, the black bean one was to die for! Really enjoyed the Fried Yuca root too. The rest of our food was pretty alright, but definitely going back for those two!",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 12:00 – 6:00 PM",
        "Wednesday: 12:00 – 6:00 PM",
        "Thursday: 12:00 – 6:00 PM",
        "Friday: 12:00 – 6:00 PM",
        "Saturday: 12:00 – 5:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Carlos' Poco Loco",
      "address": "1809 Adams St, Toledo, OH 43604",
      "phone": "(419) 214-1655",
      "lat": 41.65838,
      "lng": -83.54651,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-06 12:08:13",
            "text": "My first time eating here. Didn't wait long at all for a table, and staff was very friendly and attentive. I didn't really know they had such a large menu...",
            "rating": 5
          },
          {
            "time": "2022-04-16 10:04:54",
            "text": "Good, not great. The chips and salsa set the tone, as both were subpar. The ordering process was not simple as the server struggled with English and got my...",
            "rating": 3
          },
          {
            "time": "2022-04-17 13:11:34",
            "text": "It took a while to get seated and then we were surrounded by empty tables but I know restaurants do have reasons for that that are beyond me. But while we...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-12-11 21:52:21",
            "text": "Excellent service. Food was served very quickly. The order was 100% correct. The food is always awesome. Best value in Toledo for my money.",
            "rating": 5
          },
          {
            "time": "2022-01-18 19:25:25",
            "text": "We were visiting Toledo when my Husband Googled this Restaurant...This is truly a hidden gem! Our waitress, Vanessa was excellent! Food was excellent! Music was excellent! 100%!!",
            "rating": 5
          },
          {
            "time": "2022-04-12 13:18:20",
            "text": "Poco Loco is a must-do Toledo restaurant. Their entire menu is delicious and includes several unique vegan options. The margaritas are no joke.",
            "rating": 5
          },
          {
            "time": "2022-04-07 18:15:58",
            "text": "Excellent food and service!  A wonderful dinner served quickly.  Worth your time and money to dine here.",
            "rating": 5
          },
          {
            "time": "2021-07-31 14:29:30",
            "text": "Food and service was good but me, being from Hialeah, I can’t give 5 stars. The black beans can use a little tweaking. The rest was pretty good.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "La Cocina Cubana",
      "address": "123 S Washington Sq, Lansing, MI 48906",
      "phone": "(517) 708-8144",
      "lat": 42.73272,
      "lng": -84.55192,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-06 16:44:13",
            "text": "Very tasty Cuban Style pork. Plaintains were cooked well with just enough sweet. Rice with beans felt healthy!",
            "rating": 5
          },
          {
            "time": "2022-03-31 10:10:42",
            "text": "Excellent find in downtown Lansing.  Food was excellent, service was great.  Very clean restaurant.",
            "rating": 5
          },
          {
            "time": "2021-12-07 10:14:01",
            "text": "My husband and I stopped in on a Saturday afternoon because the ratings looked good and we like to try new places wherever we are. Finding ourselves near...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-03-12 15:42:26",
            "text": "The food was delicious. I had the chicken fajitas. Highly recommend. Don't go if you're in a hurry, as the atmosphere is relaxed and on the slower-service side.",
            "rating": 4
          },
          {
            "time": "2022-04-04 18:34:31",
            "text": "I wanted the taste of Cuban food. I ordered a traditional Cuban sandwich. The pork didn't settle well with my stomach. Had to disgard the whole sandwich. Along with the sandwich I ordered black bean soup and ended up with rice and beans.",
            "rating": 2
          },
          {
            "time": "2022-04-12 13:02:46",
            "text": "This is home Cuban food, and dessert is on point. Cortadito ( Cuban coffee and frothed milk) ooh! Is delicious. We will come back.",
            "rating": 5
          },
          {
            "time": "2022-04-11 11:10:38",
            "text": "The food is top notch and authentic. The atmosphere is vibrant and has a family feel to it. The staff was genuine and super helpful and friendly.",
            "rating": 5
          },
          {
            "time": "2021-08-02 16:48:57",
            "text": "First time here and I loved! The staff is super friendly and the food is beyond this world. I am shocked others gave it such a low rating since we are currently in a pandemic and businesses are suffering. Would def recommend this place to my friends and loved ones.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 3:30 PM",
        "Tuesday: 10:30 AM – 8:00 PM",
        "Wednesday: 10:30 AM – 8:00 PM",
        "Thursday: 10:30 AM – 8:00 PM",
        "Friday: 10:30 AM – 8:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Frita Batidos",
      "address": "66 W Columbia St, Detroit, MI 48201",
      "phone": "(313) 725-4100",
      "lat": 42.3379,
      "lng": -83.05314,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-24 07:26:02",
            "text": "Before the pandemic I never had the pleasure of going to a Frita's. They have two locations (Ann Arbor and Detroit), and unfortunately the pandemic hasn't...",
            "rating": 5
          },
          {
            "time": "2022-03-17 19:53:05",
            "text": "Great food and fast service! I felt that it was a little overpriced for burgers. Additionally, the outdoor seating was a bit dirty and sticky.",
            "rating": 4
          },
          {
            "time": "2021-08-13 17:50:09",
            "text": "We visited Ann Arbor for a day tripped and spent our lunch here. The burgers were great! We added an egg to our burgers and wow!!! With COVID, they had nice...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-07 12:58:49",
            "text": "First time here and what an incredible place. Kudos to Eve and her staff. Food was fantastic, total flavor burst. Great staff, very friendly. Clean, fun vibe with picnic table type seating. A must go to!! We will be back!",
            "rating": 5
          },
          {
            "time": "2022-03-19 21:10:34",
            "text": "Extremely friendly and helpful team. Food is exploding with flavor. Everything is so, so good. Cannot wait to come back!!",
            "rating": 5
          },
          {
            "time": "2022-04-02 21:27:15",
            "text": "A wonderfully open, well-lit, and welcoming environment, followed by friendly and knowledgeable personnel yields an excellent atmosphere for anyone 👍\n\nThe Cuban sandwich ($12.50) I ordered tasted even better than the the place looks, and will certainly bring my friends here as well.",
            "rating": 5
          },
          {
            "time": "2022-02-12 09:40:26",
            "text": "Great food. Chorizo Frita was very memorable. Will be back shortly to try a Batido!",
            "rating": 5
          },
          {
            "time": "2022-02-12 14:41:08",
            "text": "oh my god this is insanely good!! The food is so flavorful, fresh, and the staff is so friendly!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 4:00 – 9:00 PM",
        "Thursday: 4:00 – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 10:00 PM"
      ]
    },
    {
      "name": "Antonio's Coney Island",
      "address": "2896 Washtenaw Rd, Ypsilanti, MI 48197",
      "phone": "(734) 905-7321",
      "lat": 42.2499749,
      "lng": -83.6570647,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-08 15:48:39",
            "text": "Absolutely delicious Central American + Honduran food! Loved the breakfast food when I first visited with my mom about 3 years ago, as well as the fried...",
            "rating": 5
          },
          {
            "time": "2021-02-28 17:00:31",
            "text": "Ummm, I love everything about an amazing Honduras spot moonlighting as a Coney Island restaurant. I mean yes, they have the regular stuff but the Honduran...",
            "rating": 5
          },
          {
            "time": "2021-04-14 08:37:00",
            "text": "Really great food at a good price. I was kinda taken aback by the employees not wearing a mask but I got my food to go so it wasn't that big of a deal to me.",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-14 18:22:52",
            "text": "Food was excellent. Watch the prices however - the chips and guac we ordered that were a few dollars on the menu magically became $8 when the bill came. When asked, the reason cited was \"inflation.\" I'd be happy to pay whatever you want to charge if it wasn't a surprise when the bill comes.",
            "rating": 2
          },
          {
            "time": "2021-11-18 14:23:18",
            "text": "Every meal I have ordered in or gotten for takeout is delicious and a good value. There are also vegan and vegetarian dishes available. Some of the dishes are very simple and others are exotic with special touches. There is something for everybody,",
            "rating": 5
          },
          {
            "time": "2020-09-18 15:45:59",
            "text": "Surprised on how good it was",
            "rating": 3
          },
          {
            "time": "2021-12-25 07:43:12",
            "text": "We will definitely be going back.  Great food.  The waitress made us feel like family.",
            "rating": 5
          },
          {
            "time": "2021-12-12 19:38:11",
            "text": "The food was great. I had chicken ceaser salad and my husband had a meat omelet.  Both were very good.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 10:00 AM – 7:00 PM",
        "Wednesday: 10:00 AM – 7:00 PM",
        "Thursday: 10:00 AM – 7:00 PM",
        "Friday: 10:00 AM – 8:00 PM",
        "Saturday: 9:00 AM – 8:00 PM",
        "Sunday: 9:00 AM – 6:00 PM"
      ]
    },
    {
      "name": "Jose's Cuban Sandwich & Deli",
      "address": "401 S Pennsylvania Ave, Lansing, MI 48912",
      "phone": "(517) 374-6832",
      "lat": 42.7295761108398,
      "lng": -84.5374908447266,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-07-25 18:20:09",
            "text": "This is definitely a Lansing hidden gem. Their food is very good and delicious always. I have not had a bad sandwich here. \n\nIf you're in Lansing and want a...",
            "rating": 5
          },
          {
            "time": "2021-09-24 16:09:02",
            "text": "Haven't had home cooked style cuban food since I left Miami. The beans are to die for and the sandwich was addicting. Would've never thought a gas station...",
            "rating": 5
          },
          {
            "time": "2021-01-22 17:33:38",
            "text": "I honestly don't understand the hype. I ordered the French dip and the Cuban. A couple of overcooked pieces of beef on grilled bread with microwaved au jus....",
            "rating": 2
          }
        ],
        "Google": [
          {
            "time": "2022-04-19 08:35:34",
            "text": "Amazing food! I was NOT expecting it in this little hideaway restaurant in the gas station, but I was pleasantly surprised. I got the chicken artichoke sandwich which had crunchy bread, a creamy jalapeño and artichoke spread, and tender juicy chicken. I think about this sandwich all the time and will be back for more soon.",
            "rating": 5
          },
          {
            "time": "2021-11-06 23:16:34",
            "text": "A must stop for anyone interested in Lansing food. Jose's is unassuming and tucked away in a gas station but you should definitely eat their food. My favorites are the aurora, vegetarian, and the island sandwiches.",
            "rating": 5
          },
          {
            "time": "2021-09-02 17:40:47",
            "text": "Wow! Just wow! The honest to God best sandwiches I've ever had! And seriously the beans!?! Delicious! My new favorite place for sure! You guys are a hidden gem!",
            "rating": 5
          },
          {
            "time": "2021-07-29 23:53:59",
            "text": "Love this place. It's located in a gas station/store. A small carryout place with delicious Cuban food. Prices are good, food is great.👍",
            "rating": 4
          },
          {
            "time": "2021-12-14 16:05:43",
            "text": "Absolutely Amazing  have been ordering here since this semester of college and each sandwich I’ve got has been elite my favorite sandwich place  I’ve had in Michigan and a great price",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 12:00 – 8:00 PM",
        "Wednesday: 12:00 – 8:00 PM",
        "Thursday: 12:00 – 8:00 PM",
        "Friday: 12:00 – 8:00 PM",
        "Saturday: 12:00 – 8:00 PM",
        "Sunday: 12:00 – 8:00 PM"
      ]
    },
    {
      "name": "Beyond Borders",
      "address": "810 S Main St, Plymouth, MI 48170",
      "phone": "(734) 259-8415",
      "lat": 42.36511,
      "lng": -83.47021,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-18 15:25:02",
            "text": "Screw the 2 hour wait at Bario.   Get some great takeout and a bottle of wine next door and enjoy fantastic Mexican food.  Homemade chips, the brisket is...",
            "rating": 5
          },
          {
            "time": "2022-01-16 12:05:30",
            "text": "One of few places where the sum of all the reviews really does tell the whole story. \n\nIt is indeed cheaper and easier to get into than Barrio\n\nBob is...",
            "rating": 3
          },
          {
            "time": "2021-04-30 15:52:05",
            "text": "I look like a starfish right now.... Why?! Because my happy belly is soooo full! Beyond Borders has been on my to go list and finally hit it up tonight! \n\nI...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-09 09:51:35",
            "text": "Bob and Cindy are friendly and welcoming!  The food is made fresh and the taste is beyond fantastic!  I had to call them.while eating and thank them for such a delicious meal!  The flavors are authentic and had the best heat while still being able to taste all the different food and flavors.!\nI highly recommend Beyond Borders to everyone and will suggest it to all my friends and family!\nPlanning on trying the whole menu and taking Bob's recommendations.",
            "rating": 5
          },
          {
            "time": "2022-03-31 12:05:16",
            "text": "Friendliest place around with the best vibe !\nThe people who work here treat you like a friend.\nThis is my lunch spot.\nThe food is delicious. The chicken nachos are outstanding\nAlso, the chicken enchiladas are absolutely delicious.\nMost flavorful food in Downtown Plymouth.\n10/10 would recommend",
            "rating": 5
          },
          {
            "time": "2022-03-22 13:10:52",
            "text": "The food is amazing. I'll start with that. I grew up in Texas and have become deeply fond of *anything* that resembles the variety and depth of flavor found in genuine Latin food. Beyond Borders does that in spades. Still, the better quality of the place is that the food is made by people who are passionate about their food. You can tell, even as you enter the unassuming restaurant, that they have taken great pains to ensure that their food is delicious. Talking with the owner, I was excited to learn about his process—which showed great care for the ingredients and final product. I highly recommend this place.\n\nOh, and today I had the Torro sandwich. Have him make it spicy. It's delicious.",
            "rating": 5
          },
          {
            "time": "2022-03-05 08:40:27",
            "text": "The Brisket Street Tacos were Fantastic.  My Friend had the Wet Burrito and that was even better.  Terrific Guacamole.  Fresh everything.  This is a To Go restaurant that I will be getting a lot of Take Out from.",
            "rating": 4
          },
          {
            "time": "2022-03-29 13:08:32",
            "text": "My family and I love Beyond Borders. The food is fresh, and the time estimates for pick up are accurate (which is super important because we come from out of town to pick up). Try the El Torro Sandwich  is you like spice.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 8:00 PM",
        "Tuesday: 11:00 AM – 8:00 PM",
        "Wednesday: 11:00 AM – 8:00 PM",
        "Thursday: 11:00 AM – 8:00 PM",
        "Friday: 11:00 AM – 8:00 PM",
        "Saturday: 11:00 AM – 7:00 PM",
        "Sunday: Closed"
      ]
    }
  ]
}