{
  "chinese": [
    {
      "name": "Dai Yee's Asian Kitchen",
      "address": "4131 N Rockwell St, Chicago, IL 60618",
      "phone": "(312) 961-6039",
      "lat": 41.956787,
      "lng": -87.692983,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-27 08:50:16",
            "text": "Our friends were craving good Asian food and Dai Yee's was perfect! \n\nWebsite: EASY TO USE\nThe website was easy to navigate and I was able to customize...",
            "rating": 5
          },
          {
            "time": "2022-02-17 10:20:05",
            "text": "Really great Chinese takeout! I've tried this place a couple of times. The food has arrived hot and neatly packaged. My husband said the wonton soup is the...",
            "rating": 4
          },
          {
            "time": "2022-01-23 16:29:48",
            "text": "We ordered delivery tonight- \nWonton soup \nHot & Sour soup \nEgg drop soup \nCrab Rangoon \nSingapore noodles \n\nI can't even pick which one our favorite was,...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-20 23:31:24",
            "text": "Delicious!!! My new favorite Chinese restaurant!\n\nDai Yee's is higher quality Chinese food which is why it is priced a few dollars more than your typical Chinese carryout location. In my opinion it's worth paying for superior quality...you can clearly tell that the vegetables and chicken are fresh at Dai Yee's. Plus the favors are fantastic.\n\nDai Yee's is especially good if you're getting Chinese food for guests because it'll make a great impression. The menu is huge so many fun things to try.",
            "rating": 5
          },
          {
            "time": "2022-02-03 21:10:08",
            "text": "I'm so happy I found Lisa's new restaurant. I've ordered around 6 times now and the food is delicious as always. I've tried various menu items and I've never been disappointed. They always accommodate my special requests. If you order spicy then be prepared for the heat (still working my way up on this one). The owner is super sweet and very customer oriented...which seems rare to find these days. Thank you!",
            "rating": 5
          },
          {
            "time": "2022-04-16 16:14:41",
            "text": "This is some of the most delicious Chinese food I've ever had in my life! Its flavor rivals even the best restaurants in Chinatown. They use only the best ingredients and tastes truly homemade. This is the ONLY place I'll ever order Chinese from on the Northside. Period.",
            "rating": 5
          },
          {
            "time": "2022-02-26 23:42:11",
            "text": "To the owner, Lisa … I will make sure I frequent your restaurant soon solely based on your response to Ashley in Joey. Good for you for not allowing disrespectful behavior to your team! Look forward to trying your food soon.\n\nUpdate: Ordered food tonight. Had no idea this was a takeout kitchen only (didn’t matter though because we wanted to pick up & take home regardless). We have been looking for good Chinese near us for 6 years and I think we just found “our spot”. Cannot wait to keep trying more dishes. Note: their spicy is spicy (& quite delicious).",
            "rating": 5
          },
          {
            "time": "2022-02-05 16:34:23",
            "text": "the food was pretty good, but for the price it wasn’t worth it at all. good portion of food but no rice with it… paid over $60 for 2 meals & sides & it wasn’t for much of an actual meal. not even any egg rolls or a complimentary soda. tough, i won’t waste my money here again. in chinatown you can pay that amount for a full meal rice, dumplings & more. don’t waste your money here if you want a quick bite to eat. unless you have a personal favorite here, it’s fine.",
            "rating": 3
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:30 AM – 9:00 PM",
        "Wednesday: 11:30 AM – 9:00 PM",
        "Thursday: 11:30 AM – 9:00 PM",
        "Friday: 11:30 AM – 9:30 PM",
        "Saturday: 12:00 – 9:30 PM",
        "Sunday: 12:00 – 9:30 PM"
      ]
    },
    {
      "name": "Chengdu Impression",
      "address": "2545 N Halsted St, Chicago, IL 60614",
      "phone": "(773) 477-6256",
      "lat": 41.9286079,
      "lng": -87.648514,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-16 08:25:48",
            "text": "I've had takeout several times from this place, and it's consistently great. \n\nI've tried pork pot sticker as an app.  It's soooooo good!!  Then, I had...",
            "rating": 5
          },
          {
            "time": "2022-02-07 04:37:09",
            "text": "We've gotten take out from this place about three times now, and it's a solid Sichuan Chinese restaurant for us on the north side. It's not as cheap and as...",
            "rating": 4
          },
          {
            "time": "2021-12-16 17:16:49",
            "text": "Small unassuming place that one could miss walking by. \nThey are a neighborhood gem with culinary roots as deep as their history. \n\nDan Dan noodles and Mapo...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-20 20:41:41",
            "text": "Second week in a row I’ve ordered it, asked for its “very very very spicy” because I don’t want there to be any room for interpretation of just how spicy I want it. Both times it’s come back negative spicy. Which almost at that point seems on purpose, because they followed the other special instructions. Food was fine, but what the point of special instructions if you don’t even do them .",
            "rating": 2
          },
          {
            "time": "2020-08-23 22:01:42",
            "text": "Authentic Chinese food!",
            "rating": 5
          },
          {
            "time": "2022-03-10 20:18:45",
            "text": "Full-bodied Sichuan spiciness… this place is excellent. I tried one of their specials, fatty beef and tofu with green peppercorns… outstanding. My mouth is still tingling. One bite better than the next.",
            "rating": 5
          },
          {
            "time": "2021-10-12 02:25:14",
            "text": "Just a delicious as ever! Had the soup dumplings and the dry chili chicken, which I love for. Next time in town I’m going for the eggplant version. So excited!",
            "rating": 5
          },
          {
            "time": "2021-11-27 20:42:43",
            "text": "The worst Chinese food I had so far. I think they use the same source for all different dishes. All taste the same. Not a good quality and authentic Chinese food. Will never visit again.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 4:00 – 9:30 PM",
        "Tuesday: 4:00 – 9:30 PM",
        "Wednesday: 4:00 – 9:30 PM",
        "Thursday: 4:00 – 9:30 PM",
        "Friday: 4:00 – 9:30 PM",
        "Saturday: 4:00 – 9:30 PM",
        "Sunday: 11:30 AM – 2:30 PM, 4:00 – 9:30 PM"
      ]
    },
    {
      "name": "MCCB Chicago 时尚食谱",
      "address": "2138 South Archer Ave, Chicago, IL 60616",
      "phone": "(312) 881-0168",
      "lat": 41.853906974902266,
      "lng": -87.63366102533693,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-04 21:19:21",
            "text": "Four years later, I'm still the biggest fan of MCCB!!! This is the #1 restaurant in chicago hands down. I've progressed to eating MCCB every week, and I...",
            "rating": 5
          },
          {
            "time": "2022-04-13 21:03:34",
            "text": "Came here with a group of nine and they helped arrange some tables for us so that we were seated in 10 minutes. \n\nCrab Rangoon - I like these to be on the...",
            "rating": 4
          },
          {
            "time": "2022-03-21 13:24:20",
            "text": "We went to this restaurant because of their good reviews and also because of our previous experience in the adjacent resto (Yes, Joy Yee) where they charged...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-17 21:53:19",
            "text": "My wife and I were in Chicago for a few days and we decided to have dinner here. We were there around 8:20 pm and the host informed us the kitchen closes at 9:15 and we may not get a table. This was absolutely fine and we understand that it was a Friday night. We decided to wait and when were next in line the host for reasons unknown gave our table to someone else who was behind us in the wait-list and told us that the kitchen is closed. We were not disappointed that we wasted 2 Uber rides from our hotel but the fact that they lied and made an excuse for not giving us our table was the worst part and that's the reason for this 1star review.",
            "rating": 1
          },
          {
            "time": "2022-01-30 21:24:01",
            "text": "Family dinner tonight with our two teenagers (one is vegan). We shared an assortment of meals and sides: vegetable chow mien, special grill lamb chop, chef’s special chicken stir fry, salt & pepper short ribs, string beans, double-fried pork rice, and dumplings. All the food was good, but our least favorite was the short ribs because is was a little too fatty (the flavor was fine). Our  favorite dishes were the string beans, the pork rice, and the chicken stir fry. Honestly, I think it would be hard to go wrong at this restaurant. The wait staff was courteous and attentive to our dining experience.",
            "rating": 5
          },
          {
            "time": "2022-01-18 21:30:38",
            "text": "What a great experience! I was a part of a party of 3 and had never visited Chinatown before, and this was our first stop.\n\nThe service was awesome, it's a bit different from other restaurants in that you don't have a single server, there's a couple people roaming around the dining room but they're all very present and quick to fulfill orders & requests.\n\nOur food came out very quickly as it was ready, we got four dishes: Mongolian Beef, Orange Chicken, Double Pork Fried Rice, and General Tso's Chicken. Everything was delicious, but the two chicken dishes were the standouts. You could tell the food was very high quality, and the portions were also very decently sized, my roommate and I eat a lot and we still had a good amount of leftovers.\n\nWould highly recommend this spot for anyone visiting the area for the first time.",
            "rating": 5
          },
          {
            "time": "2022-03-06 16:37:01",
            "text": "It's a small place, but the food is delicious and the service was excellent. We tried the dry chili chicken, the Dan Dan noodles, Chengdu dumplings, and the orange chicken. It was all so good and such generous portions. Will definitely come back.",
            "rating": 5
          },
          {
            "time": "2022-02-26 20:52:34",
            "text": "I ordered Mongolian style flank steak and Chinese lettuce. Both were perfectly seasoned and cooked. Portion sizes were more than what I could’ve asked for. Would recommend!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 10:00 PM",
        "Tuesday: Closed",
        "Wednesday: 12:00 – 10:00 PM",
        "Thursday: 12:00 – 10:00 PM",
        "Friday: 12:00 – 10:00 PM",
        "Saturday: 12:00 – 10:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Wonder Chop",
      "address": "2418 W Fullerton Ave, Chicago, IL 60647",
      "phone": "(773) 384-6499",
      "lat": 41.92522,
      "lng": -87.68845,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.8
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-20 06:44:27",
            "text": "Delicious Chinese dishes! The quality of every dish was terrific which included General Tso chicken, walnut chicken, shrimp & noodles, eggrolls, egg drop...",
            "rating": 5
          },
          {
            "time": "2022-03-31 12:59:39",
            "text": "I ordered delivery and the food got here in a reasonable time.  The prices are really high for the amount of food you get compared to 95% of the Chinese...",
            "rating": 3
          },
          {
            "time": "2021-07-23 13:46:11",
            "text": "Definitely has huge portions of food... I am warning you. The General Tso's chicken was tender, moist, flavorful, and definitely worth it. The lo-mein...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-02-22 13:10:39",
            "text": "Love the food here, the quality difference compared to other Chinese takeout spot is definitely seen and tasted. Everything is at a fair price and they even have sushi which I love! Sadly they do not deliver that far so if you don't live in the Logan Square area you might not be able to get delivery. However, this is a must try spot :))",
            "rating": 5
          },
          {
            "time": "2022-02-20 09:43:13",
            "text": "Delicious Chinese dishes! The quality of every dish was terrific which included General Tso chicken, walnut chicken, shrimp & noodles, eggrolls, egg drop and hot sour soups. We ordered for pick up and the owner could not have been more appreciative of our business. Really wonderful! This will be our permanent go to.",
            "rating": 5
          },
          {
            "time": "2022-02-10 12:22:34",
            "text": "Best Chinese food I’ve ever had. The quality of the meat is substantial. They’re so consistent every time. We don’t order from any other Chinese restaurant other than them. I’ve yet to have anything come near the taste and quality of Wonder Chop. Their General Tso is top tier and phenomenal!! Don’t forget the crab rangoons!!!",
            "rating": 5
          },
          {
            "time": "2022-02-26 19:32:31",
            "text": "Love food here! Definitely better the last Chinese place.",
            "rating": 5
          },
          {
            "time": "2021-07-24 19:39:20",
            "text": "We love wonder chop. The service is phenomenal. The food is always great. We go out of our way for wonder chop",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 12:00 – 8:00 PM",
        "Thursday: 12:00 – 8:00 PM",
        "Friday: 12:00 – 8:00 PM",
        "Saturday: 12:00 – 8:00 PM",
        "Sunday: 12:00 – 8:00 PM"
      ]
    },
    {
      "name": "Sweet Rice Asian Kitchen",
      "address": "1904 N Western Ave, Chicago, IL 60647",
      "phone": "(773) 661-2743",
      "lat": 41.915980361557416,
      "lng": -87.68754992634057,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-20 16:04:17",
            "text": "I was walking around the Bucktown neighborhood and the bright orange exterior of Sweet Rice caught my eye. I followed my curiosity and decided to give it a...",
            "rating": 5
          },
          {
            "time": "2022-04-02 18:44:18",
            "text": "This is a great noodle shop. Tasty, fast, and not your average thai menu. Looks like they will have a rolled ice cream program in the summer that I am...",
            "rating": 4
          },
          {
            "time": "2022-03-01 14:38:15",
            "text": "I got the mussel fritter (5/5), the khao mun gai (reminds me of hainanese chicken) 5/5, the beef noodle soup 4/5, and the Vietnamese iced coffee (4/5).\n\nI...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-20 14:47:01",
            "text": "Quick & hot Southeast Asian inspired meals, casual & bright restaurant by Western blue line station.\n👍 basil chicken: saucy, piping hot, balanced flavor. A bit heavy on protein, light on rice & veg, but tasty! Served with runny egg.\n👍 Thai iced tea and boba: just the right amount of sweetness. Very comforting!",
            "rating": 5
          },
          {
            "time": "2022-04-16 22:57:51",
            "text": "There are a lot of great restaurants in this neighborhood but this is probably my favorite. It's the one I find myself coming back to despite having so many left to try. The service is always good, the food is better and the prices are reasonable, maybe even a tiny bit cheaper than other similar restaurants.\n\nGreat place to go if you have a mixed group of vegan/vegetarians and meat eaters because there are some great options for all so no one feels like they're compromising or missing out. I don't have any restrictions but I've tried some of the vegan versions when I've gone with my partner, and I think in particular the vegan duck soup (they switch the noodles to make the dish vegan) is great. I don't think vegans will miss the taste of duck with that dish, it's pretty spot on and even the texture is good. But there are of course other options and they're clearly labeled which is also super helpful.\n\nIt's just off the Western stop so a good place to eat right before or after taking the train.",
            "rating": 5
          },
          {
            "time": "2022-02-16 14:14:56",
            "text": "Amazing authentic Thai food! We just returned from Thailand and this food tastes like we brought it home on the plane! Highly recommend the sweet chili chicken!",
            "rating": 5
          },
          {
            "time": "2022-03-20 12:27:42",
            "text": "Very impressed with this Thai Street Food takeout and dine in restaurant. The server was SO accommodating for our 2 year old on whether a high chair or booster would be better. They had a kid-friendly plastic divided plate for him and the regular dishware and chopsticks for adults.\n\nAlso impressed with the menu! We enjoyed everything we ordered including the Tom Kha soup with medium spice, the fried oysters, vegetarian “pork” sweet buns, kimchi rice bowl, and coconut cakes dessert. Will definitely be going back again and can’t wait to try the crepes and Thai ice cream.",
            "rating": 5
          },
          {
            "time": "2022-04-14 11:09:21",
            "text": "This restaurant used to be located off of the 606 near the western exit where that new high rise apartment complex is now built.  It was my favorite restaurant in the area. I was filled with absolute joy when I walked by the new location one day to find they were reopening. It’s not what most Thai restaurants have to offer, it’s Thai street food and it’s incredible. Kao Ne Ped, Moo Yang, Beef Noodle Soup, and their sweet milk and banana roti is amazing. However, you can’t go wrong.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:30 AM – 3:00 PM, 3:30 – 9:00 PM",
        "Tuesday: 11:30 AM – 3:00 PM, 3:30 – 9:00 PM",
        "Wednesday: 11:30 AM – 3:00 PM, 3:30 – 9:00 PM",
        "Thursday: 11:30 AM – 3:00 PM, 3:30 – 9:00 PM",
        "Friday: 11:30 AM – 3:00 PM, 3:30 – 9:00 PM",
        "Saturday: 11:30 AM – 9:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "MingHin Cuisine",
      "address": "2168 S Archer Ave, Chicago, IL 60616",
      "phone": "(312) 808-1999",
      "lat": 41.8532564325305,
      "lng": -87.6349026829699,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-03 15:16:53",
            "text": "Came here with a party of four around 1pm on a Sunday and got seated in 20 minutes. Ordering is super easy and we also asked for the chrysanthemum tea....",
            "rating": 4
          },
          {
            "time": "2022-03-31 17:07:38",
            "text": "Highly ranked dim sum for Chicago. Terrible dim sum. Cheap? So so. I was quoted 5 minutes for the wait time. I knew better. The standing room had I kid you...",
            "rating": 3
          },
          {
            "time": "2022-03-28 19:27:37",
            "text": "It was very busy on a Sunday afternoon. We came in and we're ready to go upstairs for a reservation but we're early and wanted to wait upstairs for more...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-01-20 20:39:14",
            "text": "Very tasty! Some of the best Chinese food I've had in a while. The sesame chicken was fantastic, and I also got the chicken on a stick appetizer, as well as the strawberry & banana smoothie. Anyone who is on the fence about trying this place out should definitely check it out. Very attentive and friendly staff too. I'll definitely come back again!",
            "rating": 5
          },
          {
            "time": "2021-11-28 12:31:12",
            "text": "Watery entrees, and overall poor quality for the price.\n\nUPDATE: 11/27/21\nI revisited MingHin this week and the experience was completely different from when I ate there four years ago. I don’t know if ownership has changed but they restaurant looks much nicer especially in terms of being organized and taking my order quickly. The food was also great not a single complaint this time around. Will be visiting again soon when I can.",
            "rating": 5
          },
          {
            "time": "2020-09-20 19:16:04",
            "text": "First time visiting in over 30 years not what it used to be",
            "rating": 3
          },
          {
            "time": "2021-07-20 22:00:40",
            "text": "We’re visiting Chicago for a month and have dined at MingHin twice already. The food is delicious and served hot & fresh. The restaurant is clean, the service is very good and the servers are well trained, efficient and friendly. And then there’s Tiffany, the receptionist. Tiffany is an absolute delight. She is this gorgeous, precious young woman who makes you feel right at home. Our dining experience at MingHin has been superb!",
            "rating": 5
          },
          {
            "time": "2021-07-19 00:30:42",
            "text": "If you go on the weekend, call ahead and get a reservation.\n\nThe time to wait for table fulfillment, we had a reservation, may have been 4 minutes.  I was more than pleased.\n\nThe food is terrific; the staff was quick to fulfill any requests.\n\nThe price was exceedingly reasonable.  This was a great find and we will return.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 10:00 AM – 12:00 AM",
        "Tuesday: 10:00 AM – 12:00 AM",
        "Wednesday: 10:00 AM – 12:00 AM",
        "Thursday: 10:00 AM – 12:00 AM",
        "Friday: 10:00 AM – 12:00 AM",
        "Saturday: 10:00 AM – 12:00 AM",
        "Sunday: 10:00 AM – 12:00 AM"
      ]
    },
    {
      "name": "Little Wok Wicker Park",
      "address": "1950 W Division St, Chicago, IL 60622",
      "phone": "(773) 886-5051",
      "lat": 41.90351,
      "lng": -87.6768,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-10 16:15:59",
            "text": "Food is rather average. Nice ambiance though. Can't say I've had a memorable dish yet or anything that seems like it'll be better. Have had 6 dishes so far,...",
            "rating": 3
          },
          {
            "time": "2022-04-09 10:01:28",
            "text": "Experience: Came across these gem while walking around. On a random Friday afternoon and a party of two, we were able to be seated and served pretty...",
            "rating": 5
          },
          {
            "time": "2022-03-26 21:21:45",
            "text": "I'm a bit surprised really, everything about the place set up for expected disappointment.\n\nBut it delivered on most all fronts. The predictable...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-01 16:11:11",
            "text": "One of the best new restaurants in the neighborhood. Go eat there! Seriously! Stylish, comfortable decor, friendly service, and delicious food. Highly recommend the Walnut Shrimp and Chow Fun with Gravy. We will definitely return to try more of their menu.",
            "rating": 5
          },
          {
            "time": "2022-01-23 17:44:13",
            "text": "Great GF options. Everything is super fresh & delicious with amazing portions! The design is SUPER gorgeous inside, great date spot. I love the special elevated seating with a birds eye view. It feels upscale but intimate/warm, welcoming and casual too. Very caring staff with a trendy vibe—I can't think of anywhere in the Wicker Park (or Fulton Market) area that compares. Welcome addition to the neighbourhood!",
            "rating": 5
          },
          {
            "time": "2022-03-18 09:03:47",
            "text": "A new pan Asian cuisine sit down restaurant with full bar in the wicker park area on division.  Prices are very competitive yet you get a high end ambiance.  Plenty of street parking around the area as well as other attractions like Elitea nearby",
            "rating": 5
          },
          {
            "time": "2022-01-28 03:10:22",
            "text": "This place was incredible.  Amazing service from Julian and the food was spectacular.  I think this just might be the best Chinese food I have ever had.  We had a sushi app which was delightful,  I will be returning for the sushi side of the menu, however tonight I had Mongolian beef,  General Taos chicken, and curry fried rice.  The meat was tender,  the sauces were great,  and the portions were generous AND the price was right! You must go! Also beautiful decorated with comfy seating.",
            "rating": 5
          },
          {
            "time": "2022-02-17 15:11:09",
            "text": "Great spot if you have a taste for anything Chinese or Japanese as they have a huge menu including both cuisines. I am the type of girl who loves some maki rolls but also a fried rice or noodle dish as well. The sushi was fresh and very tasty; I have dined in and ordered out & both experiences were great. The prices are reasonable too!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:30 AM – 10:00 PM",
        "Tuesday: 11:30 AM – 10:00 PM",
        "Wednesday: 11:30 AM – 10:00 PM",
        "Thursday: 11:30 AM – 10:00 PM",
        "Friday: 11:30 AM – 11:00 PM",
        "Saturday: 11:30 AM – 11:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Chef’s Special Cocktail Bar",
      "address": "2165 N Western Ave, Chicago, IL 60647",
      "phone": "(773) 666-5143",
      "lat": 41.921762,
      "lng": -87.6872132,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-09 12:11:26",
            "text": "I love authentic American Chinese food. I know I just pulled off a classic oxymoron, but in this case, it's true!\nThe culinary world of authentic Chinese...",
            "rating": 5
          },
          {
            "time": "2022-04-09 09:21:38",
            "text": "Came here on a Friday night for a friends birthday. Since there were 5 of us, we had to do a pre-fixe menu which was totally fine. There ended up being so...",
            "rating": 4
          },
          {
            "time": "2022-02-15 20:55:05",
            "text": "My girl friends and I were looking for a spot to catch up and Chef's Special was the perfect spot for a good meal and conversation. The ambiance was casual...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-27 21:11:15",
            "text": "Would absolutely come back just for a happy hour snack!  $8 old fashioneds and $6 crab Rangoon.  The dry chili chicken was fantastic, as were the spring rolls and egg rolls.  Everything is VERY salty so if you're sensitive to highly salty things it might not be for you.  Will absolutely be back!!",
            "rating": 5
          },
          {
            "time": "2022-03-01 13:20:40",
            "text": "Love the ambiance here. The food is really good, and the staff is super friendly. We did have a small issue with the taste of our food last time, but our server was really kind and had the dish redone for us. After it came out again it was good. Their mocktail is also very refreshing and tasty. Def try the dry chili chicken. Will most likely visit this place continuously.",
            "rating": 4
          },
          {
            "time": "2022-01-21 20:00:44",
            "text": "I really liked this place; it's very cool. I wish I had taken pictures. It has a very mid century 1960 vibe. It's kind of a throwback of a Chinese American restaurant back then. But I think the food is probably much better than Chinese American food in the 1960s. The green beans were delicious, and my favorite was the dried chili chicken. There were so many chili's in that dish. I took it home and made my own chili oil. Their drinks were also very nice too! They have a nice cocktail menu. I'll definitely be back once I run out of my chili oil, hahaha. But I'm sure I'll be back sooner than that!",
            "rating": 5
          },
          {
            "time": "2021-08-30 08:53:14",
            "text": "We were a group of 4 & sat outside at the end of the patio. Very nice. Very good food but even better service! Our server was very attentive but not overly so. The food was delicious and is served in a larger quantity. We ended up taking a LOT of food home. I look forward to eating here again on my next trip to Chicago! If you're looking for a nice, intimate dining experience with great food, try this place!",
            "rating": 4
          },
          {
            "time": "2022-02-08 16:09:37",
            "text": "When out of town friends ask me for restaurant recommendations during their visit to Chicago I always include Chef’s Special on my list of places to definitely go to! So delicious, every plate, every time.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": 2
      },
      "opening_hours": [
        "Monday: 5:00 PM – 12:00 AM",
        "Tuesday: 5:00 PM – 12:00 AM",
        "Wednesday: 5:00 PM – 12:00 AM",
        "Thursday: 5:00 PM – 12:00 AM",
        "Friday: 5:00 PM – 12:00 AM",
        "Saturday: 5:00 PM – 12:00 AM",
        "Sunday: 5:00 – 10:00 PM"
      ]
    },
    {
      "name": "Yummy Yummy Asian Cuisine",
      "address": "2901 N Broadway St, Chicago, IL 60657",
      "phone": "(773) 525-6677",
      "lat": 41.935016,
      "lng": -87.644032,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.2
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-21 13:46:44",
            "text": "This is my go to spot for smoothies, specifically Taro smoothies. \n\nI have come over a dozen times for a combination of smoothies and food and have never...",
            "rating": 5
          },
          {
            "time": "2022-03-03 17:26:01",
            "text": "Forgive and forget, I suppose --- ah 2013, when Uber Eats didn't exist yet. \n\nDid I get irrationally angry b/c I was hangry one night 9 years ago and Yummy...",
            "rating": 5
          },
          {
            "time": "2021-11-11 09:32:37",
            "text": "The smoothies are incredible and they use fresh fruit. I personally love the mango kiwi! I got them weekly in the summer. They're huge smoothies for a good...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-01-27 23:02:53",
            "text": "Such amazing, delicious food. SO MANY vegan & vegetarian options (which honestly is hard to find in Chinese food)... We specified no eggs or meat in our order, and someone from the store called us just to make sure which was so thoughtful! We ordered a ton of food and everything was correct and tasty. Reasonable prices and large portions. Food came so quickly! Would 10/10 eat here again and would absolutely recommend this place to anyone, especially vegans & vegetarians!!",
            "rating": 5
          },
          {
            "time": "2022-04-18 10:35:43",
            "text": "I ordered YY's Orange Chicken and it was delicious. My friend ordered a vegan version and let me try a piece. My chew was so rubbery that I was truly glad I ordered the real thing.",
            "rating": 4
          },
          {
            "time": "2021-12-27 05:11:23",
            "text": "Have always had food of good quality and quantity here for the price. Some people are being really picky. If you want super quick food and tons of soy sauce packets go to Panda Express.",
            "rating": 5
          },
          {
            "time": "2022-03-22 13:43:50",
            "text": "My favorite spot for Chinese. Everything is fresh and quality is great. The people who work there are super nice too.",
            "rating": 5
          },
          {
            "time": "2022-01-18 14:58:47",
            "text": "For one thing, the food was probably the best Chinese food I've had in the city. The portions are big and fairly priced, as well. The kicker that prompted me to write this positive review was how helpful the woman was who answered the phone when I called because UberEats delivered the wrong order. I received a much smaller order for someone with a similar name. The restaurant said I could keep the extra items, and then quickly made the missing items and sent their own delivery driver to get them to me as quickly as they could. Even the driver was very unwilling to keep the small tip I offered him, as a thank you for getting it out to me.\n\nWe're appreciative that they worked to fix our situation and will be ordering from them again in the future!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 12:00 – 10:30 PM",
        "Tuesday: 12:00 – 10:30 PM",
        "Wednesday: Closed",
        "Thursday: 12:00 – 10:30 PM",
        "Friday: 12:00 – 10:30 PM",
        "Saturday: 12:00 – 10:30 PM",
        "Sunday: 12:00 – 10:30 PM"
      ]
    },
    {
      "name": "Cheng Chopsticks",
      "address": "3054 W Armitage Ave, Chicago, IL 60647",
      "phone": "(773) 384-1668",
      "lat": 41.91716,
      "lng": -87.704205,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2020-09-23 15:40:05",
            "text": "The traditional egg drop soup and Chicken Chow Mein with Crab Rangoon were on point.\n\nThe food was ready on time and plentiful!",
            "rating": 4
          },
          {
            "time": "2021-07-07 18:16:22",
            "text": "3.5 stars . Ordered takeout because I didn't want to cook. This place was nearby and I need a local chinese joint. Ugh what was good: cost, fast delivery,...",
            "rating": 4
          },
          {
            "time": "2021-07-12 16:16:38",
            "text": "Super quick and piping hot! This is our go to neighborhood Chinese. You can't go wrong. Rangoon, orange chicken, general Tso chicken, and friend rice are...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-10-13 22:27:18",
            "text": "Cheng Chopsticks is a blessing to my family and the entirety of the delivery area. Prompt, kind, and enthusiastic. Old style Mongolian beef is always on point. Tuesday is a dark day for the community every week, as Cheng Chopsticks is closed on Tuesday.",
            "rating": 5
          },
          {
            "time": "2021-06-09 21:54:31",
            "text": "I ordered the five flavored chicken combo extra spicy which included pork fried rice, egg roll and hot and sour soup. Upon opening the container it looked delicious with lots of veggies and brownish colored rice. I wish it tasted as good as it looked. The sauce on the chicken was bland and I couldn't detect any spiciness at all. There were no distinguishable flavors like I have experienced with other restaurant's recipes. The rice tasted like soy sauce and I never saw or tasted any pork.  The soup also looked great but was just as bland. I ended up tossing it. The portion size was good but that's a moot point if you don't like the flavor.  Overall I'm disappointed.",
            "rating": 2
          },
          {
            "time": "2021-06-06 17:25:13",
            "text": "I ordered vegetable moo shy. It wasn't alright. I prefer rice paper to burrito wraps. The sauce that the veggies were cooked in left the egg and veggies brown and indistinguishable. The spring rolls were huge (more like an egg roll) vs. the small, thinly wrapped rolls that I'm accustomed to.",
            "rating": 3
          },
          {
            "time": "2021-09-11 08:13:43",
            "text": "My favorite chinese food restaurant in the neighborhood. They do not know what a small portion is. Your food is prepare very quickly and has great flavor. It got four stars because the lobby was a mess with their AC dripping water all over the floor. A bit dangerous and unsanitary.",
            "rating": 4
          },
          {
            "time": "2021-09-20 12:08:57",
            "text": "The worst Chinese food I've ever had. Period. And I went in expecting/kinda wanting bad chinese. The kung po was horrific, everything was over or under cooked. I've had better cafeteria food. Out of 3 fortune cookies, one had a fortune. Nuff said. I will never go back and you should never try.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:30 PM",
        "Tuesday: Closed",
        "Wednesday: 11:00 AM – 9:30 PM",
        "Thursday: 11:00 AM – 9:30 PM",
        "Friday: 11:00 AM – 10:30 PM",
        "Saturday: 11:00 AM – 10:30 PM",
        "Sunday: 12:00 – 9:30 PM"
      ]
    }
  ],
  "korean": [
    {
      "name": "Perilla Korean American Fare",
      "address": "401 N Milwaukee Ave, Chicago, IL 60654",
      "phone": "(312) 243-3344",
      "lat": 41.88942,
      "lng": -87.64452,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-03 18:47:28",
            "text": "The best Korean food and hospitality I've experienced in a long time. I would come back to Chicago just for this restaurant!",
            "rating": 5
          },
          {
            "time": "2022-03-18 18:21:39",
            "text": "Perilla Chicago is a Korean bbq Restaurant in the Fullerton District in Chicago, IL. I found this restaurant when they were featured on the Michelin guide...",
            "rating": 5
          },
          {
            "time": "2022-04-20 07:18:06",
            "text": "This review is for restaurant week and the $55 prix fixe dinner (hansik menu)\n\nThe biggest thing I remember about the interior is that the restaurant is...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-03 22:10:32",
            "text": "Not enough good things to say about this restaurant. Food is amazing: great flavor profiles and options. The staff was absolutely amazing. They were ALL so welcoming. Minji served us and made the experience even better than it already was. She was patient with our questions since we had not been to Korean BBQ; she had great recommendations, and was a great server. Our glasses were never full, our bellies were surely full. We will be back, we will recommend. Best restaurant week experience so far!",
            "rating": 5
          },
          {
            "time": "2022-03-27 22:06:22",
            "text": "Had great experience in Perilla with my husband. We tried two Chicago restaurant week menus and it turned out to be a good choice for first time dinner so you can try out different varieties in a single meal. The presentation was beautiful and the taste was even better. We will definitely go back in the future to try out their regular menu items.",
            "rating": 5
          },
          {
            "time": "2022-04-03 08:50:35",
            "text": "The food and service were amazing. The waitress did a great job ensuring we ordered correctly and had a great experience. They also were great at accommodating our 3 year old son. We will definitely be back.",
            "rating": 5
          },
          {
            "time": "2022-01-31 09:31:07",
            "text": "Go here to get Korean BBQ! It's the perfect atmosphere! It's got this great \"nightlife\" loungy feel. They cook the food and describe each of the meats so you know what it is...the quality of meat and how to cook it and why they cook it like they do. They are super attentive and fill up your water the second you take a few sips. It was delicious food. Perfect for date night!",
            "rating": 5
          },
          {
            "time": "2021-11-22 01:38:37",
            "text": "One of my favorite dumpling places in the city! I’m a vegetarian and the steamed veggies ones are packed with flavor! The glass noodles and scallion pancake were also superb. Atmosphere is 10/10 in the restaurant- very trendy, modern - perfect for date night or friends. Service, staff, manager are also great. Have eaten on their outdoor patio in the summer as well and have also carried out - all have been great experiences and food! Will continue to dine there!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 5:00 – 9:00 PM",
        "Thursday: 5:00 – 9:00 PM",
        "Friday: 5:00 – 10:00 PM",
        "Saturday: 5:00 – 10:00 PM",
        "Sunday: 5:00 – 9:00 PM"
      ]
    },
    {
      "name": "En Hakkore",
      "address": "1840 N Damen Ave, Chicago, IL 60647",
      "phone": "(773) 772-9880",
      "lat": 41.9150939,
      "lng": -87.6777957,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-27 14:06:03",
            "text": "If you go here, get the \"Friend\" sushi burrito  (although my friends swear by the poke bowls). It's massive, tasty, and the ingredients are quality. You can...",
            "rating": 5
          },
          {
            "time": "2021-12-14 12:40:55",
            "text": "This place looks very unassuming but the bim bim bop was super fresh and tasty. Lots of yummy fresh veggies all arranged beautifully with a spicy korean...",
            "rating": 5
          },
          {
            "time": "2020-11-12 10:37:03",
            "text": "This place is terrific! I've been wanting to try it out for years but now that I live closer, will frequent this places\nIt has a small menu - paratha tacos,...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-16 21:36:57",
            "text": "Firstly, the staff is really cool and help create a nice environment. Definitely agree that the food is definitely worth the prices. Tacos in traditional taquerias are now averaging north of $3.50. Here, you got around twice the meat and with some delicious sauce to accompany them. You can’t go wrong with any of them but the spicy Korean pork is delicious. I will definitely be making the drive to eat here more frequently.",
            "rating": 5
          },
          {
            "time": "2022-04-06 17:31:51",
            "text": "Great little place. Tacos are a perfect size and price for a filling lunch. Bowls aren't as tasty without the awesome shell but still filling and healthy. Quick but healthier.",
            "rating": 5
          },
          {
            "time": "2022-03-18 14:13:14",
            "text": "I've been coming here the last few weeks. The pratha tacos are very tasty and the proportions are generous. ...Affordable, delicious and the service here is great:-)",
            "rating": 5
          },
          {
            "time": "2022-01-26 18:12:52",
            "text": "My go-to for a quick bite. Beef paratha tacos are amazing, especially for the price. Super fast turnaround and friendly staff.",
            "rating": 5
          },
          {
            "time": "2021-11-18 16:04:23",
            "text": "This has been our go to spot for quick and simple bibimbap for many years. Food is always fresh and delicious. Staff is friendly.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:30 AM – 8:30 PM",
        "Wednesday: 11:30 AM – 8:30 PM",
        "Thursday: 11:30 AM – 8:30 PM",
        "Friday: 11:30 AM – 8:30 PM",
        "Saturday: 11:30 AM – 8:30 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Cuckoo",
      "address": "5143 N Clark St, Chicago, IL 60640",
      "phone": "(773) 654-3549",
      "lat": 41.9756594,
      "lng": -87.66817405559821,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-19 14:18:34",
            "text": "It was so cute inside! It said they were having their soft opening. Japanese/Korean foods and bubble tea and specialty drinks. I got a combo fruit tea which...",
            "rating": 5
          },
          {
            "time": "2022-04-09 12:56:22",
            "text": "The staff is super nice and the food is really tasty. Seating is limited. Definitely recommend. Note that the bubble tea and fruit tea drinks are less sweet...",
            "rating": 5
          },
          {
            "time": "2022-04-06 13:55:59",
            "text": "I work in the area and I am always looking for good food to eat on my lunch break and recommend.\n\nCuckoo just opened up and I was excited to try their...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-09 19:51:16",
            "text": "Andersonville's new bubble tea spot also has outstanding food. This place is amazing.\n\nThe chicken wings and tenders are delicious. We tried soy garlic, secret spicy and honey mustard and they were all winners. The scallion pancake is also great and the radishes that come with the food are perfect.\n\nIt was the soft open and it was packed. Good luck, we'll be back!",
            "rating": 5
          },
          {
            "time": "2022-04-13 20:00:00",
            "text": "Passed by this place and had to try it out. Ordered a chicken rice bowl, honey butter wings, and fried buns. My friends ordered the Korean veggie bowl and another chicken bowl. (They don't have a big selection for vegetarians, but it is a chicken place so it's good they still have a few.)\n\nIt's not very big, you can order from the cashier or through a machine, and then take a seat at one of the 5 tables or the counter at the front.\n\nThe menu selection is a mix of Korean, Japanese, and American. There's rice bowls and pork buns, but also chicken sandwiches and fries. It should satisfy both eastern and western cravings.\n\nEverything felt very casual, you grab your own water and to-go boxes in the back. Restrooms are private and clean unisex, located near the kitchen. And the food came out pretty fast.\n\nThe chicken wings were the highlight. This is definitely a wing place. Crispy and tender and full of flavor. I wouldn't mind trying every wing flavor on the menu.\n\nI didn't know what the fried buns were when I ordered, but I wanted to try them. Turns out they're kinda like donuts. Came with a side of icing to dip in too. Not too sweet, hot and fresh. Great simple appetizer.\n\nThe rice bowl was a nice big portion of rice and chicken with some lettuce and a white sauce that reminded me of the stuff you put on gyros. You're gonna get exactly what the pictures on the menu show.\n\nIf you're in the area and craving some good chicken, definitely check it out.",
            "rating": 4
          },
          {
            "time": "2022-03-23 19:26:03",
            "text": "I carried a paper bag of wings home for like 15 minutes and they were *still* crunchy and crispy and delicious when I ate them. For Cuckoo only having had a soft-opening, they seem to really have their process together. Can't wait to come back to try more of the menu. What a great addition to Clark this is.",
            "rating": 5
          },
          {
            "time": "2022-04-02 14:27:44",
            "text": "Went during the soft open. The milk tea was awesome--perfect level of sweetness and perfectly cooked boba. Unfortunately, the chicken without the sauce was pretty bland. Will still go back and try other bits of the menu! The 10 wing variety pack with sides looked like a great deal.",
            "rating": 4
          },
          {
            "time": "2022-04-12 18:02:33",
            "text": "We got the soy garlic tenders and I highly recommend them! The sauce was amazing and the pickles were a perfect balance to the sauce flavors. Also, I have no idea why every place with finger food doesn't come with gloves.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:30 AM – 9:30 PM",
        "Tuesday: Closed",
        "Wednesday: 11:30 AM – 9:30 PM",
        "Thursday: 11:30 AM – 9:30 PM",
        "Friday: 11:30 AM – 10:00 PM",
        "Saturday: 11:30 AM – 10:00 PM",
        "Sunday: 11:30 AM – 9:30 PM"
      ]
    },
    {
      "name": "Iron Age Korean Steakhouse",
      "address": "1265 N Milwaukee Ave, Chicago, IL 60622",
      "phone": "(773) 697-7622",
      "lat": 41.905036,
      "lng": -87.66856,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-12 12:37:29",
            "text": "Food was fantastic but my server KAYLA SCHMIDT was horrible. I have never had such terrible service in my life. Not only did it take nearly 20 minutes for...",
            "rating": 3
          },
          {
            "time": "2022-03-13 12:47:48",
            "text": "I've been coming here for many years and have many regular wait staff that I adore and who are always concise and thoughtful. However, last night I took my...",
            "rating": 5
          },
          {
            "time": "2022-03-24 12:57:05",
            "text": "Too crowded, no masks, too loud, and pretty much only meat. It's great if that was what you were looking for.",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-03-29 00:02:00",
            "text": "Was a better experience than I was expecting!\n\nVery spacious seating and environment; the vibe was very casual and music (K-pop of course) wasn’t too distracting.\n\nFood choices (entree and sides) were a bit on the simple side, but pretty good quality for the price we paid for all-you-can-eat!\n\nSo unfortunate we had to wait over an hour Saturday at 5 pm, for a party of two to get seated. Wish they took reservations.",
            "rating": 4
          },
          {
            "time": "2022-03-18 22:52:31",
            "text": "I would rate them 5 stars. We were celebrating a friend's achievement, and the waiter was honestly the best! Kind and always there for us. We had a cake and the waitress (Lorena) helped us with some plates . Manager then came to say that we were not allowed to eat anything from outside, in a very disrespectful way. Felt bad for the amazing waitress we had. I understand we were not allowed (we did not see the post outside) but that was just not the way to let us know once the cake was already served (they didn't want to give us forks or spoons)\n\nFood was amazing otherwise!",
            "rating": 4
          },
          {
            "time": "2021-09-22 01:38:54",
            "text": "The place is great. Servers are very friendly and very attentive. Food is amazing and it's at such a reasonable price. 5/5 Would recommend. Also, this particular server was great, would definitely love to have him again. Elan (Elon?) is his name I think.",
            "rating": 5
          },
          {
            "time": "2021-04-27 18:56:01",
            "text": "The food was amazing!!! Our server was so friendly and helpful. He was very patient with us as it was our first time there and we had no clue about what we were doing. The prices were great as well.",
            "rating": 5
          },
          {
            "time": "2021-08-21 21:34:41",
            "text": "Don’t know if it’s because they’re in the city and they have to uphold the quality, but the time I spent there was fabulous.\nTop notch quality both the service and the food, they even let us come in despite the fact that we were drenched after a little storm. Truly unlimited meat",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 12:00 AM",
        "Tuesday: 11:00 AM – 12:00 AM",
        "Wednesday: 11:00 AM – 12:00 AM",
        "Thursday: 11:00 AM – 12:00 AM",
        "Friday: 11:00 AM – 12:00 AM",
        "Saturday: 11:00 AM – 12:00 AM",
        "Sunday: 11:00 AM – 12:00 AM"
      ]
    },
    {
      "name": "Kim's Korean Cuisine and Sushi",
      "address": "3422 N Broadway, Chicago, IL 60657",
      "phone": "(773) 799-8800",
      "lat": 41.94398,
      "lng": -87.64537,
      "rating": {
        "Yelp": 5.0,
        "Google": 5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-10-23 11:36:09",
            "text": "Most flavorful jap chae we've had (including West Coast - California :D); Miso soup hearty (not just water and miso paste); Bibimbap - good portion,...",
            "rating": 5
          },
          {
            "time": "2021-11-08 17:19:49",
            "text": "i had no expectations ordering grubhub from here tonight but was so impressed! got the pork cutlet ($16.95) with rice and shredded cabbage, and it came with...",
            "rating": 4
          },
          {
            "time": "2022-03-10 21:27:08",
            "text": "Hmmmm.... A little confused about these reviews. Service was extremely slow. The sushi was extremely Americanized not in a great way. I had the spicy  tuna...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-04-13 19:39:21",
            "text": "Such a nice owner. And the food is fantastic. Had the Spicy Chicken which was all white meat and lots of veggies. The sauce had a slight sweet note to make it just right. In my top 5 places for great food and atmosphere.",
            "rating": 5
          },
          {
            "time": "2022-04-15 11:32:49",
            "text": "the food? delicious, fresh, authentic\nthe ambiance? relaxed, good energy\nthe SERVICE? 6 stars out of 5. so friendly and accommodating. I loved it and will definitely be back :)",
            "rating": 5
          },
          {
            "time": "2022-03-26 10:07:59",
            "text": "감사합니다!! 최고의 한국 음식! 맛있다 ...좋아 요!\nKim's food is so good! You really should come try, she is so hospitable. The food holds magical powers, for me at least. And by the end of the night I learned Korean. 😌",
            "rating": 5
          },
          {
            "time": "2022-04-15 20:15:32",
            "text": "Wow. Not only is the sushi delicious but the service too! We got complimentary sides and deserts. They are top notch. Definitely coming back again!",
            "rating": 5
          },
          {
            "time": "2022-01-07 05:28:40",
            "text": "Mom n pop restaurant - Fantastic food and top notch service. The (assuming) owner lady was very sweet and she kept giving us free stuff.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:30 AM – 9:30 PM",
        "Tuesday: 11:30 AM – 9:30 PM",
        "Wednesday: Closed",
        "Thursday: 11:30 AM – 9:30 PM",
        "Friday: 11:30 AM – 10:00 PM",
        "Saturday: 11:30 AM – 10:00 PM",
        "Sunday: 11:30 AM – 9:30 PM"
      ]
    },
    {
      "name": "Kimchi Pop",
      "address": "939 N Ashland Ave, Chicago, IL 60622",
      "phone": "(872) 802-4424",
      "lat": 41.8991,
      "lng": -87.66698,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-23 16:50:10",
            "text": "First time ordering and I was amazed how good it was.  Pork, rice noodles and scallion pancake are must orders. Dumplings and ribeye bop can be skipped....",
            "rating": 5
          },
          {
            "time": "2021-12-01 08:09:07",
            "text": "Stopped in on a weekday evening for dinner. A pretty small storefront and only a few tables but there weren't many people eating in. Apparently the way to...",
            "rating": 4
          },
          {
            "time": "2022-03-06 08:39:26",
            "text": "A cozy, casual place for some comforting Korean food, especially great for Chicago winters! We love that it's BYOB. The counter service is quick and easy,...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-15 19:54:46",
            "text": "I love this place ❤️ a 4 because I think it the taste has changed just a bit in the last couple of years. Still my favorite for Korean comfort foods 🤤",
            "rating": 4
          },
          {
            "time": "2021-12-24 23:41:28",
            "text": "I would give more than 5 stars if i could.\nI could experience the original taste of Korean food at this restaurant. Highly recommend 치즈 닭갈비 & 짬뽕. The staffs were really kind too.",
            "rating": 5
          },
          {
            "time": "2022-04-10 15:10:05",
            "text": "Best Bibimbap I ever had! The kimchi stew was amazing as well and the staff members were very friendly. Highly recommend for authentic Korean food!",
            "rating": 5
          },
          {
            "time": "2022-01-05 16:59:01",
            "text": "Their tteokbokki was pretty good, a little sweet but I did ask for extra spicy and did help a little. Super kind and not super expensive but not cheap either. I really liked it.",
            "rating": 4
          },
          {
            "time": "2021-12-18 00:20:11",
            "text": "Omg this place was so random for me and my 12 yr old. Now let me tell you the Kim chi stew was wonderful extremely delicious. My daughters soup was also wonderful unfortunately I don't remember the name of it 😕. Just great food overall. You can taste the spices and it was a wonderful blend of flavors",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 5:00 – 9:00 PM",
        "Tuesday: 5:00 – 9:00 PM",
        "Wednesday: 5:00 – 9:00 PM",
        "Thursday: 5:00 – 9:00 PM",
        "Friday: 5:00 – 9:00 PM",
        "Saturday: 11:30 AM – 3:00 PM, 5:00 – 9:00 PM",
        "Sunday: 11:30 AM – 3:00 PM, 5:00 – 9:00 PM"
      ]
    },
    {
      "name": "Daebak Korean BBQ",
      "address": "2017 S Wells St, Fl 2, Chicago, IL 60616",
      "phone": "(312) 631-3913",
      "lat": 41.8548019,
      "lng": -87.632522,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.2
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-19 18:47:08",
            "text": "The food was great - a little steep but definitely will fill you up. We had made a reservation through Yelp but apparently those are not valid, only ones...",
            "rating": 3
          },
          {
            "time": "2022-02-04 08:10:58",
            "text": "I have yet to go to a kbbq place where theres a vent for the meat & you're not bringing kbbq smell home with you. I enjoyed all the different bonchon &...",
            "rating": 5
          },
          {
            "time": "2022-04-09 05:56:46",
            "text": "An alright Korean spot in Chinatown. I thought the quality of the food was pretty good, but it definitely feels like a rushed experienced. \n\nMy friend and I...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-03-27 15:33:09",
            "text": "Our family decided to celebrate my sister’s birthday at Daebak tonight. Upon arriving I asked one of the servers if I can hand over the birthday cake so they can put it on their fridge. They said they can’t take the cake. That’s fine, I figured their kitchen is busy so we didn’t think much of it. After dinner as we were getting ready to cut the cake, our server (also the same server I asked prior to being seated) said Daebak does not allow cakes to be served. We asked why and they informed us it was just because the owner said so. Why was it not mentioned when I initially asked to place the cake in their fridge? We asked to speak to the owner and the server said they spoke to the owner and they wouldn’t talk to us. As you can understand our family were extremely displeased as it was not mentioned earlier before we were seated that we can not cut and eat celebration cakes. At the end we ended up spending $360 at a restaurant that does not allow their customers to celebrate their birthdays with cake. Extremely disappointed to say the least. What was meant to be a nice celebration and dinner left everyone feeling deflated.\n\nEdit*\nBecause we were not able to cut our cake last night, we went out again tonight to properly celebrate her birthday. We went next door to Cai. Food was delicious and prices are very reasonable.\n20% gratuity was not automatically applied but we tipped well over that. Service was friendly as well.",
            "rating": 1
          },
          {
            "time": "2021-07-21 14:01:28",
            "text": "Overall decent experience. Food was great a lot of side dishes to accompany the selection of meat. Service was quick and good. Price was reasonable. I’d go there again.",
            "rating": 4
          },
          {
            "time": "2021-04-13 17:07:29",
            "text": "Do not let the negative reviews fool you, this place is awesome and so worth visiting. If your kid is a K-pop fan like my daughter this is the place for you, they play all kinds of k-pop music videos on their giant tv screen. The ambiance is just awesome for kids and adults. Our experience here was incredible! From the waiters being super nice and helpful since it was our first time trying Korean BBQ, the food being delicious and savory along with the sides and the Mozzarella corn dog downstairs was on point. You will not regret visiting this place!",
            "rating": 5
          },
          {
            "time": "2021-03-25 20:28:50",
            "text": "Everything tastes so good! Variety of sides are impressive and perfect to pair for your meal.\n\nSoups in the meat combos make a great addition. They use the bones from their meat to make the broth..the meat is flavorful so it’s no wonder the soups tastes so good!\n\nExperience was nothing less than perfect.\n5 stars for the service, atmosphere, and cleanliness.",
            "rating": 5
          },
          {
            "time": "2022-02-12 16:49:24",
            "text": "A fantastic 반찬 (side dishes) spread. The restaurant cooks on the grills in front of you and everything is delicious. Service was a efficient and friendly. 10/10 would recommend. Super full with perfect proportions of meat. Yummy, clean eating. 잘 먹겠습니다!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:15 PM",
        "Tuesday: 11:00 AM – 9:15 PM",
        "Wednesday: 11:00 AM – 9:15 PM",
        "Thursday: 11:00 AM – 9:15 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 9:15 PM"
      ]
    },
    {
      "name": "Ssyal Ginseng House",
      "address": "4201 W Lawrence Ave, Chicago, IL 60630",
      "phone": "(773) 427-5296",
      "lat": 41.968425,
      "lng": -87.732829,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-21 11:07:29",
            "text": "Came here for samgyetang and I'm not disappointed  it's delicious! I'd recommend this place if you are craving soul food that will warm up your body",
            "rating": 5
          },
          {
            "time": "2022-01-04 15:16:00",
            "text": "Ordered a to go order of two soup orders and a japchae. I order from this place a lot usually just simple soup. I liked their japxhae before but it was made...",
            "rating": 3
          },
          {
            "time": "2021-11-12 21:29:46",
            "text": "Great food! We went and got the spicy squid, premium ginseng soup, spicy beef broth soup, seafood pancake, bulgogi soup, mandu, and spicy rice cake with...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-01-06 08:19:21",
            "text": "If you like Korean food, especially a traditional Korean chicken soup dish, this is the place to go.  It's a drive and city parking is a pain, but the food is worth it!  I've eaten there 3 times and it's fabulous.  Clean inside.  Friendly service.  Healthy and delicious cuisine.",
            "rating": 5
          },
          {
            "time": "2022-01-04 01:50:14",
            "text": "Everything tasted so fresh. This is more of a sit down homey kind of vibe. If you want more of a bar feel this is not the place for you. It is definitely family and kid friendly. Everything was super clean. This is a family owned restaurant and the lady was very fast on taking our orders and making sure everything came out on time as well. Definitely will come back again!",
            "rating": 5
          },
          {
            "time": "2022-04-02 16:37:22",
            "text": "Absolutely amazing. Perfect for a rainy day and the soup was so tasty. The banchan is also very fresh and delicious. Definitely coming back again!",
            "rating": 5
          },
          {
            "time": "2022-04-02 14:35:27",
            "text": "This is the best Korean food I’ve ever had! Plus our server Jina was so amazing! She recommended the best. Highly recommend",
            "rating": 5
          },
          {
            "time": "2022-04-02 14:33:38",
            "text": "This is an amazing restaurant! The Korean food is excellent and Jina was such a great host for our large party. A+ highly recommended.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 8:45 PM",
        "Tuesday: 11:00 AM – 8:45 PM",
        "Wednesday: 11:00 AM – 8:45 PM",
        "Thursday: 11:00 AM – 8:45 PM",
        "Friday: 11:00 AM – 8:45 PM",
        "Saturday: 11:00 AM – 8:45 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "SoJu BBQ",
      "address": "36 S Ashland, Chicago, IL 60607",
      "phone": "(312) 877-5206",
      "lat": 41.8803115441906,
      "lng": -87.6669892108769,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-26 07:58:25",
            "text": "Cute little place that offers food with great flavor! I've been here twice now and liked the food both times. I've gotten the beef bulgogi bibimbap and the...",
            "rating": 5
          },
          {
            "time": "2021-12-21 11:58:42",
            "text": "Wanted to love the place...some of the food was good some was blah\n\nNeed to go back and try again but won't splurge like last time\n\nThe appetizer Korean...",
            "rating": 3
          },
          {
            "time": "2021-11-22 09:45:28",
            "text": "Came here on a week day night and half the seats were filled. Seated quickly and had our orders taken. Despite the restaurant being half full, there...",
            "rating": 2
          }
        ],
        "Google": [
          {
            "time": "2022-03-20 00:12:09",
            "text": "The food here is pretty good. I’ve been here twice already and we all order something different. So far not disappointed. I removed the two stars because every time I have went, our server has not been great. Not friendly and really just rushes you. Once we got our food she immediately gave us the check. I’ve gotten her twice already, an American girl. Really wish they would work on their service, it makes a huge difference.",
            "rating": 3
          },
          {
            "time": "2021-09-04 13:59:38",
            "text": "This place was great! Excellent food and great service. A group of friends and I arrived close to closing time and they stayed open for us. They were so kind and the food was absolutely delicious",
            "rating": 5
          },
          {
            "time": "2022-03-21 02:26:26",
            "text": "Had a long climbing session at Brooklyn Boulders,  just a couple of blocks away and we had a hankering for some marinated meats. This place did not disappoint! The food was tasty, and super close. Parking was 5/10 but hey, it's West Loop.",
            "rating": 5
          },
          {
            "time": "2022-03-11 17:48:10",
            "text": "Great staff great food great music at your request. I can't say enough about this restaurant. It was my first visit and I was pleasantly surprised. Everything was delicious but the pork belly was so damn good! Get the sampler platter and the all you can drink soju. So much food and good dinning atmosphere. I'd give 100 stars if I could.",
            "rating": 5
          },
          {
            "time": "2022-03-13 01:54:52",
            "text": "First time eating here. It was great to find a place serving halal Korean BBQ. We had the brisket, Ribeye sandwich, and Korean Fried Chicken. Very flavorful and the sauces are amazing. The staff is fast and polite. Highly recommend.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 4:00 – 9:30 PM",
        "Tuesday: 4:00 – 9:30 PM",
        "Wednesday: 4:00 – 9:30 PM",
        "Thursday: 12:00 – 9:30 PM",
        "Friday: 12:00 – 10:30 PM",
        "Saturday: 12:00 – 10:30 PM",
        "Sunday: 12:00 – 9:30 PM"
      ]
    },
    {
      "name": "Del Seoul",
      "address": "2568 N Clark St, Chicago, IL 60614",
      "phone": "(773) 248-4227",
      "lat": 41.929444,
      "lng": -87.643016,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-16 22:45:23",
            "text": "Some of the most delicious tacos i've ever had!!!Seriously, the toppings are so fresh and the shrimp and fish are juicy and tender. My friend and I drove 40...",
            "rating": 5
          },
          {
            "time": "2022-04-10 12:29:02",
            "text": "I was visiting the Lincoln Park area one day and happened to walk by Del Seoul. I've heard good things about it from friends in the past and was slightly...",
            "rating": 5
          },
          {
            "time": "2022-04-17 23:16:49",
            "text": "Korean and Mexican fusion, the tacos are pretty big portions, very flavorful and fun.\n\nI will come back to try other food in the menu",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-17 19:02:32",
            "text": "Came in for a late lunch after work. I ordered the spicy tofu hotpot. The service at Del Seoul was quick. I just wish they had more soup (stew) options on the menu. Highly recommend their bento box dinner!",
            "rating": 4
          },
          {
            "time": "2021-12-04 20:47:16",
            "text": "Did take out. Food was ready on time and really impressive. The wings are now my favorite in Chicago and the kimchi fries were excellent. 100% recommend",
            "rating": 5
          },
          {
            "time": "2022-04-11 23:47:29",
            "text": "Del Seoul has some pretty decent Korean street food. Loved the tacos and the K-town wings. They blend just the right amount of sweet and savory flavors.",
            "rating": 5
          },
          {
            "time": "2022-02-19 22:03:31",
            "text": "Can’t say enough good things about this place! I’ve tried so many different things on their menu and I’ve been left craving more every time I go home. There’s a reason why they’ve been seen on the Food Network channel. Speaking of which, there is no mention of their features anywhere in the restaurant. They stay true to who they are and that spirit is reflected in their food. 1000% recommend to everyone!",
            "rating": 5
          },
          {
            "time": "2020-09-20 16:22:55",
            "text": "Tha shrip taco is delicious",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 12:00 – 8:30 PM",
        "Tuesday: 12:00 – 8:30 PM",
        "Wednesday: 12:00 – 8:30 PM",
        "Thursday: 12:00 – 8:30 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 8:30 PM"
      ]
    }
  ],
  "cuban": [
    {
      "name": "90 Miles Cuban Café",
      "address": "2540 W Armitage Ave, Chicago, IL 60647",
      "phone": "(773) 227-2822",
      "lat": 41.9176864624023,
      "lng": -87.6918029785156,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-04 16:48:27",
            "text": "I took my best friend for his birthday as Cuban food is his favorite. It was my first time there, and when I walked in I was transported into Little Havana....",
            "rating": 5
          },
          {
            "time": "2022-04-03 08:03:24",
            "text": "I was really really excited to try this spot, but was pretty disappointed in the quality of food and the service as well. \n\nDefinitely a fun vibe that...",
            "rating": 2
          },
          {
            "time": "2022-04-02 13:22:52",
            "text": "Came in on a Thursday night and only the front of the restaurant was open for dine in. AKA right by the kitchen. This shouldn't even be a sitting area as it...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-03-30 20:56:27",
            "text": "Fabulous food! Great patio. BYOB with decent corkage fee. Mojito mix is lovely.   Takes reservations. Food for meat eaters and vegetarians. Love having brunch here!!!",
            "rating": 5
          },
          {
            "time": "2022-02-15 10:20:35",
            "text": "I had an amazing brunch with my friends here, it's BYOB and we brought a little bit of everything lol. We bought pitchers of juice and ate some amazing food. I highly recommend the steak and eggs from the brunch menu, and the French toast. Wear some warm shoes if you sit outside!",
            "rating": 5
          },
          {
            "time": "2020-08-28 17:11:57",
            "text": "Guarito is always on point!",
            "rating": 5
          },
          {
            "time": "2021-10-24 21:41:47",
            "text": "Amazing food, really fun atmosphere. Few tips for you:\n1) You have GOT to get a smoothie.\n2) its BYOB\n3) the cuban sandwich is good, but their other dishes are very much worth ordering.\n4) not the best place for vegetarians, their strength is the meat",
            "rating": 5
          },
          {
            "time": "2022-01-05 19:18:44",
            "text": "One of my favorite places. It is a BYOB and the food is great. This is a very cozy place but not fancy. I especially enjoy this place in the summertime when the eating area is open and you can enjoy the outdoor feel like you are on the island but in the city..",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 11:00 PM",
        "Saturday: 10:00 AM – 11:00 PM",
        "Sunday: 10:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Cuba 312",
      "address": "2054 W Roscoe St, Chicago, IL 60618",
      "phone": "(773) 281-2822",
      "lat": 41.943481,
      "lng": -87.680633,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-12 18:17:28",
            "text": "yuuuuuup everything about this place yup. cozy atmosphere, not fast food but not fancy restaurant. the chicken empanadas  I got a coconut- Tito's concoction...",
            "rating": 5
          },
          {
            "time": "2022-01-09 10:48:15",
            "text": "What a cute little restaurant!  Had a friend from out of town come in and we wanted to have dinner and drinks at a nice low key restaurant.  Perfect place...",
            "rating": 4
          },
          {
            "time": "2022-03-28 12:58:53",
            "text": "I think I've found my new favorite Cuban place! Cuba 312 was outstanding. We got there when it just opened so the service was great. The chicken empanada...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-09-07 04:26:22",
            "text": "10of5 STARS.. FOOD IS AWESOME, ATMOSPHERE FEELS LIKE SITTING AT A ISLAND RESTAURANT,  STAFF IS WONDERFUL.  IF YOU ARE LOOKING FOR A PERFECT MEAL TO BOAST ABOUT STOP IN. THIS PLACE WAS THE BEST STOP ON MY CHICAGO VACATION. A MUST DO!😁",
            "rating": 5
          },
          {
            "time": "2021-07-03 21:46:45",
            "text": "Amazing! I can't believe it took so long for me to try this place.\n\nFood was great. Drinks tasted like summer. The staff super friendly. Good stuff.",
            "rating": 5
          },
          {
            "time": "2021-09-24 23:58:46",
            "text": "Great food! It's comfy food. And amazing drinks! This is coming from a Colombian",
            "rating": 5
          },
          {
            "time": "2022-03-26 23:24:58",
            "text": "Love this hidden gem - the food is always amazing and the staff/owner are some of the sweetest people I’ve met.",
            "rating": 5
          },
          {
            "time": "2021-11-24 11:35:33",
            "text": "So far 3 for 3 in visits, everything we’ve ordered came out great.  The outer skirt, plantains fritas surf and turf all so good. Even the basic kids chicken was fresh and yummy.  Love this place",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 5:00 – 9:00 PM",
        "Wednesday: 5:00 – 9:00 PM",
        "Thursday: 5:00 – 9:00 PM",
        "Friday: 5:00 – 10:00 PM",
        "Saturday: 12:00 – 10:00 PM",
        "Sunday: 12:00 – 8:00 PM"
      ]
    },
    {
      "name": "Cafecito",
      "address": "7 N Wells, Chicago, IL 60606",
      "phone": "(312) 263-4750",
      "lat": 41.882416,
      "lng": -87.633641,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-18 13:32:59",
            "text": "This place was great!  I hope one day Cafecito will expand my way out in the suburbs; if it were closer, I would probably eat here all of the time.  As it...",
            "rating": 5
          },
          {
            "time": "2022-02-05 00:01:02",
            "text": "Added this place to my Chicago itinerary after seeing the raving reviews here and ended up trying the chivito and cafe con leche. They were both okay. \n\nI...",
            "rating": 3
          },
          {
            "time": "2022-01-18 16:18:51",
            "text": "I've always loved this spot. Their food is quality. The bean soup is tasty. I haven't had a bad sandwich. If you order on Yelp, go earlier than what Yelp...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-07-30 15:19:15",
            "text": "Food is ok. They gave me the wrong dessert that I ordered. Prices are decent for that location.",
            "rating": 3
          },
          {
            "time": "2021-09-27 00:35:38",
            "text": "Jerk chicken sandwich was delicious, juicy and very tasty. Will go back again very soon.",
            "rating": 5
          },
          {
            "time": "2021-08-01 13:52:17",
            "text": "The Cubanos, and beans and rice are my default. 🤤 cafecito restaurants keep it all consistent from store to store !",
            "rating": 5
          },
          {
            "time": "2021-08-04 22:13:58",
            "text": "Had a great sandwich (a cubano), loaded with meat.\n\nSurprisingly wide selection of vegan food!",
            "rating": 5
          },
          {
            "time": "2021-04-20 19:16:59",
            "text": "This food gives me the feels plus a nice cafecito after. always on point",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 8:00 AM – 5:00 PM",
        "Tuesday: 8:00 AM – 5:00 PM",
        "Wednesday: 8:00 AM – 5:00 PM",
        "Thursday: 8:00 AM – 5:00 PM",
        "Friday: 8:00 AM – 5:00 PM",
        "Saturday: Closed",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Mima's Taste of Cuba",
      "address": "2925 W Irving Park Rd, Chicago, IL 60618",
      "phone": "(773) 654-3075",
      "lat": 41.95365,
      "lng": -87.70171,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-12 17:59:12",
            "text": "Ended up here accidentally. We actually wanted to visit the place across the street, but they didn't have a patio open. Since day was sunny we wanted to sit...",
            "rating": 5
          },
          {
            "time": "2022-04-09 06:18:10",
            "text": "We ate lunch at Mina's yesterday and it was amazing.\nThere were 4 of us and we ordered empanadas and croquettes for appetizers. We then ordered a Cuban...",
            "rating": 5
          },
          {
            "time": "2022-02-27 23:00:25",
            "text": "finallyyyy a jibarito not too dry not too oily, literally perfect! Omggg don't even get me started on that Henny Passion!!! Highly recommend. Don't sleep on...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-09 20:44:10",
            "text": "This is the spot to go for great service and great flavorful Cuban food! Jamie at the walk in had the warmest welcome and greeting. They called us when our table was ready and the whole time they made sure to check on us. Great vibes, music and food! Def will be back and def recommend!",
            "rating": 5
          },
          {
            "time": "2021-05-16 02:32:51",
            "text": "Called at 8:25pm several times to place an order for pick up and their phone was off. Since closing time was at 9:00pm. I know restaurants are extremely busy but u can be loosing alot of potential costumers by not answering phones.\nGave it 4 stars because of that reason. Our food was good no complaints on that. The alcohol mixed drinks are too pricey .",
            "rating": 4
          },
          {
            "time": "2021-11-11 10:12:44",
            "text": "Went for lunch and enjoyed the Ropa Vieja. It was really a great dish. The meat was tender and must have been marinated for hours. Really enjoyed it.",
            "rating": 5
          },
          {
            "time": "2021-11-01 22:58:11",
            "text": "Ambiance is cute! Creative items on the menu however the plantain with steak and the yucca I ordered were all bland with no taste.",
            "rating": 2
          },
          {
            "time": "2021-11-06 17:58:21",
            "text": "A colorful corner Cuban restaurant. Sandwiches are good, not many ingredients like it used to, prices are a little up, but still good food and nice staff.",
            "rating": 3
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 8:00 PM",
        "Wednesday: 11:00 AM – 8:00 PM",
        "Thursday: 11:00 AM – 8:00 PM",
        "Friday: 11:00 AM – 9:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: 11:00 AM – 5:00 PM"
      ]
    },
    {
      "name": "Cafecito",
      "address": "215 E Chestnut St, Chicago, IL 60611",
      "phone": "(312) 643-2242",
      "lat": 41.89804,
      "lng": -87.62127,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-17 10:05:41",
            "text": "If you're vacationing in the loop, make this place a first stop. It's a great go-to for breakfast or lunch every and any day. You'll see many things you'll...",
            "rating": 5
          },
          {
            "time": "2022-04-02 15:47:43",
            "text": "I visit here often mostly because this cafe is conveniently close to where I live and their soups are extremely delicious! You can order salads  sandwiches...",
            "rating": 5
          },
          {
            "time": "2022-03-24 11:06:19",
            "text": "This place is one of Chicago's hidden treasures. Best Cuban food in Chicago hands-down and honestly may be the best in the country. Everything on the menu...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-02 18:49:46",
            "text": "I come here often mostly because this cafe is conveniently close to where I live and their soups are extremely delicious!  You can order salads 🥗 sandwiches and meals to go but I prefer to have a seat inside to relax.\n\nTheir food is reliably good and if your particular server isn't available just ask another person or the bartender because they all take turns with the orders here.\n\nI love their sandwiches and soups and if you do order a panini you can upgrade any sandwich 🥪 with soup and a beverage for an additional charge.\n\nThis is also a coffee ☕ shop so if you want a coffee or hot chocolate you can get that here too.\n\nI prefer coming here in the summer for outside seating and yes dogs are allowed so I used to bring my fur baby here in the summer before she passed away this February.\n\nNice relaxing atmosphere and reliably good Cuban dishes in  a casual setting. The prices here are modest and dress casually.  Nice slow pace here -- no one rushes you out the door.  European vibes ✨",
            "rating": 5
          },
          {
            "time": "2022-03-18 21:19:55",
            "text": "I came to the restaurant, waited to be served by the cashier because I wanted to put an order to go, and he decided to serve someone who arrived later. Fine, I let that one pass because the new costumer was a gentleman and I needed time to choose the two sandwiches I wanted. At the end, the cashier disappeared for 7minutes. What the heck? The food is good, but as a Latin I can make it way better. I can make the same stuff at home but fine, let's save time and get food from this place. For what? To be ignored and neglected? This just happened tonight.",
            "rating": 1
          },
          {
            "time": "2022-04-14 13:31:50",
            "text": "We had a great experience. I would definitely recommend this place to my friends. They have good food for decent prices. Service is good as well.",
            "rating": 5
          },
          {
            "time": "2021-10-17 19:00:23",
            "text": "The service has a lot to be desired. They assume everything you order is a sandwich rather than ask if a sandwich or platter. We ordered plantain chips and delivered the dessert ones (the mushy ones) instead. When questioned, they said they ran out of chips. Zero idea why this was not communicated. I gave constructive feedback in private, the owner decided to step in. He was abrupt and clueless. It makes sense why his team behaved the way they did. I'm a sunny disposition person in life (check my other reviews). I'm sharing this only because there are so many places that treat you like a human being, this is NOT one of those places.",
            "rating": 3
          },
          {
            "time": "2022-04-05 13:05:29",
            "text": "My experience was great. The food is delicious! I really like the restaurant setting, it feels cozy. I highly recommend this to anyone looking for a Cuban restaurant.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 8:00 AM – 9:00 PM",
        "Tuesday: 8:00 AM – 9:00 PM",
        "Wednesday: 8:00 AM – 9:00 PM",
        "Thursday: 8:00 AM – 9:00 PM",
        "Friday: 8:00 AM – 10:00 PM",
        "Saturday: 8:00 AM – 10:00 PM",
        "Sunday: 8:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "1492 Cuban Fusion",
      "address": "2615 West North Ave, Chicago, IL 60647",
      "phone": "(773) 227-9601",
      "lat": 41.909976,
      "lng": -87.692779,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-12 16:36:39",
            "text": "My husband and I took a weekend to get away from the kids in Chicago. We drove around for a while to find a good place to eat on our first full day here. My...",
            "rating": 5
          },
          {
            "time": "2022-02-22 14:32:55",
            "text": "This is a family own restaurant with great service and cozy atmosphere. Delicious cuban cuisine, been there 3 times already and I'll be there again soon.",
            "rating": 5
          },
          {
            "time": "2022-02-26 17:42:57",
            "text": "Best Cuban in Chicago! The wait staff was amazing. All the food was delicious and served in a timely manner",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-03 16:19:18",
            "text": "The food is just so homey! The feel of the place is not your typical restaurant in Chicago. There's no plate we haven't ordered in the past and each time we leave to happy. The garlic sauce is perfect to go on everything. This place holds a special place in my heart. Amazing. Just amazing. Go on a date, bring friends, the vibe never dies ❤️ 😘🤌",
            "rating": 5
          },
          {
            "time": "2021-03-18 16:57:30",
            "text": "I enjoy this place very much. I go there at least once a week and get the Cuban sandwich. It's my favorite and I love having a place to be able to go and get one. The owner is always very nice and doing his best to keep customers happy. I highly recommend checking it out.",
            "rating": 5
          },
          {
            "time": "2022-04-03 23:41:22",
            "text": "The food is delicious!!! I especially love their steak sandwiches with a cup of their delicious coffee. The entrees are prepared with elegance and Cuban flair. The desserts are superb. Hands down one of my favorite restaurants in Chicago. I highly recommend this delicious fusion of flavors to perfection!",
            "rating": 5
          },
          {
            "time": "2022-02-27 17:58:56",
            "text": "So delicious! We just moved to the area and have stopped by multiple times. Every dish has been incredible. Very friendly service and we always feel welcomed. Definitely check it out!!",
            "rating": 5
          },
          {
            "time": "2022-04-16 10:50:49",
            "text": "Saw a review of this place on TikTok and had to check it out! Service was quick and easy and the staff was friendly. The Cuban was great and the portions were big for the price! Definitely could split one or save half for later.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 10:00 AM – 9:00 PM",
        "Tuesday: 10:00 AM – 9:00 PM",
        "Wednesday: 10:00 AM – 9:00 PM",
        "Thursday: 10:00 AM – 9:00 PM",
        "Friday: 10:00 AM – 9:00 PM",
        "Saturday: 10:00 AM – 9:00 PM",
        "Sunday: 10:00 AM – 8:00 PM"
      ]
    },
    {
      "name": "Tropicuba Cafe",
      "address": "5606 W Irving Park Rd, Chicago, IL 60634",
      "phone": "(773) 202-2222",
      "lat": 41.9535,
      "lng": -87.7674,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-03 14:36:17",
            "text": "Food is amazing and tamales are unique and super flavorful ! My go to is the pork guisado",
            "rating": 5
          },
          {
            "time": "2022-01-01 20:14:34",
            "text": "My fiancé and I decided to ring out the new year by trying the locally acclaimed Cuban restaurant. I had low expectations because I've always despised this...",
            "rating": 4
          },
          {
            "time": "2022-03-27 18:25:30",
            "text": "This is my first time here today. I can't express how much I enjoyed the food, service and the ambiance. Even the music was great! I started with an...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-11 19:41:43",
            "text": "This place is fantastic! They have probably the best Cuban food I've had outside of Florida yet! The sauces are to die for too, makes the food 10x better than it already is. I will note that they have a small but cozy dining area. For those of you who don't dare leave the house they do a wonderful job packing takeout orders. No fuss! I highly recommend Tropicuba Cafe.",
            "rating": 5
          },
          {
            "time": "2022-02-01 16:05:59",
            "text": "It is a tiny colored great Cuban place with much of flavor!  with variety and warmth of Cuban home.  The coffee with milk is delicious!  A nice & clean place.  The treatment to the guests is friendly and helpful.  The prices are accessible, the best Cuban food in the area.  Highly recommended!",
            "rating": 5
          },
          {
            "time": "2022-01-29 13:31:33",
            "text": "Finally, an awesome sandwich place in Portage Park. Every aspect of the sandwiches here are excellent: the bread, the filing, and the size. My personal fave is the Bistec. However, every one I've tried has been excellent. They've also got awesome milkshakes as well. I suggest placing your order ahead as they're made to order, so it could take a little bit. But that let's you know it'll be fresh and good.",
            "rating": 4
          },
          {
            "time": "2022-03-09 00:30:28",
            "text": "The Cuban sandwich was hittin! Really good meat, bread, sauce, cheese. Good, quick service. Great location - I will be back!",
            "rating": 5
          },
          {
            "time": "2021-10-15 18:52:47",
            "text": "First time here. Clean, neat neighborhood place. Friendly, helpful people. Food was tasty! Cuban sandwich meats were fresh and juicy. Pulled pork sandwich was huge! Great crusty bread. Good selection of things to drink. Will be back!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: 9:00 AM – 8:00 PM",
        "Tuesday: 9:00 AM – 8:00 PM",
        "Wednesday: 9:00 AM – 8:00 PM",
        "Thursday: 9:00 AM – 8:00 PM",
        "Friday: 9:00 AM – 8:00 PM",
        "Saturday: 9:00 AM – 8:00 PM",
        "Sunday: 9:00 AM – 8:00 PM"
      ]
    },
    {
      "name": "Havana Grill",
      "address": "412 N Clark St, Chicago, IL 60654",
      "phone": "(312) 644-1900",
      "lat": 41.88967,
      "lng": -87.6314,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-29 05:00:10",
            "text": "We stopped in a Monday around 2:00. No worries on seating. The waitstaff sat us quickly and our food came so fast. Water refills no problem, friendly all...",
            "rating": 5
          },
          {
            "time": "2022-03-17 11:41:26",
            "text": "As someone who grew up in Spain and recently moved to Chicago from Miami, this place is a bit of home! The Caipirinha's were great, perfectly tangy and...",
            "rating": 5
          },
          {
            "time": "2022-02-26 13:56:36",
            "text": "I stopped in here after running errands a month ago.\nIt had been a long time since I have eaten \"authentic\" Cuban Food and it DID NOT...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-20 19:16:05",
            "text": "Another amazing dinner at the Havana Grill.  Such great food and service.  Already cannot wait to return.  Can we have the recipe to your poblano sauce?  So delicious.  Will be back soon.  Best meal and dining experience! 5 Stars!!!!!",
            "rating": 5
          },
          {
            "time": "2021-05-21 21:33:10",
            "text": "I called ahead to ask if I should make reservations, they said no. I show up and was told it would be a 20 minute wait.. it ended up being almost An Hour to get a table. Sat down and it was another 15 minutes to receive service and get our order taken. The food was great, but the service was horrible. It was supposed to be a nice night out, but the service here really killed the mood.",
            "rating": 2
          },
          {
            "time": "2022-04-17 11:30:55",
            "text": "Great food. Great drinks. Fun, friendly people. Turns into dance spot after dinner hours.\nLively place!",
            "rating": 4
          },
          {
            "time": "2021-10-25 02:19:18",
            "text": "The menu is extensive and always difficult to chose what to get. You cant go wrong with anything you choose.  Also fantastic mojitos. Great vibe great times highly recommend",
            "rating": 5
          },
          {
            "time": "2022-01-10 11:17:35",
            "text": "Havana has such a nice Vibe to it. With great food options! I always get the Havana Steak Sandwich! It’s so good! The flavors are everything. We also get the chimichangas as an appetizer each time! Try these out next time you go here!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 10:00 PM",
        "Tuesday: 11:30 AM – 10:00 PM",
        "Wednesday: 11:30 AM – 10:00 PM",
        "Thursday: 11:30 AM – 10:00 PM",
        "Friday: 11:30 AM – 2:00 AM",
        "Saturday: 11:30 AM – 2:00 AM",
        "Sunday: 11:30 AM – 9:00 PM"
      ]
    },
    {
      "name": "Nini's Deli",
      "address": "543 N Noble St, Chicago, IL 60642",
      "phone": "",
      "lat": 41.89238008006564,
      "lng": -87.66209037896043,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-11 13:08:10",
            "text": "First let me say that I am well aware of the fact that the outspoken politics of the owner of this place has garnered some attention on social...",
            "rating": 5
          },
          {
            "time": "2021-11-16 06:21:26",
            "text": "You only live once, so make sure you try this place while you are alive. I don't think you can come after you are dead. I saw zero ghosts here. \n\nGo ahead...",
            "rating": 5
          },
          {
            "time": "2022-03-26 18:25:04",
            "text": "Juan is definitely the star of the dining experience here at Nini's. You walk in to be greet with a beaming staff who is passionate and super friendly on...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-11-11 22:08:50",
            "text": "If you are looking for a family-friendly place to eat , look no further than Ninis Deli! With great service and excellent hospitality, the restaurant offers more than great food but a wholesome experience. On top of that, it is a Christian-based company that holds to its convictions!",
            "rating": 5
          },
          {
            "time": "2022-02-02 00:02:09",
            "text": "I’ve never seen a restaurant love people so well! Every person that walks through the door at Nini’s is seen and treated with respect. Blown away by what I experienced. All are welcome at Nini’s.\nThe food was incredible! The coffee delicious! The guava cheesecake is amazing!",
            "rating": 5
          },
          {
            "time": "2022-02-02 19:32:17",
            "text": "Everything is absolutely amazing here. You can’t go wrong with anything you get! Cute ambiance as well.",
            "rating": 5
          },
          {
            "time": "2022-01-21 09:40:05",
            "text": "All I can say about this place is that they are definitely great and definitely one of the best spots where I could find delicious deli sandwiches and more. This tiny spot in noble street has various selection of different foods that I was able to explore and I highly recommend their kitchen sink sandwiches but before that this place is just seriously a great spot, it is a usual small spot selling good food. I've been to the place for a lot of times actually and it is always clean and the vibe is kind of pretty chill and casual. The staff in here is friendly and they even gave me recommendation when I went here for the first time. For the times that I visited this spot, I have tried and explore their menu but I would say that their kitchen sink sandwich is the best. It is a sandwich with a huge portion and generous amount of meat. It is just so good that I would never get tired of ordering it each time I would visit the place. Their chicken empanada is also good that I always love to order for sides.",
            "rating": 5
          },
          {
            "time": "2021-10-14 11:33:41",
            "text": "Nini's Deli was rated the #1 place to eat in 2020 on Yelp in ALL of Chicago AND the state of Illinois.  I assure you that the food is still as amazing as it was then.  Due to the political climate of Chicago and Nini's strong Christian values, many past customers do not see eye to eye with Nini's Deli and choose to write fake reviews about the food and the staff/owner.  I've always been treated with 100% respect and treated well at Nini's, both before and after the political issues of 2020.  If you are looking for what is STILL the best food and hospitality, look no further than Nini's Deli.  I remember when I first tried Nini's Deli in 2019 how blown away I was by the food.  It's still the same.  Good food should UNITE people, cultures, you name it... not tear them apart.  There are other religions in Chicago that go against others core beliefs in Chicago - they just haven't been vocal about it like Nini's Deli.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 9:00 AM – 6:00 PM",
        "Wednesday: 9:00 AM – 6:00 PM",
        "Thursday: 9:00 AM – 6:00 PM",
        "Friday: 9:00 AM – 6:00 PM",
        "Saturday: 9:00 AM – 6:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Irazú Costa Rican Restaurant & Catering",
      "address": "1865 N Milwaukee Ave, Chicago, IL 60647",
      "phone": "(773) 252-5687",
      "lat": 41.9151045993531,
      "lng": -87.6846393244315,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-05 20:59:06",
            "text": "Irazu has been on my list to try for a while, so I'm glad I finally came here! The food was delicious, service was good, and prices are very reasonable.\n\nWe...",
            "rating": 5
          },
          {
            "time": "2022-02-25 17:02:04",
            "text": "I love this spot! byob with great mixers and delicious food! I went here last summer and I got the chifrijo and it was SO GOOD. came back yesterday...",
            "rating": 5
          },
          {
            "time": "2022-02-19 14:00:17",
            "text": "This place has been around for many years for a reason. The host was very nice and sat us right away. \n\nWe had the guacamole and surf/turf dinner. So much...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-08-19 17:20:27",
            "text": "Great food, and even my picky friends have enjoyed it. Everything is great, service is good, location is cool (near some good shops, the train, the 606 trail, etc.). A really fun place to go. Don't pass on the shakes and juices!! Might be cash only",
            "rating": 5
          },
          {
            "time": "2022-03-27 13:37:25",
            "text": "Do yourself a favor and get thee to Irazu. There's a reason this family owned and operated neighborhood gem has been around for so long, and it doesn't take but a minute to feel like your part of the family too.\n\nIsland vibe + authentic food + welcoming staff? Yes, please!",
            "rating": 5
          },
          {
            "time": "2022-01-21 19:48:59",
            "text": "Blue zone living to 100+ with delicious food and BYOB.  Best green salsa ever. Outstanding Oatmeal and banana shake.  Knowledgeable service with on target recommendations on traditional Costa Rican dishes.  Alchemist chef delivers an exquisite mix of flavors. Great value. Simple colorful decor",
            "rating": 5
          },
          {
            "time": "2021-11-28 12:34:05",
            "text": "Food and service was amazing, we reserved the private room for a family event for 20 people. Highly recommend the chicken, steak and fish, the family could not stop talking about it. Leading up to the event Henry the business owner was very informative and took the time to break everything down for us.\n\nWe will definitely be going back soon.",
            "rating": 5
          },
          {
            "time": "2021-12-09 10:22:55",
            "text": "A very personal experience here. The food is very good and not overly complicated for anyone.  We brought a bottle of wine and enjoyed dinner inside for 3! Service was friendly and helpful too! Thank you 🙏🏻 for being in Chicago.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 11:30 AM – 9:00 PM",
        "Thursday: 11:30 AM – 9:00 PM",
        "Friday: 11:30 AM – 9:00 PM",
        "Saturday: 11:30 AM – 9:00 PM",
        "Sunday: Closed"
      ]
    }
  ]
}