{
  "chinese": [
    {
      "name": "Kon Chau Restaurant",
      "address": "8376 SW 40th St, Miami, FL 33155",
      "phone": "(305) 553-7799",
      "lat": 25.7324881946529,
      "lng": -80.3311729431153,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-23 08:35:52",
            "text": "Amazing dim sum. Great portions and pricing. I dream of the Baked pork buns and pork dumplings. Shrimp and chive dumplings are also top of my list but...",
            "rating": 5
          },
          {
            "time": "2022-03-12 06:05:48",
            "text": "This restaurant has been in business for forever. When I came to Miami over 20 years ago, I used to eat here often.\nThe prices were reasonable and food was...",
            "rating": 5
          },
          {
            "time": "2022-02-05 07:28:39",
            "text": "This is probably the most authentic Chinese restaurant I've had so far. \n\nWhole Steamed Fish: the best dish that we ordered. The fish in season was red...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-08 02:06:04",
            "text": "This is the only restaurant that me and my boyfriend have consistently gone back to since moving to Miami. Dim sum is served all day which is a huge plus. Dim sum is very good and comes out fast. Service is great as well, waiters always make sure that empty plates are taken away. Items from their menu are delicious as well! Highly recommend",
            "rating": 5
          },
          {
            "time": "2022-02-10 21:24:10",
            "text": "I love coming here. It's always delicious. You really can't go wrong with anything. Best when shared with close friends!\n\nEdit for 2022\nSTILL FABULOUS. They updated the inside so it's really fresh looking. Staff is really friendly! Our server Jin helped us with our order as we came with a large group and i wanted to make sure everyone had something yummy.\n\nThis is one of my most favorite places to go with family.\n\nShrimp and scallop dumplings are fire as are the soup dumplings, duck and pork buns and the leek dumplings!",
            "rating": 5
          },
          {
            "time": "2021-11-07 18:12:39",
            "text": "First time trying out this place. I ordered take out. The food was on time and tasted delicious. Everything was fresh.\n\nThe only thing that I was not happy with was the fried rice. Tasted really good however it was not fried enough like your typical fried rice. Seemed like it was just white rice with shrimp, pineapple and some vegetables.\n\nOther than that the place is good. Will visit them again.",
            "rating": 4
          },
          {
            "time": "2021-10-12 01:32:16",
            "text": "Good quick service and the dumplings are off the chain. The only knock I'll give them is the entrees that aren't dumplings, are kind of bland, but that being said it's a dumpling joint.\n\nI'd also like to add the seating is pretty tight for the age of covid, I'd avoid eating in if you not vaccinated; but that being said they do clean and sanitize the tables pretty through and the staff wears masks.",
            "rating": 5
          },
          {
            "time": "2021-10-16 15:33:28",
            "text": "Be careful when you pay . This place charged automatic gratuity . What i know restaurants can only do this with 6 or more people. I ordered something to go but while waiting i order a soup in the amount of  $8.00 and when i pay my bill they charged 3 dollars more. I know 3.00 is nothing but taking advantage is not right. I questioned the cashier why they do it, she said because of COVID. Not right. I like the food there but i guess i will limit eating there . I will just go Tropical, more classy and the food is excellent!",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: Closed",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Canton Palace Chinese Restaurant",
      "address": "7980 SW 8th St, Miami, FL 33144",
      "phone": "(305) 264-9444",
      "lat": 25.76146,
      "lng": -80.3259099,
      "rating": {
        "Yelp": 4.0,
        "Google": 4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-03 16:38:52",
            "text": "So I moved to California and regretted leaving Miami because nobody in this state can make their dish. \nIt's overwhelming to me that none of the Chinese...",
            "rating": 5
          },
          {
            "time": "2021-11-14 10:27:32",
            "text": "Shame...some dishes scored high while others did not!\n\nThe stuffed green peppers, stuffed bean curd skin, fried turnip cake, stuffed eggplant, shrimp and...",
            "rating": 3
          },
          {
            "time": "2022-01-22 21:45:56",
            "text": "When we came here back in October (my wife was going to a trade show at the South Beach Convention Center), we stayed at the Hilton property fairly...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-01-09 15:31:40",
            "text": "If you want a fancy restaurant go somewhere else.  Now, if you are looking for authentic Chinese food don't miss this place.  They have dim sum and authentic canton cuisine.   Have lunch with a ton of Asian people.  Eat the awesome stuff they eat, not that pepper steak, fried rice, and sweet and sour chicken they sell Americans.  This is an awesome restaurant.  My friends with good taste love it too.",
            "rating": 5
          },
          {
            "time": "2022-04-20 14:09:14",
            "text": "I have been coming for years. I always get dim sum with the family on weekend mornings. There is a big variety of different options to choose from. Food is awesome",
            "rating": 5
          },
          {
            "time": "2022-02-28 11:13:43",
            "text": "Typical Chinese decor but not typical American Chinese cuisine. This is the real deal, true Hong Kong authentic food.   I lived in Hong Kong and I can say this menu offers a really great variety of Dim Sum and full course meals. Every dish we had was outstanding.",
            "rating": 5
          },
          {
            "time": "2021-10-10 12:46:21",
            "text": "Been coming here since the early 90’s, best fried rice and honey chicken in Miami, hands down. You know the place is good when there are tour buses showing up with foreigners to eat here and when the foreign customers out number then local customers. SERVICE QUALITY and CUSTOMER SERVICE is the best hands down. This is my GO To, for Chinese food, I have tried other places to compare and I always keep coming back to Canton Palace!",
            "rating": 5
          },
          {
            "time": "2022-01-29 04:41:42",
            "text": "Awful. Staff were friendly but the dim sum dishes and beef chow fun ordered were awful. I had ordered barbecue roast pork roll and one of my lunch friends at my table ordered the fresh shrimp rice roll. Instead, the waitress gave us dried shrimp rice roll and they never brought out the bbq roast pork rice roll. We decided to go ahead and eat the dried shrimp rice roll although the fresh shrimp roll was ordered. It was awful. I found a sharp needle shaped object in one of the rolls.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:30 PM",
        "Tuesday: 11:00 AM – 9:30 PM",
        "Wednesday: 11:00 AM – 9:30 PM",
        "Thursday: 11:00 AM – 9:30 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 10:30 AM – 9:30 PM"
      ]
    },
    {
      "name": "Good Chef Restaurant",
      "address": "113 S W 107th Ave, Miami, FL 33174",
      "phone": "(305) 227-3111",
      "lat": 25.767745,
      "lng": -80.36805,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-30 11:52:07",
            "text": "This was one of the best ramen places I've been to. Originally I came here and ordered the stir fry udon and my partner ordered the spicy kimchi ramen. Both...",
            "rating": 5
          },
          {
            "time": "2022-04-03 11:21:14",
            "text": "Found this place of instagram. Was already excited for it! It honestly exceeded my expectations!!! The honey garlic chicken was amazing!!! Their fried pork...",
            "rating": 5
          },
          {
            "time": "2022-04-09 19:11:27",
            "text": "The location is within a store, it is small but has big flavor! Everything was super delicious and fresh! We ALL we're so stuffed and happy with our dishes....",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-22 18:55:15",
            "text": "This place has the perfect name, Good Chef for sure. Everything single dish is exploding with flavor. I recommend the pork belly with rice, twice cooked pork, and the honey garlic chicken. Honestly Everything is delicious and super wallet friendly. Totally recommend if you want authentic Asian food and good looking staff 😋",
            "rating": 5
          },
          {
            "time": "2022-01-14 21:28:02",
            "text": "AMAZING SPOT! Great food extremely tasty and well prepared. The staff is very friendly and polite. Would have definitely been even better if it wasn't for that lady at the front treating us like total trash for not having a mask on... 🤣🤷‍♂️",
            "rating": 5
          },
          {
            "time": "2022-04-22 13:03:58",
            "text": "The food here is delicious and the staff is very warm and welcoming. I placed an order for pick up and it was placed quickly. They even gave me a little dessert as a thank you. Will definitely come again!\n\nPS: for dine in I believe they have lunch menus as well!",
            "rating": 5
          },
          {
            "time": "2022-04-22 19:33:11",
            "text": "The food was absolutely incredible! My girlfriend has always been obsessed with the market attached but it was our first time trying the food and it was so good we can’t wait to come back for more. The workers are some of the nicest people I’ve ever met and even gave me complementary cakes which were so light and delicious! Can’t wait to come back and for the price of the food how could we not!",
            "rating": 5
          },
          {
            "time": "2022-04-08 19:17:06",
            "text": "This is my favorite local restaurant in Miami… HANDS DOWN! I’ve recommended Good Chef to many family members and friends. The food is delicious, the people are friendly, and it’s so cutely decorated. Definitely give it a try ✨",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 10:00 PM",
        "Tuesday: 11:30 AM – 10:00 PM",
        "Wednesday: 11:30 AM – 10:00 PM",
        "Thursday: 11:30 AM – 10:00 PM",
        "Friday: 11:30 AM – 10:00 PM",
        "Saturday: 11:30 AM – 10:00 PM",
        "Sunday: 11:30 AM – 10:00 PM"
      ]
    },
    {
      "name": "Red Shallot",
      "address": "9032 NW 25th St, Doral, FL 33172",
      "phone": "(305) 477-2513",
      "lat": 25.79623,
      "lng": -80.34329,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-19 18:02:52",
            "text": "This place is a bright star among so many dim lighted (as far as cooking goes) restaurants.  \n\nHumble appearance but don't let that fool you.  I ate next...",
            "rating": 5
          },
          {
            "time": "2022-03-04 12:07:26",
            "text": "I've been coming to Red Shallot since they've opened. The restaurant is incredibly well kept, and the flavor of every dish is clean, flavorful, & authentic....",
            "rating": 5
          },
          {
            "time": "2022-02-05 10:18:34",
            "text": "You know a place is good when you haven't left and you already want to write a review! \n\nThat's what I told my friend Marilu when we both had lunch at this...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-05 15:09:45",
            "text": "The owners are incredibly sweet and welcoming. The food is delicious and comforting. They brew their tea in house and it is AMAZING to drink on a hot day. I had the best experience here and I'm so glad I found it. In regular Chinese restaurants you get a sluggish feel after eating the food but not here at all.",
            "rating": 5
          },
          {
            "time": "2022-03-04 12:33:56",
            "text": "There aren't enough good things that can be said about the Red Shallot. I dont usually sit in at small places like these however I would recommend it here. The owners are wonderful people who will explain what you are ordering and make recommendations. They will make dining in a wonderful experience. I recommend asking about the mixed herb drink/tea. It is homemade, fantastic and refreshing. All the food we had was excellent. All round 10/10.",
            "rating": 5
          },
          {
            "time": "2022-02-21 12:38:49",
            "text": "Hungry? I highly recommend trying out this spot. From the moment we walked in Bill greeted us with a smile. The food was on point and you can taste the freshness. Bill gladly took care of us with a bright smile. It's hard to get great service in Miami and this place definitely delivered.",
            "rating": 5
          },
          {
            "time": "2022-04-04 18:59:36",
            "text": "A must try! The owner gave us perfect recommendations catered to our taste preferences. We were even greeted with samples of their homemade weekly tea. Everything tasted so fresh - we will be back!",
            "rating": 5
          },
          {
            "time": "2022-01-25 12:42:00",
            "text": "I was having a bad day and decided to try somewhere new for lunch. I went in and the owners were the sweetest angels I've ever met. They served my food within five minutes of ordering.. poured me as much tea as I wanted (weekly special homemade tea) and had conversation with me. The owner Bill was teaching me Chinese and having a nice conversation with me. This place made my day and made me happy. Please support this restaurant and try the delicious food as well, you will not regret it...!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 7:00 PM",
        "Tuesday: 11:00 AM – 7:00 PM",
        "Wednesday: 11:00 AM – 7:00 PM",
        "Thursday: 11:00 AM – 7:00 PM",
        "Friday: 11:00 AM – 7:00 PM",
        "Saturday: 11:00 AM – 7:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "DaTangZhenWei",
      "address": "801 Brickell Bay Dr, Miami, FL 33131",
      "phone": "(786) 747-4686",
      "lat": 25.7653321663146,
      "lng": -80.1889792449524,
      "rating": {
        "Yelp": 4.0,
        "Google": 4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-18 15:48:27",
            "text": "I have never personally been to this restaurant but I have ordered take out many times.\n\nThis is one of the few places with authentic Szechuan. \n\nYou must...",
            "rating": 4
          },
          {
            "time": "2022-04-26 11:42:08",
            "text": "Exotic and amazing Chinese restaurant in a very nice area in brickell. Loved everything except the need of restrooms, which were very inconvenient and far....",
            "rating": 4
          },
          {
            "time": "2022-04-13 12:46:56",
            "text": "A hidden gem in Brickell, such a fun and delicious dining experience! I've never had a hot pot meal before and this was a wonderful place to start!",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-12-01 14:05:07",
            "text": "I was recommended to come by this place for authentic Chinese food, and an experience. Not only was the waiter, Jean, attentive, respectful, and checking in several times throughout the meal, but he was professional and able to give solid, varying recommendations for both food and drink.\n\nThe pricing, as it should, varies. Simpler, affordable, and authentic meals were priced just like any other restaurant you'd find, but at a higher quality. I had the Beijing Duck, and although knowing it is more expensive, is more than worth every dollar; in fact, getting the whole duck may be the right move next time!\n\nHands down one of the best meals I've had in Miami, with a safe and beautiful area to walk and take pictures after your meal. There was so much I wanted to try, I had to get a completely different dish to go. You'll be hard pressed to find a more unique and serene place to go in the Downtown Brickell area, for sure.\n\nSee you next time!",
            "rating": 5
          },
          {
            "time": "2021-12-15 21:24:52",
            "text": "Amazing food in Brickell. Best duck I've ever had...and great service too. Mariano and Donald are awesome. Fatty Beef and Beef Tongue for days. Lychee martinis too. Thank you guys.",
            "rating": 5
          },
          {
            "time": "2022-04-25 10:29:25",
            "text": "I’ve been to a lot of fine dining restaurants. This place should not be call fine dining. The only thing this place got is their hot pot, it was great. The service was okay, never checked on us, we had to ask for water twice.",
            "rating": 2
          },
          {
            "time": "2022-01-26 10:58:53",
            "text": "This is one of the best Chinese restaurant I found in Miami. The food is authentic especially the Peking duck. Also decently priced as a restaurant in the center of Brickell with nice ambience and good service. Highly recommended.",
            "rating": 5
          },
          {
            "time": "2021-12-25 08:33:18",
            "text": "One of the great food places. Really busy but Manager was great. The main attraction, THE FOOD, was awesome!!!! Ramen and the spicy Sea food hot pot was just too good. Must try are the skewers.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": 3
      },
      "opening_hours": [
        "Monday: 12:00 – 10:00 PM",
        "Tuesday: 12:00 – 10:00 PM",
        "Wednesday: 12:00 – 10:00 PM",
        "Thursday: 12:00 – 10:00 PM",
        "Friday: 12:00 – 10:00 PM",
        "Saturday: 12:00 – 11:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Foodies",
      "address": "1371 NE Miami Ct, Miami, FL 33132",
      "phone": "(786) 522-2419",
      "lat": 25.7879192,
      "lng": -80.1931896,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-08 16:12:14",
            "text": "This is our second time coming to this restaurant, and it was just as good as the first time. The food is absolutely delicious. Our favorite dish is the...",
            "rating": 5
          },
          {
            "time": "2022-04-18 16:52:43",
            "text": "This is the most authentic Szechuan & Cantonese food I've had in the city! I've lived in Miami for many years and can't believe I am only discovering this...",
            "rating": 5
          },
          {
            "time": "2022-03-27 05:24:53",
            "text": "My family and I went to Foodies based on Yelp reviews. We had Cuban for lunch and wanted something different for dinner. On first impression walking in the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-30 22:42:07",
            "text": "I loved my main plate. It was big enough for a family of five and I'm not exaggerating. The appetizers were also very good. I usually don't eat dessert but tonight we shared one, the french toast and it was very tasty. I strongly recommend this restaurant",
            "rating": 5
          },
          {
            "time": "2022-04-19 09:53:22",
            "text": "We spent all day searching for an authentic Chinese cuisine for dinner and we found it!!\n\nOur server was amazing (we forgot her name) she was so sweet and attentive.\n\nDim sum was awesome, we also ordered noodles that are not pictures because we ate them so fast !! Rice cakes for dessert are amazing as well. Highly recommend",
            "rating": 5
          },
          {
            "time": "2022-03-28 22:30:06",
            "text": "Second time coming to this place. I really enjoy the authentic Chinese food! I had the medium spicy black pepper chicken and was really good(very much spicy). The dimsum was also very good. The staff was very attentive always making sure me and my friend were taken care of. Would definitely recommend coming here if you like spice 😉!",
            "rating": 5
          },
          {
            "time": "2022-03-28 20:32:39",
            "text": "Finally a great Chinese restaurant in downtown!! The food here is incredible. Very fresh and delicious. I have been looking for a place like this.. Wow - they exceeded my expectations. Give this place a try and see for yourself. Very clean inside and really cute decor. Dine in or take-out.",
            "rating": 5
          },
          {
            "time": "2022-03-28 08:12:16",
            "text": "Great Chinese food. It's very hard to find good Chinese food in Miami and they hit the mark. Easy location and fast and friendly customer service. I will be returning to this location over and over. Thank you!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 10:00 PM",
        "Tuesday: 12:00 – 10:00 PM",
        "Wednesday: 12:00 – 10:00 PM",
        "Thursday: 12:00 – 10:00 PM",
        "Friday: 12:00 – 10:30 PM",
        "Saturday: 12:00 – 10:30 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "King Duck BBQ",
      "address": "10340 West Flagler St, Miami, FL 33174",
      "phone": "(786) 803-8108",
      "lat": 25.76788,
      "lng": -80.36445,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-13 17:49:50",
            "text": "I love their egg noodles roasted duck , very tasty , I just ordered ahead and go pick them up 10 mins later ! Easy lunch for me",
            "rating": 5
          },
          {
            "time": "2022-03-06 13:37:59",
            "text": "At the recommendation of the girl that answered the phone, I ordered 3 lbs of crispy pork, 2 lbs of honey bbq ribs, 1 whole duck and a jumbo super special...",
            "rating": 4
          },
          {
            "time": "2022-04-20 10:26:40",
            "text": "Delicious Peking duck.  I was in town for a couple weeks and ordered a full Peking duck meal for\nmyself twice. Quality to-go packing of quality made to...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-12-12 19:50:51",
            "text": "Excellent duck , bbq pork and flat noodle. A Togo only hole in the wall but it was unexpectedly very good. Order was taken through the window and was ready in 15 min. Lady was very nice as well.",
            "rating": 4
          },
          {
            "time": "2022-04-07 11:35:48",
            "text": "They open at 12noon and I was there about 1pm. What I bought were still warm. The skin of the crispy pork is actually still crispy. That's a 5 stars for me. But the roast pork is just ok. One important fact is the crispy pork is not as salty as other crispy porks.",
            "rating": 4
          },
          {
            "time": "2021-12-11 20:01:31",
            "text": "Had the whole Peking duck, crispy pork belly, roast pork, a dozen shumai, and bok choy.  Very delicious state-side Chinese fair at great prices!  Will be a regular from now on.",
            "rating": 5
          },
          {
            "time": "2021-04-16 08:13:07",
            "text": "The best authentic Cantonese style take-out/delivery Chinese food I've had locally in a long time. Order ahead. Worth the wait if there is a line. Don't let the unassuming appearance of the tables being turned into a take-out counter fool you. The magic happens in the kitchen!\nIf you're a fan of duck, it's definitely one of the specialties here. The duck buns are excellent if you don't mind them on the sweet side. The crunch of the sweet pickle inside made it the perfect texture combination for me. We tried the Peking duck, also. So good, it has me wanting to try all of the duck dishes they offer! It's been difficult to find a place that serves Beef Chow Fun in Miami (Flat Rice Noodle). This was our main attraction and the reason we drove 20 min to get there from another part of town. We would make the trip again. The flavor experience was definitely worth it!",
            "rating": 5
          },
          {
            "time": "2021-11-08 19:27:18",
            "text": "Fire jumbo house special rice and the duck omg yums the sweet pork rinds is must have I drive far to get this bbq  Chinese food",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 12:00 – 8:00 PM",
        "Wednesday: 12:00 – 8:00 PM",
        "Thursday: 12:00 – 8:00 PM",
        "Friday: 12:00 – 8:00 PM",
        "Saturday: 12:00 – 8:00 PM",
        "Sunday: 12:00 – 8:00 PM"
      ]
    },
    {
      "name": "Long Gong Restaurant",
      "address": "11920 SW 8th St, Miami, FL 33184",
      "phone": "(305) 553-4644",
      "lat": 25.76023,
      "lng": -80.3892599,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-09 15:05:30",
            "text": "One of my go-to place for authentic Chinese food. It's family-owned and everyone there are so friendly! Don't hesitate to ask for advices, they'll tell you...",
            "rating": 5
          },
          {
            "time": "2022-03-26 16:27:01",
            "text": "Food was delicious. Definitely my new favorite. Delivery was super fast.  Totally recommend.",
            "rating": 5
          },
          {
            "time": "2021-09-08 08:14:50",
            "text": "The authentic options are plenty! As you open the menu you will find typically options, but if you continue turning pages you will find a large authentic...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-18 20:15:43",
            "text": "This is a great restaurant. By looking at the decorations you might think this is s good place. If you walk and happen to catch a fresh pot over a table you will know this is the place you've been looking for your whole life.  This is a great place for a business meeting or family dinner. I recommend you try every dish in the menu in your lifetime.",
            "rating": 5
          },
          {
            "time": "2022-02-07 07:46:38",
            "text": "This place is amazing! This was our first time trying their food and everyone was very happy with the quality. Staff is very friendly! Highly recommend this place.",
            "rating": 5
          },
          {
            "time": "2021-08-01 22:58:52",
            "text": "Their rice noodles is a must-try. Nice staff and  reasonable price with portion. Love it before going to visit Everglade national park!!",
            "rating": 4
          },
          {
            "time": "2022-01-15 20:25:11",
            "text": "I love the food here.  I order the Shrimp Chop Suey and it was delicious!  Their food is consistently good and portions are generous!",
            "rating": 5
          },
          {
            "time": "2022-02-25 20:31:08",
            "text": "Very good food,better service and good prices.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:00 PM",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: Closed",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Tropical Chinese Restaurant",
      "address": "7991 SW 40th St, Miami, FL 33155",
      "phone": "(305) 262-7576",
      "lat": 25.7338940949977,
      "lng": -80.32576523984355,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-29 09:59:05",
            "text": "Tropical Chinese is inside of a strip mall, so it doesn't look like much from the outside but I promise you'll enjoy your time here! I was there to...",
            "rating": 5
          },
          {
            "time": "2021-12-06 18:57:43",
            "text": "Dinner menu was good, if ridiculously overpriced for family-style home cooking. If you're paying $20+ per entree, you should be dining on a non-sticky table...",
            "rating": 3
          },
          {
            "time": "2021-11-01 08:00:00",
            "text": "A friend and I stopped by Tropical for lunch sure to the fact that anther piece we wanted to go to was closed. Omg was I happy that things worked out that...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-17 20:34:14",
            "text": "Don't usually like Chinese... but have to say food was awesome! The duck was great, esp prepared as double tacos. Spring rolls, yes. Some kind of pancake, a delight. Nice soup! A good and reasonably priced bar and wine list. We'll  be back!",
            "rating": 5
          },
          {
            "time": "2021-12-06 09:05:13",
            "text": "This place is very good and it seems to be a classic in Miami. They have dim sum until 3pm on Sundays so it’s a great way to go and try different items. The food is very fresh and delicious although some items are overpriced. If you like Chinese food but don’t like to order from smaller places, come try this one out. It is pretty authentic and they also have a bar for a drink or two.",
            "rating": 4
          },
          {
            "time": "2022-02-09 16:17:10",
            "text": "Love this place. I've never been to China, but thus is exactly how I think the food would taste. There has been some changes but the still very de 9am",
            "rating": 5
          },
          {
            "time": "2022-02-22 21:00:22",
            "text": "We read some reviews and decided to try here. They gave us bottles water instead tap water with ice in a cup.  Any place that have dim sum is definitely an authentic Cantonese  food and tastes. We ordered the chicken pan fried noodles, salt and pepper pork chop, and black pepper beef sizzling that  went  excellent with white rice.",
            "rating": 5
          },
          {
            "time": "2022-04-05 01:39:56",
            "text": "Best dim sum in miami. Affordable clean  and delicious. I have been going for 20 years at least twice a month. And i am not planning to stop ever. Try the shrimp ball and the lik dumpling wont be disappointed.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:30 PM",
        "Tuesday: 11:00 AM – 9:30 PM",
        "Wednesday: 11:00 AM – 9:30 PM",
        "Thursday: 11:00 AM – 9:30 PM",
        "Friday: 11:00 AM – 9:30 PM",
        "Saturday: 11:00 AM – 9:30 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Changs Chinese Restaurant",
      "address": "1311 SW 107th Ave, Miami, FL 33174",
      "phone": "(305) 221-8104",
      "lat": 25.75626767,
      "lng": -80.36748633,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-13 10:31:27",
            "text": "Went last night and had the chicken sesame combo. It was great! Looking at the menu for next time we go. The staff was so nice and love the new location adult",
            "rating": 5
          },
          {
            "time": "2021-10-11 08:34:52",
            "text": "Food was really good. Restaurant is unpretentious and food is abundant. \n\nService was fast and attentive. Prices are very reasonable for the amount of food...",
            "rating": 4
          },
          {
            "time": "2021-06-21 06:00:34",
            "text": "Chang's reopened for dine in last week but we picked up takeout for Father's Day!  We went to another restaurant earlier but there was a long line so we...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-10-04 11:33:23",
            "text": "Really, really good food.   That about sums up this place.\n\nOthers reviews have covered this place well - excellent food, large portions, reasonable prices, and friendly service.\n\nThe crab maw soup was a great starter.   They bring out white pepper you can add for some spiciness and a mild red vinegar for a little tartness so you can season it to taste.  The soup has a mild but rich flavor that is also fine by itself.   I was told they make their own tofu here and their fried version of it was fantastic.  Definitely some of the best I've had.\n\nWe rounded out the meal with some steamed fish (delicious) and some greens with garlic (also very good).   I'd recommend asking for some of their ginger/scallion sauce on the side.  They cook with it but it's a delicious, salty, sauce that can add a lot of flavor to a dish.   We asked to bring some home with the leftovers because it was so good.   Highly recommend stopping by here if you want some great Chinese food.",
            "rating": 5
          },
          {
            "time": "2022-03-18 19:32:32",
            "text": "This is hands down my favorite Chinese restaurant in the area. The food is consistently tasty and the portions are a decent size. They offer a Cantonese menu as well. I always receive great service, highly recommend!",
            "rating": 5
          },
          {
            "time": "2021-08-31 13:53:02",
            "text": "The owners and cashiered are very kind, I’ve had nothing but good experiences with the restaurant and the food is plentiful and filling. Often times I find myself saving leftovers for dinner. Will come again",
            "rating": 5
          },
          {
            "time": "2021-12-24 14:30:10",
            "text": "We were seated immediately. As soon as we entered the place.\nPlaced our orders for pork , tofu and dumplings.\n\nThis place can get busy but they have plenty of seats in here. In short the food is as Cantonese as it can get and the place is delightful.",
            "rating": 5
          },
          {
            "time": "2022-04-06 20:38:54",
            "text": "This place used to be awesome before they moved. Nice people, but the food tasted like cardboard and was stale.$60 for rice noodles and chicken. Looks like they downgraded on quality but charge like normal. not cool.\n\nShould’ve went elsewhere.",
            "rating": 2
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: Closed",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 11:00 PM",
        "Saturday: 11:00 AM – 11:00 PM",
        "Sunday: 11:00 AM – 10:00 PM"
      ]
    }
  ],
  "cuban": [
    {
      "name": "Old's Havana Cuban Bar & Cocina",
      "address": "1442 SW 8th St, Miami, FL 33135",
      "phone": "(786) 518-2196",
      "lat": 25.7655942148975,
      "lng": -80.2192383373502,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-11 10:30:09",
            "text": "I went there on a Thursday night and it got packed quick. Be sure to make a reservation the day before. We made ours at seven. The server kept trying to put...",
            "rating": 4
          },
          {
            "time": "2022-03-24 18:13:45",
            "text": "Great food and service. A line in front but the waiting was not bad, totally worth. Comida deliciosa, tem fila mas vale a pena. O serviço e muito bom....",
            "rating": 5
          },
          {
            "time": "2022-04-25 18:56:59",
            "text": "Omg the stuffed tostones!!!! Came here for the cubano, but now I'm thinking that the tostones was one of the best dishes I've had in Miami. The plantains...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-12-31 11:35:19",
            "text": "We went on a Tuesday around 1pm and though it was pretty packed, we had no wait for a table of two. The atmosphere was lively and fun. The manager made rounds checking on customers. The food and drinks were delicious. We ordered the appetizer sampler. It’s a great way to try a few different Cuban foods. My only complaint is the one stall women’s bathroom. There can be quite a line for that. But the overall experience was worth the bathroom wait!!",
            "rating": 5
          },
          {
            "time": "2022-02-09 14:48:19",
            "text": "Great food with live music. We were seated just right in front of the band as the place was packed. The volume from speakers were crazy loud for us. If you find a quieter area at the back it will probably be fine. Music itself is very good, I liked it a lot. Food and service, everything was great until our waitress came to us and said 18% service fees are shared between them. We are like..okay..? Isn't it like all the other places? Why are you telling us this? BTW that 18% fees are automatically added to your bill. Be aware and don't double tip. Too bad the food was really good but can't go back to a place where staff think 18% tips are not enough.",
            "rating": 4
          },
          {
            "time": "2022-02-20 12:42:36",
            "text": "Never been here before and I was born and raised in South Florida most of my life. I don't go to South Miami very often,  but this place is definitely on point with their Cuban food and the experiences was great!  Our Cuban friends took us to this place  and we sat outside since the weather was chilly that weekend. I loved the look and the atmosphere it was great! If you are visiting South Florida or local and looking for good Cuban food, then this is the place to go! They have a lot of authentic and some Americanized dishes which gives it a unique experience all around for everyone. Their prices are not that bad either I would say average comparing it to most places in South Florida. I ordered the  shredded pork  and it was very tender not dry at all. My husband ordered a Cuban sandwich and it was huge! The rest of our party ordered other dishes as well and we all sampled off from each other and still they were delicious! If you are looking for good Cuban food for those who are out of town guest or for yourself, then I definitely recommend Old Havana Cuban restaurant! I recommend the back patio area if the weather is nice. There are a lot of Spanish restaurants all up and down on 8th street, but I definitely recommend checking out this place if you haven't yet.",
            "rating": 5
          },
          {
            "time": "2020-10-23 00:46:31",
            "text": "This place has a great hostess and the live band music was amazing! Bus boy was really attentive and helpful 10/10 which is the only reason I would even want to give this place a 1 star.\n\nOur waitress never gave us our coffee and never checked on our table. We were there for 1 hour and she NEVER came back to our table. The busboy had more interaction with our table than her. She came over AFTER we finished eating to ask if I wanted my coffee. Are you serious? Apparently tip is included on the bill which would explain why she didn't care to help us. She was too busy talking to the hostess and the cute bartender to pay attention. I don't understand what we did wrong. Is it because we are Asian? I have fluent English and we were polite the whole time. Either way I will never come back or ever recommend anyone here. This was the first restaurant we went to in Little Havana and I am extremely disappointed.",
            "rating": 1
          },
          {
            "time": "2022-02-21 15:57:43",
            "text": "Came back to this place and had to update my review.  The food here is good, however good customer is a plus and goes a long way. I was seated and it took 45 min for my croquettes to come out while people who were seated after me with their food coming out in 15 minutes.  I watched the waitress being attentive to the other guests while I waited for my appetizer. I hate to think it was due to me being Black, because the other guests were of white complexion who received better customer service.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 11:00 PM",
        "Tuesday: 11:00 AM – 11:00 PM",
        "Wednesday: 11:00 AM – 11:00 PM",
        "Thursday: 11:00 AM – 11:00 PM",
        "Friday: 11:00 AM – 12:00 AM",
        "Saturday: 11:00 AM – 12:00 AM",
        "Sunday: 11:00 AM – 11:00 PM"
      ]
    },
    {
      "name": "Versailles Restaurant",
      "address": "3555 SW 8th St, Miami, FL 33135",
      "phone": "(305) 444-0240",
      "lat": 25.76498,
      "lng": -80.25282,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-20 20:16:13",
            "text": "I think the seafood rice is kind of salt.\nThe bread is the best!\nOxtail Stew\nVaca Frita",
            "rating": 5
          },
          {
            "time": "2022-03-13 01:31:06",
            "text": "Great place with delicious Cuban cuisine. There is a variety of choice, and the ones we picked are all amazing. Reasonable price and the food come out...",
            "rating": 5
          },
          {
            "time": "2022-04-24 08:31:31",
            "text": "Arroz Con PolloCuban Sandwich pan con lechon \nCroquettas cafe drive thru NicaCuba Restaurants \nOGB spliffah305 one way well connected well respected\nBaddies...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-08-09 22:34:50",
            "text": "Versailles is one of my favorite restaurant ever. 10/10 always happy with the service and food. Everything is amazing. I come here probably 3-4x or more a week. I some time even come twice a day for breakfast & dinner. So delicious! I either do take out or eat at the restaurant. I just love this restaurant so much and every time I am there I feel like I am home. If you want true delicious, yummy and authentic Cuban food Versailles is where is at!",
            "rating": 5
          },
          {
            "time": "2021-08-03 02:29:56",
            "text": "This place is amazing.  Great Cuban food with so many choices.  Great service and it was fast.  Since this place is known for top Cuban food, there is always a line to get in.  But since they work very efficiently, the wait is not too long and definitely worth any wait.  Delicious quality food with reasonable prices.  You are gonna want to order and sample every dish.",
            "rating": 5
          },
          {
            "time": "2021-01-29 14:06:09",
            "text": "We are staying in Key Largo and this restaurant was recommended by a friend who used to live in Miami as a great place for authentic Cuban food.  She was right!  We went for lunch and ate outside.  The service was friendly and quick.  Our food portions were generous and delicious!  I would go again and again to try different things. Their menu is extensive and very reasonably priced.  All in all, a great experience!",
            "rating": 5
          },
          {
            "time": "2021-12-27 21:13:18",
            "text": "Versailles Restaurant really does serve authentic Cuban food in Miami. I highly recommend visiting this place when in town. It is very busy so I recommend allocating some time. We placed our names down on the list and in the meantime, we lined up at the cafe for their Cuban coffee and pastries. That I also highly recommend. Once we sat down, we were greeted by our server Luis. He is a very friendly and helpful guy! He recommended the Seafood Paella, Chicken and Oxtail. All a must try!\nThe food came out very quickly and was very delicious. It was also very decent in pricing. I would definitely visit once again 👍🏻",
            "rating": 5
          },
          {
            "time": "2022-02-04 20:39:40",
            "text": "Have been coming here for years! A Miami landmark; excellent food. Excellent bakery items also. The real gem? The STAFF!\nThis is a world famous place and the folks here prove they are passionate about pleasing customers.\nCongratulations Versailles folks for your hard work and making me feel welcome for over 30 years!🙂",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 8:00 AM – 12:00 AM",
        "Tuesday: 8:00 AM – 12:00 AM",
        "Wednesday: 8:00 AM – 12:00 AM",
        "Thursday: 8:00 AM – 12:00 AM",
        "Friday: 8:00 AM – 1:00 AM",
        "Saturday: 8:00 AM – 1:00 AM",
        "Sunday: 9:00 AM – 12:00 AM"
      ]
    },
    {
      "name": "Havana Harry's",
      "address": "4612 S Le Jeune Rd, Coral Gables, FL 33146",
      "phone": "(305) 661-2622",
      "lat": 25.7291418497262,
      "lng": -80.262036540545,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-12 13:23:59",
            "text": "They serve a lot of food and almost everything taste delicious. The only thing I don't recommend is the lava cake and the palomilla. But the rest it's...",
            "rating": 4
          },
          {
            "time": "2022-04-09 15:59:15",
            "text": "EXCELLENT!!!!\nThe Best meal we ever had\nVisiting in Florida from Virginia \nWanted to try more local cuisine and SO Happy we went here!!!\nTallarine Verde...",
            "rating": 5
          },
          {
            "time": "2022-04-17 17:08:26",
            "text": "I've never been in this place before and I am glad I stopped by to try it.\nWe all know that Cuban's restaurant serves big portions but this place is insane....",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-04-29 21:26:23",
            "text": "What a great place ...I passed by it driving from Naples down to Coral Gables. I saw all the cars I said that's got to be a good place to stop as I dropped off my client... I had time to have dinner that's what I did. The portions are huge.. great prices ....great people working there!!! definitely I'll be back!!\nNow I have to go pick up my client and drive her back to Naples and it's 9:30 p.m.",
            "rating": 5
          },
          {
            "time": "2021-04-29 14:18:16",
            "text": "Best restaurant in Miami. I come here so much  and I’m probably gaining weight from it. The portions are huge and delicious and the prices are excellent. The restaurant parking is always full (you can pay to park across the street) and the wait is long at dinner. We just order to-go now mostly. The food is ready quick and it’s always ready when I get there earlier than what they say.",
            "rating": 5
          },
          {
            "time": "2021-12-12 17:09:42",
            "text": "The wife and I love to come to this place.\nThe atmosphere and food are great.\nToday we had a terrible time at the restaurant.\nToday as we enter the restaurant there was no one at the front taking names.  The restaurant had 3-4 tables empty.  After a few minutes waiting one of the hostess said that the lady taking the names was not here and they would be with us in a few minutes to take our name.\nThe hostess named Lorena seem to be fighting with her husband or boyfriend about something at their home.  There was an argument between them.  Not good that this occurred at the  entrance.\nWhen we finally were able to put our names down, she said we can take a table around the corner.  The wife and I decided to get the table as we been told.\nThe waitress Lorena continue with her argument with the other staff worker.\nOnce we got to the table the waitress said give me one minute to clean please.\nShe finished cleaning the table and we sat down.\nLorena came over and said you just can’t sit at any table.\nI tried to explain to her that we just did what she said and she stater to argue.\nAt this point my wife and I were offended in the way she addressed us in front of other customers.  We removed ourself from our he table and headed to the front once again.\nI told the lady Lorena to just put our name on the list.  She said it will be just a minutes for the table to be ready.\nWe waited about 10 minutes and decided to ask her again about the table.  She became aggravated once again and said that we need to wait.  I tried to explain that when we walked in, she did not take our names and she told us to take a tablet.  I also tried to tell her that several other people had been sat down after we enter the restaurant.  She would not let me speak and become combative.\nWe decided to leave.\nI do like this restaurant but please train the hostess better.  It seems that she was having a really bad day which affected her judgment in helping customer.\n\nI know this is not how you treat your guess as I have never experience this before.",
            "rating": 1
          },
          {
            "time": "2022-01-08 07:06:21",
            "text": "A staple of gables/grove for cuban food.\nYou can't go wrong. Never had a problem, price is right, food is very good, you can share portions (as they're too big), you won't have a bad surprise here.\nOver the years I've been probably 30-40 times to Havana Harry's (dine-in and take away) and never a complaint.\nBest dessert on the menu is the Chocolate Harry’s that you need to order at the beginning because it's like a chocolate fondant and it takes time. Very very good! 5/5",
            "rating": 5
          },
          {
            "time": "2021-03-28 19:46:02",
            "text": "If you live or you are visiting Miami, this is the place to stop and enjoy the authentic Cuban (Caribbean ) cuisine.\nShareable plates, amazing deserts and fresh juices.\nPlease keep in mind 30-45 min waiting time just to have a table.\nFood take more or less 15 min to be delivered to your table, which is amazing, to be a busy restaurant.\nNice staff, definitely highly recommend.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 11:00 PM",
        "Sunday: 11:00 AM – 11:00 PM"
      ]
    },
    {
      "name": "Tinta y Café",
      "address": "1315 Ponce De Leon Blvd, Miami, FL 33134",
      "phone": "(305) 285-0101",
      "lat": 25.7592231998562,
      "lng": -80.2586163778576,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-19 13:45:59",
            "text": "I really 'heart' this coffee shop!  It's a cozy little spot in Coral Gables, perfect for WFH, catching up with friends, or just about any time in need of a...",
            "rating": 5
          },
          {
            "time": "2022-03-06 14:19:32",
            "text": "It would have been a shame to visit Miami without getting a Cuban coffee, so on our last day in town I walked over to Tinta y Café for a cafecito. One can...",
            "rating": 4
          },
          {
            "time": "2022-03-02 07:20:21",
            "text": "I probably couldn't afford the rent but I'd love to move in here. Please?\n\nTinta y Cafe is the darn cutest cafe to possibly ever exist. The interior is...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-09-14 14:24:23",
            "text": "One of the best quaint places you can visit for breakfast, brunch or lunch. The croquettes and coffees are amazing. Kensel and Natalia were very accommodating to our family.  I have been a fan since Tinta was at their old location.  Great food, amazing people.  Hurts to publicize a review on such a great place because this is one of those places you want to really do well but you also kinda want to keep for as a secret for yourself. Even though I think the secret is out already. 😄",
            "rating": 5
          },
          {
            "time": "2021-11-15 12:10:30",
            "text": "Customer service and care from disinterested staff working the takeout window is 1 star. Waiting 30 minutes for a breakfast sandwich and 5 minutes for tap water is 1 star. Basic coffee order taking 10 minutes is 1 star. Price is 1 star due to value found elsewhere for similar items. Tasty and quickly available empanadas bring this to a 2 star review. This place prides itself on not allowing smart devices and encouraging conversation, but my experience with the staff does not incite conversation at all. Quaint, cute, disappointing.",
            "rating": 2
          },
          {
            "time": "2021-07-30 16:20:14",
            "text": "This place is great! Food was amazing (pavo real), mid century ambiance was super cozy, and the helpful staff had lots of suggestions for a locals perspective on a day around town. 10/10 would recommend",
            "rating": 5
          },
          {
            "time": "2021-12-10 20:21:52",
            "text": "Absolutely amazing. The food was delicious, the waitresss were very pretty and very friendly. And one was wearing a merry Christmas snoopy shirt. I loved it 🥰 definitely coming back",
            "rating": 5
          },
          {
            "time": "2022-02-07 23:23:41",
            "text": "Everything we ate was simply off the charts. The ham croquettes were something we have never experienced before. They are really really home made. My Guava pancakes were the best ever. The mojo pork, the omelet were amazing as well.\n\nThis place is something out of the ordinary. I highly recommend it.\n\nIt is a small place but worth the 15-20 minutes wait.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 8:00 AM – 5:00 PM",
        "Tuesday: 8:00 AM – 5:00 PM",
        "Wednesday: 8:00 AM – 5:00 PM",
        "Thursday: 8:00 AM – 5:00 PM",
        "Friday: 8:00 AM – 5:00 PM",
        "Saturday: 8:00 AM – 4:00 PM",
        "Sunday: 8:00 AM – 4:00 PM"
      ]
    },
    {
      "name": "Caña Restaurant",
      "address": "1102 Brickell Bay Dr, Miami, FL 33131",
      "phone": "(786) 535-1661",
      "lat": 25.763022,
      "lng": -80.1905578,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-03 12:01:36",
            "text": "Great experience. Staying here at the hotel for the weekend and Ubii has made this the best restaurant experience we have had all weekend. Hands downnnn",
            "rating": 5
          },
          {
            "time": "2021-12-04 03:23:51",
            "text": "A hidden gem in Miami! This little restaurant is tucked away in the Hyatt Centric, but don't let that fool you. The flavors are bold, the meat is cooked to...",
            "rating": 5
          },
          {
            "time": "2022-04-10 17:18:59",
            "text": "What a waste of time. I had hesitations beforehand as most restaurants in hotels are average at best. I would have given anything for \"average!\"...the...",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-04-11 15:01:03",
            "text": "I celebrated my birthday at this beautiful restaurant. The wait staff was amazing!  The service was professional and very friendly. The manager was very attentive and visited the table several  times. The food was cooked perfectly and was served at the correct temperature!!!\nThis place is a must!!!\nWill go back very soon !  Thank you to all the staff for making my visit memorial 🥳🥳",
            "rating": 5
          },
          {
            "time": "2022-01-07 21:47:08",
            "text": "Food wasn’t bad. Love the rice/beans/ fried plantains. Visiting from out of state.\nBut our server Felipe was amazing! 10/10! Great personality!",
            "rating": 4
          },
          {
            "time": "2022-04-03 15:18:08",
            "text": "Ubii made our experience here amazing! Would definitely come back. The food was great and the service and management even better.",
            "rating": 5
          },
          {
            "time": "2022-03-22 20:45:40",
            "text": "What an awesome meal! The food was phenomenal and our waiter, Danny, was amazing. 10/10 would recommend.",
            "rating": 5
          },
          {
            "time": "2021-12-14 09:53:26",
            "text": "Food: The clam dish is highly exceeded my expectation.\nWe tried one appetizer and two main dishes. We are seafood lovers and definitely love these dishes. We really love the clam dish it taste so fresh and a little bit sour.\n\nIndoor/Outdoor: They have outdoor seats but because it is very close to street and a bit noisy, so we chose to seat indoor. It was not crowded during noon time.\nThe ambiance and decors inside this restaurant are both good!\n\nLocation: it is inside Hyatt hotel at the second floor, easy to access.\n\nPrice: feel like a bit overpriced. But is is in Miami financial district so maybe it is the normal price here?",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 6:30 AM – 8:00 PM",
        "Tuesday: 6:30 AM – 8:00 PM",
        "Wednesday: 6:30 AM – 8:00 PM",
        "Thursday: 6:30 AM – 10:00 PM",
        "Friday: 6:30 AM – 10:00 PM",
        "Saturday: 6:30 AM – 10:00 PM",
        "Sunday: 6:30 AM – 8:00 PM"
      ]
    },
    {
      "name": "Havana 1957",
      "address": "405 Española Way, Miami Beach, FL 33139",
      "phone": "(305) 503-3828",
      "lat": 25.7870557868741,
      "lng": -80.13192403819708,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-17 10:18:36",
            "text": "Amazing food and drinks! I ordered the Cuban sampler which came with chicken, Ropa Vieja (shredded beef marinated perfectly, this one was my favorite!) and...",
            "rating": 5
          },
          {
            "time": "2022-04-02 09:52:08",
            "text": "Best Cuban food EVERRRRR and well worth the wait. The chicken had so much flavor!!! \n\nEverything is good. Fresh. Great customer service!! The whole 9! \n\nYou...",
            "rating": 5
          },
          {
            "time": "2022-03-24 14:41:23",
            "text": "My husband and I had an AMAZING time at Havana 1957 the food delicious, the ambiance amazing, the music creating such a vibe. I can totally see why people...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-05 21:19:00",
            "text": "Roberto M. Was the best server I have had in almost 10 years. The best service possible. Never felt unattended, we even accidentally dropped a drink and he immediately came to the rescue. He had great recommendations and helped us enjoy the evening every way he could.",
            "rating": 5
          },
          {
            "time": "2022-01-27 10:24:35",
            "text": "Had a great time here! They had a big selection of food and drinks and reasonable priced for Miami Beach. Left feeling full and satisfied. Their Cubano sandwich was great, and I had great service as well. Would love to come back again.",
            "rating": 5
          },
          {
            "time": "2022-04-16 13:01:06",
            "text": "The only place I'd trust to get a great Cuban near Miami Beach. Everything everyone ordered was worth sharing.\nThe outdoor seating is a nice option too. The bartender is very east on the eyes if you decide to dine inside. :)\nOh! Don't forget to get a piece of the guava cheesecake. (Thank me later)",
            "rating": 5
          },
          {
            "time": "2020-12-30 14:59:51",
            "text": "Food, drinks, ambiance were all wonderful and worth another visit. One thing I noticed (but didn’t say anything about) was a service fee. I should have asked what is was for, but I figured it was standard for that area since my bill also had a resort fee. Needless to say the service fee was gratuity (I ended up Googling it later that evening) on top of the 20% tip that I left. It was a learning lesson for me, so I would like to make others aware.",
            "rating": 5
          },
          {
            "time": "2022-04-21 18:40:52",
            "text": "Delicious meal! The appetizer sampler was huge and yummy. I also got the sampler dinner with chicken, pork and beef stew. Come hungry! Huge portions. Sitting on the street was quite busy and wasn't my favorite ambiance however.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 12:00 AM",
        "Tuesday: 11:30 AM – 12:00 AM",
        "Wednesday: 11:30 AM – 12:00 AM",
        "Thursday: 11:30 AM – 12:00 AM",
        "Friday: 9:00 AM – 1:00 AM",
        "Saturday: 9:00 AM – 1:00 AM",
        "Sunday: 9:00 AM – 12:00 AM"
      ]
    },
    {
      "name": "Havana Spice",
      "address": "30530 S Dixie Hwy, Homestead, FL 33033",
      "phone": "(786) 481-5757",
      "lat": 25.4834181106871,
      "lng": -80.4626423236743,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-06 07:05:05",
            "text": "We had lunch here on a trip to Homestead for the weekend, and we were trying to find out if Cuban sandwiches are better in Miami than in Tampa (where we...",
            "rating": 5
          },
          {
            "time": "2022-04-07 08:16:15",
            "text": "We ordered the $28 appetizer platter and it was 90% plantain chips, 3 pieces of shrimp, 1 tamale, a few bites of pork....  \n\nKids enjoyed their meal -...",
            "rating": 3
          },
          {
            "time": "2022-02-20 18:05:53",
            "text": "The food in this place is good however the wait time is ridiculous. Currently sitting here an hour after sitting down and still have not been served. what...",
            "rating": 2
          }
        ],
        "Google": [
          {
            "time": "2022-03-14 14:13:36",
            "text": "Went on Sunday 03/13/22, food awesome taste, service super super TERRIBLE. waitresses with attitude. Order bread basket and it never came, ask for it several times and nothing, they look at me like I was an alien and never gave me an answer.  Food took for ever and my fries arrived cold and hard. We had order soft drinks to come with the food never came. I had to ask one of the bus girls(clean tables) and she brought our drinks, the waitress did not show until we were almost done. another lady came with the bill I assume she was some kind of boss and I explain what happened;  she said with attitude: The bread is a courtesy of the house if we have we give it if not we don't. WOW!!! waitress said they had bread. Cuban place with out Cuban bread??? yeah right. Good looking place great food but needs to fix the service. To the owner: train your waitresses better, good attitude, prompt service know that the appetizer comes before the meal etc. if not your business will go down.\nwill wait for a while before I recommend this place or go back. thanks.",
            "rating": 2
          },
          {
            "time": "2020-09-13 12:51:53",
            "text": "Food was super amazing. Definitely blew expectations out of the water.",
            "rating": 5
          },
          {
            "time": "2022-03-23 15:10:08",
            "text": "First time there and will definitely not be the last. I been to many Cuban places around homestead/Kendall  and 100% this one is so far my favorite one. The food was amazing. The portion sizes for the price are huge. Yes, the service was slow but I don't blame them, everyone is short staffed and they try their best. The staff was friendly too. And the atmosphere wow, couldn't even telling it was right off US1.",
            "rating": 5
          },
          {
            "time": "2022-04-16 21:54:05",
            "text": "Very poor service, there was 5 of us that went in for dinner on 4/16/2022. We never got refills on our drinks the whole dinner service. Drink prices are not what the menu says. They completely forgot about my husbands entree we were all done eating when finally the waitress came to see us. It was then when we reminded her of his dinner. Once they brought it he found two pieces of plastic inside his food. Told the waitress and she made excuses on where the plastic came from. Very disappointed on a local business. This is why we go to chain restaurants instead they at least try  harder for good service.",
            "rating": 1
          },
          {
            "time": "2022-04-18 17:48:21",
            "text": "Been there a couple times and only returned because the food wasn't horrible, but this time I couldn't take their attitude and walked out.  There can't be a ruder establishment than this place.  'Customer Hospitality' means nothing to these people.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Puerto Sagua Restaurant",
      "address": "700 Collins Ave, Miami Beach, FL 33139",
      "phone": "(305) 673-1115",
      "lat": 25.77713,
      "lng": -80.13275,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-28 14:32:43",
            "text": "A charming little spot with legit meals. Loved the old atmosphere, felt like we were back in the 80s. We had the staples of ropa vieja and oxtail and they...",
            "rating": 5
          },
          {
            "time": "2022-04-18 13:46:49",
            "text": "Don't know if this is an issue or not. But it was for me. Four of us ate at this restaurant. None of us were asked at the beginning when we were seated, if...",
            "rating": 4
          },
          {
            "time": "2022-03-23 19:35:43",
            "text": "This excellent Cuban restaurant is just a block off of Ocean Drive on South Beach. We walked over from the beach around 1 PM and were seated...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-08-26 17:30:04",
            "text": "Awesome service by the guy at the front table that took my breakfast order yesterday morning. He was so warm and friendly he made feel welcomed there. The food was okay my eggs were kind of cooked half way done. I liked my eggs cooked well done, other than that everything else was good! And I really liked my server, he was the BEST! thank you for your great hospitality! I forget his name but he was inside at the front table when he waited on me.",
            "rating": 5
          },
          {
            "time": "2021-12-19 11:43:16",
            "text": "Visited my friend for a weekend and they had this place on their list for a long time. So glad we made it finally, because it was incredible. Go here as soon as possible. Had the quarter roast chicken, with rice, black beans and plantains. My friend had a similar set up with, the ground beef \"Spanish Style.\" We shared a Cuban style tamale. Cannot recommend enough. Make sure to get here early, as this place did fill up quite quick. They have a nice patio out front, which also fills up fast. They also do to go orders here which I saw a lot of people doing.",
            "rating": 5
          },
          {
            "time": "2022-04-06 17:20:06",
            "text": "Excellent location if you want to try the Cuban experience! I had a genuine Cuban sandwich. It was incredibly good, and the people here are absolutely beautiful and kind. The Cuban coffee was strong, exactly the way I was hoping. Give them a shot! You won't regret it! Will thank me!",
            "rating": 5
          },
          {
            "time": "2020-09-12 14:10:21",
            "text": "naw...my momma can do this with her eyes closed....price is to high for what it is",
            "rating": 1
          },
          {
            "time": "2021-12-27 16:21:14",
            "text": "We were here for lunch on a Sunday at around noon. The outside tables were completely occupied, but there were several tables inside that were open. We picked our own.\n\nThe service was just excellent. And the food was delicious too. The dessert (flan) was just ok, but the rest of the food was really delicious.\n\nTwo of us shared a Cuban sandwich and the others ordered their own. The fresh squeezed orange juice was really fresh squeezed -- at most other places, the term \"fresh squeezed\" is interpreted in any which way the place wants to -- here, they take the term seriously.\n\nBetween the four of us, our bill with taxes and gratuity was $100. This place is a bit pricey for a diner and this is the reason why I knocked off a star; otherwise, it was all good.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 7:00 AM – 11:00 PM",
        "Tuesday: 7:00 AM – 11:00 PM",
        "Wednesday: 7:00 AM – 11:00 PM",
        "Thursday: 7:00 AM – 11:00 PM",
        "Friday: 7:00 AM – 11:00 PM",
        "Saturday: 7:00 AM – 11:00 PM",
        "Sunday: 7:00 AM – 11:00 PM"
      ]
    },
    {
      "name": "Cafe La Trova",
      "address": "971 SW 8th St, Miami, FL 33130",
      "phone": "(786) 615-4379",
      "lat": 25.7662659,
      "lng": -80.21063,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-03 18:02:29",
            "text": "First time in Miami and a friend recommended this place. Food, service, and everything else in between  was 20/10! Hands down best restaurant I've been to...",
            "rating": 5
          },
          {
            "time": "2022-03-29 11:19:45",
            "text": "Great food, service and ambiance!  The music was awesome as is evening else.  What a fine place!",
            "rating": 5
          },
          {
            "time": "2022-03-14 05:35:42",
            "text": "This place was amazing! The atmosphere was fun and welcoming, and the band was killer. Even without all that, the cocktails were top notch and the food was...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-12-19 11:38:23",
            "text": "Such a lively atmosphere! The live band was phenomenal, great talent.  Although it was a busy Saturday night the drinks and food were served in a reasonable time frame. The waiter was attentive and alert. Food was delicious with the right amount of flavor and portion size. After dinner the DJ played nostalgic 80’s for all ages. Definitely will return to La Trova.",
            "rating": 4
          },
          {
            "time": "2021-11-28 12:16:35",
            "text": "Great vibes all around. Great live music, great drinks, great service.\n\nDefinitely on the pricey side for the drinks but suppose they're included 18% service fee is are the entertainment and the atmosphere not just the drinks and it's justifiable.\n\nThe venue looks like a street you'd find in Havana or a small Cuban town. Even the laundry lines hanging across the ceiling prove their dedication to capturing what it really looks like.",
            "rating": 5
          },
          {
            "time": "2022-01-04 14:26:52",
            "text": "I’m Cuban… and I have to say I love this place …. We’ve been there a few times and I always enjoy it !!!! However, me and my family were there for NYE recently and besides the food being superb, and the service and ambiance amazing….there was a little bit of disconnect with the events team. They quoted our large group wrong and so when it came to pay we ended up paying more than contracted initially. I didn’t make a big deal because all in all we had a great time …. But I think it’s something they definitely need to improve on for future parties.",
            "rating": 5
          },
          {
            "time": "2022-04-12 11:29:00",
            "text": "Happy hour is a must. Delicious drinks, good apps for a great price. Food is good, speed of service (really fast) is concerning. It felt like they were wanting to rush you out. Live music is a nice touch. We were front and centre which was nice but loud. I would recommend asking for a table at the back if you are looking for dinner conversation.",
            "rating": 4
          },
          {
            "time": "2022-01-22 11:59:10",
            "text": "Oh boy the yucca! Was delicious. Actually, all the food was delicious. Of course the live music completes the package. Went here on work dinner,  can't wait to take my wife on a date here. Need a good babysitter now!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 4:00 PM – 12:00 AM",
        "Tuesday: 4:00 PM – 12:00 AM",
        "Wednesday: 4:00 PM – 12:00 AM",
        "Thursday: 4:00 PM – 12:00 AM",
        "Friday: 4:00 PM – 2:00 AM",
        "Saturday: 4:00 PM – 2:00 AM",
        "Sunday: 4:00 PM – 12:00 AM"
      ]
    },
    {
      "name": "Islas Canarias Restaurant",
      "address": "13697 SW 26th St, Miami, FL 33175",
      "phone": "(305) 559-6666",
      "lat": 25.744020150637,
      "lng": -80.415998615939,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-14 13:06:44",
            "text": "Best Congri ever. Restaurants do not  know how to make congri. (Black beans). Anywhere in Miami.",
            "rating": 5
          },
          {
            "time": "2022-04-26 13:42:13",
            "text": "De visita  otra vez y \nQue\n les puedo decir\nQue WOW. \nEl servicio de Ray fue más que una bien venida. Gracias por todo Ray. Es un placer haber regresado a...",
            "rating": 5
          },
          {
            "time": "2022-04-23 12:31:23",
            "text": "Bad costumer service, small food portions at high price. This business is not what it used to be. \n\nI ordered over the phone and came to pick up my order at...",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-03-10 20:08:49",
            "text": "My wife and I were looking for leads to trying Cuban cuisine while in Miami. This place has great reviews, but please do not be fooled. I ordered an entree that had steak, chicken, shrimp, fried rice, and onions. The only flavor in the bowl was the onions. No seasoning on any of the meats. The only reason I’m giving a one star is because it was $14.99, but was big enough for 3 small servings. My wife had garlic chicken with rice, and it was not very good. We took home as leftovers and ate the next day (because we didn’t want to waste it) and the chicken tasted absolutely awful in both dishes. The men also kept winking at my wife, which she did not welcome. Overall an uncomfortable and disappointing experience.",
            "rating": 1
          },
          {
            "time": "2022-04-24 17:42:00",
            "text": "we always order pick up from there and have eaten at the restaurant as well. the food is always great, at a good price. portions are also pretty good and the flavor of the food is consistent. the only complaint would be that the food can be greasy, but not to the point where its inedible. other than that, we will continue eating there!",
            "rating": 5
          },
          {
            "time": "2022-03-11 09:22:44",
            "text": "I came here 2 mornings in a row. The food is very good here. Also quick and friendly service. I definitely appreciate how well the staff is towards their customers",
            "rating": 4
          },
          {
            "time": "2022-02-27 18:39:13",
            "text": "I was disappointed with the service today. From the fact that my family ordered the same plate, just to be told only 1 left. We replaced the other two. Then the sides were unavailable,  so they were replaced with something else without asking us. We requested 2 diet drinks and 1 regular.... 3 diet sodas were brought. Completely out of there usual service.  The only saving grace (and reason why I gave them 3 stars) was because the food was good.",
            "rating": 3
          },
          {
            "time": "2020-09-18 19:18:53",
            "text": "Excellent food and customer service.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 7:30 AM – 9:45 PM",
        "Tuesday: 7:30 AM – 9:45 PM",
        "Wednesday: 7:30 AM – 9:45 PM",
        "Thursday: 7:30 AM – 9:45 PM",
        "Friday: 7:30 AM – 11:00 PM",
        "Saturday: 7:30 AM – 11:00 PM",
        "Sunday: 7:30 AM – 9:45 PM"
      ]
    }
  ]
}