{
  "chinese": [
    {
      "name": "Golden Leaf",
      "address": "3615 Tamiami Trl N, Naples, FL 34103",
      "phone": "(239) 434-6336",
      "lat": 26.18991,
      "lng": -81.8008,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-17 20:45:21",
            "text": "Yay that we found Golden Leaf! We struggled to find a good, go-to Chinese spot with a reasonable price point. This place is it! \nOur family if four...",
            "rating": 5
          },
          {
            "time": "2022-03-09 14:54:35",
            "text": "Excellent food. Service is right on.  I had orange chicken. We also had salmon teriyaki. They put a squeeze bottle of duck sauce on the table and lots of...",
            "rating": 5
          },
          {
            "time": "2022-04-12 16:36:09",
            "text": "All I can tell you is .... don't bother. If Chinatown restaurant wasn't closed today we would've gone there...it's much better!",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-03-13 19:52:22",
            "text": "Very busy restaurant! Hot and sour soup was incredible! Very tasty and spicy! Our family ordered several different plates and enjoyed them all! The seafood tofu pot was spicy,  flavorful,  and so filling! Would have been happier with a little less tofu and a little more shrimp,  though. Great experience overall!",
            "rating": 5
          },
          {
            "time": "2021-11-16 07:01:39",
            "text": "We have been looking for a good traditional Chinese Food Restaurant and finally found it with the Gold Leaf. They don't use MSG, food is low salt and the place has very good food.\nStopped in for a luncheon special and my wife and I were very happy we did. Incredible specials including soup, egg roll, rice and entree.\nLunch was great, service was very good and price was incredible. We are making Gold Leaf our new place for Chinese Food, so glad we tried it.\nWell worth a visit.",
            "rating": 5
          },
          {
            "time": "2022-01-27 19:47:34",
            "text": "One of the worst restaurants I’ve ever been to. Poor quality food that was overcooked, water smelled and tasted like chlorine. Stay away, if you don’t want to waste your money.",
            "rating": 1
          },
          {
            "time": "2022-03-15 21:17:14",
            "text": "Great localized Chinese food. All from scratch. Broad menu. Consistent long term staff knows their game. Best Chinese in Naples.",
            "rating": 5
          },
          {
            "time": "2021-11-09 07:26:15",
            "text": "Simply the Best. Don't try any other.Clean ,service excellent, food fresh and not cheap and salty.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 10:00 PM"
      ]
    },
    {
      "name": "Chinatown Restaurant",
      "address": "2059 Pine Ridge Rd, Naples, FL 34109",
      "phone": "(239) 513-9881",
      "lat": 26.21238,
      "lng": -81.777163,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-23 09:43:51",
            "text": "Best noodles fresh and tasty \nIf a problem it is because the main cook is absent for the day \n\nBeen here for years, great stuff",
            "rating": 5
          },
          {
            "time": "2022-02-02 10:28:14",
            "text": "Well, the LMK and I decided to give Chinatown another try albeit 2+ YEARS LATER! \n\nJanuary 31, 2022: My overall rating will not change although our dinner...",
            "rating": 3
          },
          {
            "time": "2022-04-13 15:00:09",
            "text": "We come from California where there's a lot of Chinese food to choose from. My wife is Taiwanese and I love Chinese food. We live in Naples and this is the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-16 22:22:23",
            "text": "We found this gem today and was super happy with food, ambience and the staff.\nFood was so amazing and authentic. My whole family loved it. I loved the lady who served us. Her name is Elizabeth. Super super friendly with a beautiful smile (she had put mask but I could see the twinkle in her eyes) she was so good with my kids. Definitely going there more times.",
            "rating": 5
          },
          {
            "time": "2022-03-19 21:44:03",
            "text": "My wife and I love the food they make here. The cuisine is truly authentic and the taste is superb. It’s the best Chinese restaurant in Naples Florida",
            "rating": 5
          },
          {
            "time": "2022-03-20 18:23:35",
            "text": "Delicious lunch, great value.... service and place atmosphere okayish but once again I'm there to eat not chit chat or take the restaurant with me. I suggest for the snooty and snobby ones, don't go.",
            "rating": 5
          },
          {
            "time": "2022-03-02 18:42:46",
            "text": "Chinese food is my favorite. I was born and raised  in New York City. I have probably eaten more Chinese food than most people. I have also eaten Chinese food in several states/countries.\nI drove 25 minutes across town to try Chinatown restaurants food after reading the reviews. I was very disappointed and wished I could have asked for a refund. Not only is it not authentic New York Chinese food, it was terrible. The color of the rice is wrong, way too much soy sauce. It was sticky also and Chinese rice is never sticky. The wings I ordered resembled KFC texture not the consistent look and taste of the Chinese way. Very small rations also. Don’t waste your money!",
            "rating": 2
          },
          {
            "time": "2021-09-07 09:53:32",
            "text": "We had a private party today for my sons tea ceremony. Shirley was very good in accommodating all our needs. It was a pleasure to talk to her and she made the whole planning process easy🙃 The wait staff was excellent. They took care of all our needs without asking them. Their food was exceptional and very fresh. Next time when we are in town and looking for some good Chinese food, we would not hesitate to go back!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Panda Pavilion Chinese Restaurant",
      "address": "1805 Tamiami Trl N, Naples, FL 34102",
      "phone": "(239) 434-8898",
      "lat": 26.1686651408672,
      "lng": -81.799465790391,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.2
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-11-18 06:54:54",
            "text": "Awesome food, cooked perfectly.  The chicken is always juicy.  Beef tender, veggies fresh!  Huge portions.",
            "rating": 5
          },
          {
            "time": "2022-01-30 06:02:02",
            "text": "We always get delivery of the walnut shrimp...sooo good.  Sometimes it can take awhile to arrive, but worth the wait.",
            "rating": 4
          },
          {
            "time": "2021-10-06 14:44:15",
            "text": "So first things first.  This place is take out /  delivery only.  They don't have a proper dining room and the location is in an old strip mall but don't...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-10 19:32:24",
            "text": "Food here is delicious we did the chicken with broccoli, and the special fried rice. Prices are very good. Quality excellent",
            "rating": 5
          },
          {
            "time": "2022-02-06 07:09:16",
            "text": "Best chinese  food Naples has to offer. Every order is packed to the fullest. All dishes are packed with flavor. Egg fu young is so good.",
            "rating": 5
          },
          {
            "time": "2021-01-28 22:23:42",
            "text": "Everyone was nice and friendly!! The food was soo good.. Keep up the great work",
            "rating": 5
          },
          {
            "time": "2021-02-17 15:20:52",
            "text": "Best chinese I've had since fortune cookie in immokalee changed owners!!!",
            "rating": 5
          },
          {
            "time": "2022-02-02 21:01:53",
            "text": "I very rarely post reviews. Unless extreme bad or good.\n\nLast night i had the worst chinese food experience thru door dash...... was so bad (I reviewed) that I needed to order Chinese again tonight. I am from NYC and eat solid chinese food all over the five Boroughs; this was just as good. All requests were filled impeccably, and the food was hot and great. Not Chinatown great, but right there.... I recommend passionately",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 10:00 AM – 9:30 PM",
        "Tuesday: 11:00 AM – 9:30 PM",
        "Wednesday: 11:00 AM – 9:30 PM",
        "Thursday: 11:00 AM – 9:30 PM",
        "Friday: 11:00 AM – 10:30 PM",
        "Saturday: 11:00 AM – 10:30 PM",
        "Sunday: 12:00 – 9:30 PM"
      ]
    },
    {
      "name": "USS Nemo Restaurant",
      "address": "3745 Tamiami Trl N, Naples, FL 34103",
      "phone": "(239) 261-0775",
      "lat": 26.1915891738039,
      "lng": -81.8006497394205,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-18 11:18:15",
            "text": "Great Food and Service. Would love a full bar!\nBill @ BK Homes Powered by KW Naples / email: W.Archer@Kw.com PH#239.324.9845  https://homesbybillandkatie.kw.com",
            "rating": 5
          },
          {
            "time": "2022-01-05 12:58:43",
            "text": "Only some of the best seafood you can get!! The dishes are FRESH. You can taste it. Its delicious, its clean, its straight to the point and it's...",
            "rating": 5
          },
          {
            "time": "2022-04-14 12:35:34",
            "text": "We found the USS Nemo on Yelp and we were excited to try it. I'll be honest that our experience did not start out great. The menu prices online looked...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-08 08:05:37",
            "text": "We had no reservation but 2 spots at the bar opened up! Lucky us! We had the Tuna (East & West style) and enjoyed it very much! Great fish and well prepared! If you are looking for a great seafood place in Naples - you've found it right there! Do get a reservation if you can!",
            "rating": 5
          },
          {
            "time": "2022-01-04 12:49:36",
            "text": "Superb cuisine prepared by a French Canadian master with an eye for presentation.  I had the Crisp Grouper Bowl today for lunch which was (as usual) cooked perfectly, with a really neat sauce adjacent to the grouper, covered by a light blanket of tasty salad.  Wife's Snapper Salad consisted of snapper filets (cooked perfectly, of course) over an interesting combination of greens, tomato, black olives, cucumber with a special dressing.  Naples is the place for seafood, USS Nemo is where you get it upscale and elegant in the French style.  Recon the place at lunch.  Entrees are from about the same menu, but it will give you a chance to evaluate the very poor audio characteristics of the place which has a tin ceiling.  Not the fault of the chef-owner, but can be very noisy in the evening when at capacity and people are drinking.  Otherwise, superb in both food and service.",
            "rating": 5
          },
          {
            "time": "2022-01-16 19:22:02",
            "text": "Our daughter has been wanting my wife and I to go to Nemo now for over 1 year.\nWe went today and now we cannot wait to go back\nOwner greeted us at the door, gave us the table we wanted talked to us about the menu.\nOur waiter was great, the sea bass and the hogfish were even better.\nWe really enjoyed",
            "rating": 5
          },
          {
            "time": "2022-02-17 13:43:11",
            "text": "What a great venue for our Valentine's dinner! Great food, awesome service!  Food was amazing. Highly recommended",
            "rating": 5
          },
          {
            "time": "2022-04-03 21:41:25",
            "text": "The place was packed but the service was great and the food was amazing. I had the Sea Bass and my husband has the Scallops. Would definitely go back for more!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": 3
      },
      "opening_hours": [
        "Monday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Tuesday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Wednesday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Thursday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Friday: 11:30 AM – 2:00 PM, 4:00 – 10:00 PM",
        "Saturday: 4:00 – 10:00 PM",
        "Sunday: 4:00 – 9:30 PM"
      ]
    },
    {
      "name": "China Garden",
      "address": "5947 Pine Ridge Rd, Naples, FL 34119",
      "phone": "(239) 354-1888",
      "lat": 26.2118978558485,
      "lng": -81.7277678475358,
      "rating": {
        "Yelp": 4.0,
        "Google": 4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2017-07-06 09:06:21",
            "text": "Beyond having good food this small American-Chinese spot has a very friendly staff that are willing to go the extra mile for their customers. They deliver...",
            "rating": 5
          },
          {
            "time": "2021-07-04 17:27:31",
            "text": "Really enjoyed my food here and so did my wife. We got two different meals and they were both awesome!! I would certainly come back here again. We did eat...",
            "rating": 4
          },
          {
            "time": "2020-08-04 20:32:27",
            "text": "They have great specials for lunch and also daily specials. The restaurant is clean. Food is always fresh and prepared on the spot, this place has been...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2021-12-28 09:22:11",
            "text": "I would have given 4 stars, but I called at 701pm placed my order for 3 items was told it would be ready at in 30min. I arrived at 721 I told the man I was here to pick up my order and paid. He said it was ready but just a few min more which was fine since I was early. At 759 my food was ready. If your 5 min late that's fine. But not 30 min late. That was not acceptable for a take out place.\n**Now let's review the food**\nFood was hot and fresh I had zero complaints there. I love Chinese food the price was very fair so no complaints there.\n**WOULD I RETURN**\nNO, I have a Chinese place that I go to on a regular base. Only reason why I came here was because.my normal place is closed on Mondays and I was craving Chinese food.\nIf you tell me 30 min I expect it in 30-35, not 1 hour, or at least offer a free drink while you make someone wait an extra 30 min.  I fully understand it's only 3 people working but as a customer that's not my problem. Either Hire help or limit the orders.",
            "rating": 2
          },
          {
            "time": "2022-03-28 18:10:38",
            "text": "Take my mom to the hospital near by great customer service I have been living in Naples all my life best Chinese in town do not go to the sushi place next door!!",
            "rating": 5
          },
          {
            "time": "2021-12-31 21:09:02",
            "text": "I know they were slammed on New Year’s Eve but the food was horrible. Ordered steamed dumplings and no plum sauce. The sweet and sour pork wasn’t fit for my dogs but they did seem to love it as I could eat it. Lol. Won’t go back.",
            "rating": 2
          },
          {
            "time": "2021-06-09 20:37:00",
            "text": "Everything that I have ordered is DELICIOUS! The man who answers the phone and takes the orders is so very nice. Their delivery is quick too. My favorite place to order. Great business.",
            "rating": 5
          },
          {
            "time": "2021-10-27 04:38:55",
            "text": "Food was on time and the right temp. Whenever I go to a new place as I travel I always try a couple things. pork schezwan\nIt was ok but it was missing traditional aspects and the pork tasted like it was leftover from something else the poopoo platter was good. The food was ok I might have just ordered the wrong item.",
            "rating": 3
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:30 PM",
        "Saturday: 11:00 AM – 10:30 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Tokyo Thai Sushi",
      "address": "3743 Tamiami Trl E, Naples, FL 34112",
      "phone": "(239) 775-3388",
      "lat": 26.12145,
      "lng": -81.75881,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-06 07:51:15",
            "text": "Hidden gem in Naples, Florida. Great food, great service and great prices. The waitresses and chefs were so sweet to my friends and I and They even threw in...",
            "rating": 5
          },
          {
            "time": "2021-12-30 05:15:15",
            "text": "It was hubby's birthday and we decided to have an adventure in Naples. Beautiful city with nice shops, classy restaurants, crystal clear beaches. After some...",
            "rating": 4
          },
          {
            "time": "2022-01-04 05:55:11",
            "text": "Have been to Tokyo Thai Sushi several times and they never disappoint!  We love sushi and find theirs one of the best in Naples.  The Monster Lobster Roll...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-15 22:31:42",
            "text": "Ordered takeout over the phone and had an pleasantly easy time ordering. The rice was well seasoned and the accompanying sauces were a nice addition. Their menu is extensive and they were eager to make our experience positive even just for takeout. Will be returning for dine-in to this unassuming and delicious spot! 🍣 🍱",
            "rating": 5
          },
          {
            "time": "2022-02-02 21:38:43",
            "text": "We loved this place! Visited Naples for the day and wanted some great sushi after the beach- the service here is incredible. Family owned. They really went above and beyond to take care of us. We loved the Awesome roll, but enjoyed everything. Ordered tea, and they kept bringing a new pot when we drank it all. Nigiri was so fresh tasting. If we lived here we would be instant regulars!",
            "rating": 5
          },
          {
            "time": "2022-01-18 11:40:13",
            "text": "Tokyo Thai Sushi has the best sushi and Thai food. The service is consistently the best, and the food is always fresh, tasty, and reasonable. The family that owns this business is extremely personable and very welcoming. Tokyo Thai Sushi is a fantastic asset to Naples. I highly recommend dining here.",
            "rating": 5
          },
          {
            "time": "2021-11-06 21:41:44",
            "text": "Excellent food! When I first walked in I thought it can't be good because it is a small place that does not look very fancy. But the food is the quality and presentation of an upscale restaurant.  The waiters were very nice and gave us free tea. We also did not have to wait to long to get the food. On top of all the price is so reasonable.",
            "rating": 5
          },
          {
            "time": "2022-03-28 10:17:01",
            "text": "Love this place, the sushi is exquisite! My girlfriend and I visit every week, we are blown away by the kindness of the staff and quality of the food. It's our go to date night restaurant.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Wednesday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Thursday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Friday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Saturday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Sunday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM"
      ]
    },
    {
      "name": "Szechuan Chinese Restaurant",
      "address": "3753 Tamiami Trl E, Naples, FL 34112",
      "phone": "(239) 732-1441",
      "lat": 26.121138,
      "lng": -81.7585756,
      "rating": {
        "Yelp": 3.0,
        "Google": 3.8
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2019-01-21 13:26:43",
            "text": "Solid Chinese food. Noodle & Fried Rice dishes are plentiful and not overly greasy. \nThe house special wonton is delicious.\nWas not fond of the spring rolls...",
            "rating": 4
          },
          {
            "time": "2022-02-13 15:11:40",
            "text": "I hade order from this place before and it was good , the the last 3 times it was just terrible , the food don't have any flavor at all and one of my shrimp...",
            "rating": 1
          },
          {
            "time": "2022-01-19 15:51:23",
            "text": "The food is either really good or really horrible. Nothing in between. Tonight and the last few times have been horrible. There is no goo Chinese in Naples....",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-04-19 07:18:52",
            "text": "Love Szechuan!! We got there often. They have a nice inside. Friendly staff and good food! I have had and planned a couple birthday parties there as well! Everyone has enjoyed the atmosphere and food. We usually get Lo Mein, veggie fried rice, chicken and broccoli, white rice and egg drop soup!! In our opinion, Best Chinese that is in naples!",
            "rating": 5
          },
          {
            "time": "2021-09-24 14:06:05",
            "text": "The restaurant is clean. The man serving me was was very friendly, helpful, and a good server. My soup was delicious, my lunch dish was a good portion and very tasty.\nWhy the three stars? I ordered a side of steamed dumplings and I didn't like them. They weren't horrible, I just didn't like them. I told my server and asked to have it removed from my bill since I didn't want them. He was apologetic and kind. He did exactly what he should have done. I must say he was one of the best servers I've had since moving to Naples 14 years ago. He is a model server.\nThen.... what I assume is the manager, an older Asian woman, came to my table obviously upset and offended that I didn't want them. She asked rather harshly what was wrong with them. I explained I found them over cooked. That they were falling apart and I just didn't like them. Also, I didn't say to her,  it had too much wonton wrap and the filling was only the size of a grape and tough; because it was over cooked.) She then proceeded to get angry at me and tell me there was nothing wrong with them so why didn't I like them. I tried to explain I didn't say they are bad just that I don't like them over cooked. She continued to angrily tell me I am wrong and there's nothing wrong with them; they are fresh. I felt as though I was being scolded by my mother for not eating my vegetables. It was not the response I expected and inappropriate. She gave me a soup to go for free as a compensation but her behavior and attitude were disrespectful and not how a customer should be treated.",
            "rating": 3
          },
          {
            "time": "2021-12-24 09:33:36",
            "text": "Please do not waste your money here, got take out yesterday, tasted like a 55 year old white women seasoned everything, smelled like wet dog hair, from smell to taste to price this place sucks, golden Leaf is the best Chinese in Naples, this restaurant should not be in business, the steak in the living main noodles tasted like mush idk know how that steak was fda approved, please please do not spend your money here the only right thing this business should do is close there doors for good.",
            "rating": 1
          },
          {
            "time": "2021-12-25 17:39:09",
            "text": "I have eaten here and taken out many times. Always an enjoyable experience.",
            "rating": 5
          },
          {
            "time": "2022-03-22 15:11:37",
            "text": "Best Chinese Food in Naples Hands Down!  Food is always fresh and delicious.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 10:00 PM",
        "Tuesday: 11:30 AM – 10:00 PM",
        "Wednesday: 11:30 AM – 10:00 PM",
        "Thursday: 11:30 AM – 10:00 PM",
        "Friday: 11:30 AM – 10:00 PM",
        "Saturday: 11:30 AM – 10:00 PM",
        "Sunday: 11:30 AM – 10:00 PM"
      ]
    },
    {
      "name": "China One",
      "address": "1248 Airport-Pulling Rd, Naples, FL 34104",
      "phone": "(239) 643-1998",
      "lat": 26.1417456,
      "lng": -81.7668049,
      "rating": {
        "Yelp": 3.5,
        "Google": 3.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-18 08:26:29",
            "text": "My first trip was really good. Steamed dumplings and pork fried rice were amazing!! My second trip the dumplings were still fabulous but the fried rice was...",
            "rating": 3
          },
          {
            "time": "2021-08-27 09:25:24",
            "text": "I enjoyed my food and loved the customer service. I bought the shrimp curry which was BOMB! And I also got their Egg Fried Rice :-) It's close to where I...",
            "rating": 5
          },
          {
            "time": "2020-09-15 20:56:16",
            "text": "Ordered one time and I'm Not impressed will not Order again.........the ribs were not good at all and I also found a staple in the rice.",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-03-30 12:14:28",
            "text": "Typically, I do not make a review on restaurants but this particular restaurant deserves to be recognized. The past year my family has been ordering from a Chinese restaurant in Bonita Springs. They were closed at the time we wanted food and tried this restaurant out. I was pleasantly shocked how fresh the ingredients were and the bold taste of the food.  The presentation of each item had a nice touch in comparison. This will now be our regular restaurant. Thank you, to you and your staff for making our meal feel so memorable. We are looking forward to trying various items on your menu as the items we tried were 10/10. Also, we purchased our meal through Uber Eats.",
            "rating": 5
          },
          {
            "time": "2022-04-17 20:02:06",
            "text": "Just had my first order from here.  Being from NJ and now living in Naples part time I have been trying out many Chinese restaurants to find my favorite.  This one is it. Great food and friendly customer service. 👏",
            "rating": 5
          },
          {
            "time": "2021-11-30 13:26:44",
            "text": "I work across the street from China One and had only been here a handful of times and it was very lackluster. However, today on one of the busiest days for our office I decided to stop in and pick something quick up. I was impressed! Seems like there are new owners. The inside looked much cleaner than before and the customer service was on point. Food was hot and fresh when I got to the office and tasted great! Definitely will be returning now that there are new owners. There's a huge difference :)",
            "rating": 5
          },
          {
            "time": "2022-03-22 10:54:23",
            "text": "They put their rice and entree in the same container instead of giving you a small separate container for the rice.  This way, they can give you alot less food for what you pay for.  Go to a Chinese takeout that doesn't rip you off!!",
            "rating": 2
          },
          {
            "time": "2021-12-11 07:39:33",
            "text": "Got take out this time. General Tso's Chicken. Husband enjoyed House Fried rice. Under new ownership. Owners used to work at Golden Leaf. About 5 tables for eat in. Very tidy place. Extremely friendly, efficient service. Our new go to Chinese restaurant in Naples.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Omei Bistro",
      "address": "14700 Tamiami Trail North, Ste 6, Naples, FL 34110",
      "phone": "(239) 631-5633",
      "lat": 26.304537,
      "lng": -81.803043,
      "rating": {
        "Yelp": 3.0,
        "Google": 3.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-11-10 21:46:24",
            "text": "If you've looked for Chinese food in SW Florida you probably ended up in a filthy takeout place where the owners yelled at you and the food tasted like...",
            "rating": 5
          },
          {
            "time": "2022-03-04 05:55:59",
            "text": "We had to make a reservation 30 minutes earlier than we wanted because they said they were going to be packed.  We were there at our requested time and...",
            "rating": 1
          },
          {
            "time": "2022-04-16 11:10:10",
            "text": "Omei is a strange place. It is a series of contradictions. They closed at their current location and then reopened after a period of time. This is a...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-07 06:27:01",
            "text": "This restaurant refused to take my take out order because they said they were backed up. I was willing to wait. What’s the difference between take out and eat in. And why do they list Take Out as an option? I drove five miles for nothing. I won’t go back.",
            "rating": 1
          },
          {
            "time": "2022-02-01 19:16:20",
            "text": "Really good food. Great appetizers. Prices somewhat high but not unreasonable. Service is slow but where is that not the case these days. Decor is nice.. I'd recommend..",
            "rating": 4
          },
          {
            "time": "2022-02-23 20:01:08",
            "text": "Diner beware!  Advertises for takeout but refuses to answer phone for customers to place takeout orders.  Amazing food, but only the owner is allowed to answer phone—other staff are prohibited from taking phone orders, performing other basic duties, etc, that would enable a seemless dining experience.  Posted business hours are also not followed as advertised.",
            "rating": 1
          },
          {
            "time": "2021-12-15 12:22:31",
            "text": "What a difference this place is from their old location. Closer to my house, much nicer inside and better staff. The previous location had great food but horrible staff. Although I will say the woman who sat us who I think is the owner scolded me for being 10 minutes late for our reservation. I work in the industry and a 15 min grace period is normal. Plus you don’t scold the customer in general. That really annoyed me, otherwise it would be 5 star. Get the Peking duck. It is one of my favorite meals of all time. Make sure to preorder duck ahead of time when you make reservation. Otherwise I don’t think you can get it. It’s well worth it! Great spot but owner needs to lose attitude which is mentioned in other reviews.",
            "rating": 4
          },
          {
            "time": "2022-03-07 13:37:36",
            "text": "Food all made fresh to order, sometime takes longer to come out but thats because it's made fresh to order. Top quality cbinese food.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 4:30 – 9:00 PM",
        "Wednesday: 4:30 – 9:00 PM",
        "Thursday: 4:30 – 9:00 PM",
        "Friday: 4:30 – 9:00 PM",
        "Saturday: 4:30 – 9:00 PM",
        "Sunday: 4:30 – 9:00 PM"
      ]
    },
    {
      "name": "Seoul Korean Restaurant",
      "address": "5926 Premier Way, Ste 116, Naples, FL 34109",
      "phone": "(239) 653-9406",
      "lat": 26.213343,
      "lng": -81.7898265,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-22 05:33:56",
            "text": "My girl and I were in Naples for the art show. After I thought you know what  would be great is some Korean BBQ.\n\nWe found this little gem and had a great...",
            "rating": 5
          },
          {
            "time": "2022-01-05 20:47:14",
            "text": "This is quite an interesting Korean restaurant in Naples. I was visiting for the day and was really craving some Korean food, and this seemed to be the best...",
            "rating": 4
          },
          {
            "time": "2021-12-20 12:48:44",
            "text": "We visited Seoul korean restaurant during our visit to Naples, and it was a good one. It is located in a very quite neighborhood strip mall, and when we...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-18 23:47:16",
            "text": "Just amazing! We go to Seoul as often as possible. If you're looking for authentic Korean food this is the place. They have so many delicious soups and stews along with the other popular Korean dishes. The service is also wonderful and the staff is always kind and helpful.",
            "rating": 5
          },
          {
            "time": "2022-03-10 16:50:43",
            "text": "What a great pleasure to come and eat here, food is delightful, beautiful people and wonderful atmosphere.\nReal homemade Korean food, you can taste the love they put into the food in every bite, totally recommended. 💯💯💯",
            "rating": 5
          },
          {
            "time": "2022-01-04 19:53:18",
            "text": "Love the food its amazing. Staff is Very friendly, makes you feel like family. No other place like it, its a nice little get away from all the stress and worry in life. A real hidden gem.",
            "rating": 5
          },
          {
            "time": "2022-03-29 16:19:05",
            "text": "Everytime I've been there I've been welcomed in like family. The service is Great and it's hands down the Best Korean food I've ever had!\nI've tried several Appetizers, Soups and Entrees.\nEach one has been perfect!",
            "rating": 5
          },
          {
            "time": "2021-12-26 19:52:34",
            "text": "I forget name of dish I had.  It was described as sliced beef.  It was a little pricey.  Normally I expect places to be light on the beef and heavier on veggies, but this dish had plenty of beef.  So I was happy.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:30 PM",
        "Saturday: 12:00 – 9:30 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    }
  ],
  "korean": [
    {
      "name": "Seoul Korean Restaurant",
      "address": "5926 Premier Way, Ste 116, Naples, FL 34109",
      "phone": "(239) 653-9406",
      "lat": 26.213343,
      "lng": -81.7898265,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-22 05:33:56",
            "text": "My girl and I were in Naples for the art show. After I thought you know what  would be great is some Korean BBQ.\n\nWe found this little gem and had a great...",
            "rating": 5
          },
          {
            "time": "2022-01-05 20:47:14",
            "text": "This is quite an interesting Korean restaurant in Naples. I was visiting for the day and was really craving some Korean food, and this seemed to be the best...",
            "rating": 4
          },
          {
            "time": "2021-12-20 12:48:44",
            "text": "We visited Seoul korean restaurant during our visit to Naples, and it was a good one. It is located in a very quite neighborhood strip mall, and when we...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-18 23:47:16",
            "text": "Just amazing! We go to Seoul as often as possible. If you're looking for authentic Korean food this is the place. They have so many delicious soups and stews along with the other popular Korean dishes. The service is also wonderful and the staff is always kind and helpful.",
            "rating": 5
          },
          {
            "time": "2022-03-10 16:50:43",
            "text": "What a great pleasure to come and eat here, food is delightful, beautiful people and wonderful atmosphere.\nReal homemade Korean food, you can taste the love they put into the food in every bite, totally recommended. 💯💯💯",
            "rating": 5
          },
          {
            "time": "2022-01-04 19:53:18",
            "text": "Love the food its amazing. Staff is Very friendly, makes you feel like family. No other place like it, its a nice little get away from all the stress and worry in life. A real hidden gem.",
            "rating": 5
          },
          {
            "time": "2022-03-29 16:19:05",
            "text": "Everytime I've been there I've been welcomed in like family. The service is Great and it's hands down the Best Korean food I've ever had!\nI've tried several Appetizers, Soups and Entrees.\nEach one has been perfect!",
            "rating": 5
          },
          {
            "time": "2021-12-26 19:52:34",
            "text": "I forget name of dish I had.  It was described as sliced beef.  It was a little pricey.  Normally I expect places to be light on the beef and heavier on veggies, but this dish had plenty of beef.  So I was happy.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:30 PM",
        "Saturday: 12:00 – 9:30 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Zen Asian BBQ",
      "address": "10823 Tamiami Trl N, Naples, FL 34108",
      "phone": "(239) 260-7037",
      "lat": 26.26994,
      "lng": -81.80209,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-12-24 12:33:48",
            "text": "Amazing food and great service!! Very fast. I love this asian bbq and everything tasted great. I tried the lamb chops and calamari noodles and they were...",
            "rating": 5
          },
          {
            "time": "2022-04-12 18:25:32",
            "text": "Visited Zen Asian BBQ on a visit to the FL west coast. We were excited to try a place that had KBBQ and Japanese items. \n\nThere was no wait on Monday night...",
            "rating": 4
          },
          {
            "time": "2022-02-09 19:25:46",
            "text": "Excellent food and service.... The place even smelled like those i visited in Taiwan and Shenzhen on a number of occasion. The quality of the tuna in the...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-04-10 17:11:14",
            "text": "Excellent food. I was craving Korean food. We were pleasantly surprised with the place- a bit of an odd choice of pop wall art- comfortable, very good set up for Korean BBQ and sushi. Nice presentation, generous portion and delicious Korean stews. Undoubtedly,  we will be back!!",
            "rating": 5
          },
          {
            "time": "2021-10-26 09:45:56",
            "text": "Everything was so good! The soju watermelon drink was so amazing! I recommend trying something you wouldn’t normally get, since everything on the menu is 5 star quality.",
            "rating": 5
          },
          {
            "time": "2021-08-29 20:29:55",
            "text": "Top notch costumer service!!! We are new to Naples and googled restaurants in our area and found this gem. We were greeted by Mike and he sat us at the BBQ  table where we were able to grill our amazing food. Mike sent over a few of his favorite appetizers for us to try and they were delicious!!!!! As if we’re weren’t full enough  he then sent us some dessert to try. I highly recommend this restaurant if you are looking for Authentic Asian food",
            "rating": 5
          },
          {
            "time": "2020-09-12 18:18:02",
            "text": "Just excellent",
            "rating": 5
          },
          {
            "time": "2021-08-16 19:50:18",
            "text": "Incredible place!!! A true hidden treasure on the North side of 41 North. Please keep this jewel under your hat! Mum is the word here.. Classified for Cool friends only. You'll need your Govt, ID & a strip search to enter this joint! Just kidding.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:30 PM",
        "Tuesday: 12:00 – 9:30 PM",
        "Wednesday: 12:00 – 9:30 PM",
        "Thursday: 12:00 – 9:30 PM",
        "Friday: 12:00 – 9:30 PM",
        "Saturday: 12:00 – 9:30 PM",
        "Sunday: 12:00 – 9:30 PM"
      ]
    },
    {
      "name": "Namba Ramen & Sushi",
      "address": "8847 Tamiami Trl N, Naples, FL 34108",
      "phone": "(239) 592-4992",
      "lat": 26.249530828044378,
      "lng": -81.80281587053756,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-03 19:12:01",
            "text": "By far and away the best sushi in west Florida. Comparable to spots in nyc, Chicago, LA, and Miami. So thankful this place exists in Naples, coco the owner...",
            "rating": 5
          },
          {
            "time": "2022-02-28 18:51:45",
            "text": "Amazing ambiance and even better ramen. For appetizers, we had the skewers however the Berkshire Pork Belly Bun has been by far my favorite. The Hokkaido...",
            "rating": 5
          },
          {
            "time": "2022-03-15 12:52:49",
            "text": "It is truly amazing. The wait is long but it is to be expected their food and service are great.",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-09 22:02:12",
            "text": "The best sushi ever. The staff was beyond friendly and helpful. Ivan was extremely sweet and showed great hospitality. Will make sure to come back here again.",
            "rating": 5
          },
          {
            "time": "2022-02-21 03:40:00",
            "text": "Gotta admit. Ive been in living in Naples for over 35 yrs. Hands down best fresh sushi hands down.  Been to every sushi bar/ restaurant here  but they are top notch. Service was outstanding and so was all the other Appetizers/ platters we ordered absolutely worth the menu price.",
            "rating": 5
          },
          {
            "time": "2022-03-27 08:08:54",
            "text": "This place is incredible. We had the privilege of sitting at the sushi bar. Chef KoKo and his team make creating sushi look like art! The food is to die for, it literally melts in your mouth - best sushi I’ve EVER had!",
            "rating": 5
          },
          {
            "time": "2022-01-23 22:30:33",
            "text": "We were visiting Vanderbilt beach and found this place, a hidden gem, serving the most authentic ramen I've ever had in Florida. Great for casual date night. In addition, it is close to stores making it a great stop for visitors.",
            "rating": 5
          },
          {
            "time": "2021-10-18 13:29:10",
            "text": "This place is our absolute favorite! Phenomenal menu, so may unique options and completely worth the no-reservations wait. Would highly recommend!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Tuesday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Wednesday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Thursday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Friday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Saturday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Sunday: 5:00 – 9:30 PM"
      ]
    },
    {
      "name": "Noodle Saigon",
      "address": "13500 Tamiami Trl N, Ste 11, Naples, FL 34110",
      "phone": "(239) 598-9400",
      "lat": 26.29275,
      "lng": -81.80115,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-25 13:49:41",
            "text": "Okayyyyy I have been craving some AUTHENTIC Asian cuisine in general since I have moved to Naples - and Noodles Saigon's THE PLACE for Vietnamese! I cannot...",
            "rating": 5
          },
          {
            "time": "2022-01-22 11:24:25",
            "text": "Came here on a Saturday afternoon, there were only 3 customers and we sat ourselves. We ordered the P2 which was very, very good. Fresh ingredients, good...",
            "rating": 3
          },
          {
            "time": "2022-04-06 21:12:59",
            "text": "I very much needed the soothing, healing warmth of a good pho ga and was fortunate to have found some here. The broth had a complex depth which perfectly...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2020-09-03 20:16:28",
            "text": "Great Pho and great service!",
            "rating": 5
          },
          {
            "time": "2022-02-04 21:20:46",
            "text": "Best Pho and fried rice in Naples! Fast friendly service, large portions and reasonable prices. Menu is not very extensive, but what they have is great!",
            "rating": 5
          },
          {
            "time": "2021-06-02 18:44:13",
            "text": "Friendly service. Good food. Reasonable prices. Decor is dated but who cares.. I'd recommend..",
            "rating": 4
          },
          {
            "time": "2022-03-24 00:35:45",
            "text": "I came here from miami to play with my friends. We were seated for a long time and no one asked if we wanted something to drink? Our meal was simple, just water, and all people ordered the same thing. They directly charged  20% tip and didn't tell us. I didn't receive any professional service, but we be charged  20% of tip. Is this rule required by your restaurant? The key is the unprofessional service and unauthentic  Vietnam restaurant.There are only few pieces of meat and a ball in the house pho, which is not worth $14 at all. I have eaten many Vietnamese dishes, and they are very unauthentic. We will not come again.",
            "rating": 1
          },
          {
            "time": "2021-09-09 22:54:10",
            "text": "Great place very friendly staff been twice and they are always very friendly, the food is a very good price compared to others and I would highly recommend!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: Closed",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 9:00 PM",
        "Saturday: 11:00 AM – 9:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Araya Sushi Asian Grill",
      "address": "2650 Immokalee Rd, Naples, FL 34110",
      "phone": "(239) 593-3344",
      "lat": 26.272363,
      "lng": -81.7687444,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-04 11:38:04",
            "text": "Outstanding sushi, great Asian options in a sweet and charming atmosphere. The patio is adorable and the service exquisite.",
            "rating": 5
          },
          {
            "time": "2022-01-02 14:12:00",
            "text": "This was our first experience in Araya. It is Excellent!!!!! Great service and delicious Thai and sushi food!!!!! Nina, our waitress, was so wonderful...",
            "rating": 5
          },
          {
            "time": "2022-01-27 16:42:10",
            "text": "Fellow yelper's were right on the mark with their ratings. The ambiance, service and food are 1st rate. A delightful treat when so many places down here are...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-08 22:39:31",
            "text": "The first time we went we were not a fan of the items we ordered. We thought we give it a try again since a good friend of ours loves this place. This time we ordered all different stuff and we loved everything we ordered. My bf also ordered a salmon entree very very good, but not pictured.",
            "rating": 5
          },
          {
            "time": "2022-04-01 07:32:34",
            "text": "Outstanding food, friendly and fast staff. The selections are really cool and creative. I recommend this restaurant to all of my friends! The patio is super cute and cozy, the I side is warm and inviting. Go have launch or dinner and see what I’m raving about.",
            "rating": 5
          },
          {
            "time": "2022-01-23 01:44:07",
            "text": "I went to Araya yesterday evening with my husband, mother and one year old daughter for dinner. Upon arrival we were greeted and sat at a table. Once seated we were told that, due to the weather, all of their outside reservations needed to be moved inside and therefore it was going to be very busy within the next 30-60 minutes. That was fine with us as we just wanted to eat and leave to finish running errands. We were given water and menus. We proceeded to wait for 15 minutes for a server to return to take our order. Within that time several other tables of customers had been seated and helped by servers, as we were ignored. At that point we decided to leave and find somewhere else that was willing and able to accommodate us. My husband and I have been to this restaurant before and have enjoyed the food. However, this evening we felt as though the customer service was completely lacking. If they were unable to accommodate us, due to not having a reservation, they could have been forthcoming about that upon our arrival. Instead they sat us, basically told us we need to hurry up and then proceeded to ignore us. We are very disappointed with the service and have never been treated as such an inconvenience.",
            "rating": 1
          },
          {
            "time": "2022-02-01 08:32:38",
            "text": "I took my boyfriend here for his 23rd birthday! He loved it. The staff was courteous and attentive. The presentation was beautiful and well thought out. The chef is incredibly talented. The food was absolutely delicious",
            "rating": 5
          },
          {
            "time": "2022-04-16 17:02:56",
            "text": "Nice, new outdoor patio with friendly and accommodating service!  We didn't have a reservation, but figured to try to dine in and patio seating would be a plus on a pleasant evening.  We lucked out and got a table for 4 and food was phenomenal!  Grilled octopus, sushi/sushimi boat, and blue crab fried rice was a big hit for our teenage boys!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:00 PM",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: 12:00 – 9:00 PM",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Komoon Thai Sushi & Ceviche",
      "address": "1575 Pine Ridge Rd, Ste 9, Naples, FL 34109",
      "phone": "(239) 234-2442",
      "lat": 26.213012,
      "lng": -81.787035,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-28 09:46:57",
            "text": "They renovated and it was nice, much roomier inside. You can sit outside as well.\nMenu has colored photos which are helpful \nEasy free parking at the end of...",
            "rating": 4
          },
          {
            "time": "2021-01-22 05:22:00",
            "text": "Excellent service from Nikki. Sushi is fresh and rolls are creative. The ceviche is quite authentic, in fact it was better than in many places in Peru....",
            "rating": 5
          },
          {
            "time": "2022-03-03 07:49:52",
            "text": "I have eaten and ordered from Komoon many times. In general, their food is pretty good. I find it more convenient to order takeout than eat in as I have...",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2021-12-18 10:54:01",
            "text": "First, let me note that for the past 6 years, I have dined here roughly 4 times each year. Mostly, I been very pleased with everything. Last night, I ordered takeout in order to relax and dine at home. Online, I ordered my standby Thai comfort dish of Basil Sauce with a side of brown rice. I arrived at the Pine Ridge location to find the dinner rush had passed and 4 tables inside and 5 outside had diners. There were 3 servers and a kitchen staff of who knows how many but at least 3 different faces appeared at the small counter where servers pickup meals from the kitchen.\n\nWhile not busy, no employee made eye contact much less saying hello and or offering a \"Someone will be with you shortly\" greeting or whatever. With 2 other takeout customers there before me I joined their queue near a table laden with food in containers but none of it was going anywhere. More takeout containers came out of the kitchen and were placed on the table. After being there for at least 15 minutes with still no acknowledgement of my presence by anyone who worked there, one server/hostess came over to the table, sat down, spread out 6 take-out order receipts, starting reading them and sorted through the 15 or more containers on the able  to match each item to the proper printed receipt. No receipt had a complete order so the server got up and performed some other tasks. Meanwhile, a new take-out customer who ordered online and was completely ignored. All the while, the take-out food is cooling.\nMore food came out of the kitchen and was put on the table by the server/hostess and more receipts were read and containers were matched to an order. Finally, one of the customers there before  me had a complete order, paid and left. My term came next except, the side of brown rice still wasn't ready. It was forgotten. The server/hostess went to the kitchen and brought back the brown rice. I should have opened every container and checked it personally before paying but I didn't. My big mistake. Whatever sauce I was given was far different from the usual, it was not spiced properly but I added my own chili pepper sauce at home. The basil used was not fresh but dried out stems and fibrous. The brown rice was a glutinous mass of rice mush so overcooked and dried out and cold that the scoop of rice was glued together and there were no individual rice grains separable from the mass, just different degrees of textured mush. Disgusting.\n\nWill I go back again. Maybe, but only as a last resort as there are other Thai restaurants in the area. Oh well, every meal is an adventure. Sometimes they end really well and other times ...",
            "rating": 1
          },
          {
            "time": "2020-09-17 11:08:05",
            "text": "good food",
            "rating": 5
          },
          {
            "time": "2020-08-26 20:42:31",
            "text": "Amazing",
            "rating": 5
          },
          {
            "time": "2021-09-24 11:30:25",
            "text": "Komoon used to be one of my favorite restaurants, unfortunately as they've expanded the quality of service and food has gone way down, especially with my most recent experience.\n\nI received an email for a promotion for either 20% off any order or 50% if you spend at least $50. I decided to bring a couple of my colleagues who had never been and I had hyped them up about how good the food was. We got a bunch of appetizers and I got the basil chicken with rice (a dish I used to always get) for my entree but the taste was just not good. Sauce was very sweet, seems like they may have changed the recipe. Although the food was not great, I was still having a good experience. That was until I mentioned the coupon.. Our server said we were not eligible for the coupon as it was only allowed to be used for dinner service. However, no where in the email is this stated. The only small print mentioned that the 20% off any order or 50% off $50 can not be combined. Even if this was their intention (only having the coupon for dinner) a well run restaurant would still honor the coupon and update the email for future guests. However, this was not done. She did end up calling a manager who gave us 20% off our order but in my opinion this is still not the right thing to do. When I was younger, I worked in the service industry for years and understand how the treat customers. I hope Komoon learns from this experience but for the time being I will not be recommending or returning to their restaurants. I hope your experience is better than mine.",
            "rating": 2
          },
          {
            "time": "2022-04-19 05:06:17",
            "text": "The food was good.  Service a bit slow. But they took good care of us while we were there.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 10:00 PM",
        "Tuesday: 11:30 AM – 10:00 PM",
        "Wednesday: 11:30 AM – 10:00 PM",
        "Thursday: 11:30 AM – 10:00 PM",
        "Friday: 11:30 AM – 11:00 PM",
        "Saturday: 11:30 AM – 11:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Poke Mahi",
      "address": "2349 Vanderbilt Beach Rd, Ste 520, Naples, FL 34109",
      "phone": "(239) 260-5722",
      "lat": 26.24570992090625,
      "lng": -81.77127334809396,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.7
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-05 20:08:46",
            "text": "This place is really nice inside. They have a dinning area on one side and a sofa style sitting area on the other side. The place was very cleaned and the...",
            "rating": 4
          },
          {
            "time": "2021-07-30 10:56:26",
            "text": "Staff friendly but needs to be trained better \nDid not know about the rewards so I lost about 100 points \n\nWould have appreciated someone more fluent in...",
            "rating": 4
          },
          {
            "time": "2021-12-31 04:33:42",
            "text": "When we walked in nobody but the manager. Very clean, friendly and good health food!  It is a new concept for the area but works great for a quick healthy...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-13 21:41:46",
            "text": "I am blown away by the incredible hospitality I receive each time I come here.\nToday I came straight from the gym next door to pick up my dinner for later in the evening. I hadn't been in since my birthday in October (only because I hardly ever go out to eat), and as soon as I walked in, the owner lit up, remembering my face and happy to see me back! How thoughtful! She made me the most delicious bowl I've had yet.\nShe instantly put a smile on my face.\n\nThe food is always delicious, fresh, and perfect for the hot, humid days we have in FL. I'm all for supporting small local businesses, especially when the owner is hands down the sweetest woman I have ever met. She is so bright and charming, she really brings Poke Mahi Naples to life! As the first Poke place to come to Naples, I hope more than anything that she is in business here for a very, very long time.\n\nFor reference, this review is actually coming from my girlfriend, Kat.",
            "rating": 5
          },
          {
            "time": "2022-03-15 19:27:19",
            "text": "The food and options were amazing. The selection of dishes you could make were amazing and while a bit pricey, the food was delicious. The decor is very nice, this is not some hole in the wall and a great place for a date or night out. Owner was the one who took care of us and was very kind and professional.\n\nLooking forward to going back and trying something different.",
            "rating": 5
          },
          {
            "time": "2022-02-20 20:42:57",
            "text": "Best Poke in town 🐟! The Russian service woman is so nice (shame on us that we forgot her name 😔). Everytime a pleasure to chitchat with her. We will miss this place, but come back when we visit Naples again. Been here multiple times and I highly recommend it. Get the Spicy Tuna and Asparagus. Nice store to sit in as well.",
            "rating": 5
          },
          {
            "time": "2022-03-11 01:03:20",
            "text": "A lovely restaurant with an owner that is the sweetest gal you would ever want to meet .\nThe poke bowls are full of fresh, veges, seafood fruits and just deliciousness. She will make it to your liking. So glad this delightful, happy place has arrived.",
            "rating": 5
          },
          {
            "time": "2022-02-17 19:54:59",
            "text": "This place was so yummy, the bowls were so delicious & the owner was super sweet and had amazing hospitality. Felt super welcomed and had lots of options to choose from. The seating area was super clean, food was fresh and good vibes! Would recommend 🙏🏻",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 8:00 PM",
        "Tuesday: 11:00 AM – 8:00 PM",
        "Wednesday: 11:00 AM – 8:00 PM",
        "Thursday: 11:00 AM – 8:00 PM",
        "Friday: 11:00 AM – 8:00 PM",
        "Saturday: 11:00 AM – 8:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Celebration Park Naples",
      "address": "2880 Becca Ave, East Naples, FL 34112",
      "phone": "(239) 316-7253",
      "lat": 26.125977811668,
      "lng": -81.771135194577,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-10 04:47:32",
            "text": "A weekday truck lunch. Beef barbacoa tacos at the Mexican truck-- just super. piquant sauce, and a separate hot-yes hot- sauce to sparingly applied.  Meat...",
            "rating": 5
          },
          {
            "time": "2022-03-19 13:05:07",
            "text": "Be Fresh food truck was sadly disappointing and the owner, you get guy was rude, lacked customer service and overall just not helpful. Salad was ok....",
            "rating": 1
          },
          {
            "time": "2022-03-09 08:37:25",
            "text": "This is a nice setup for trying different food options, especially if you're with a group that all likes different things. There's a wide variety to choose...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2020-09-10 20:12:07",
            "text": "Special Food Truck Park, must visit!",
            "rating": 5
          },
          {
            "time": "2022-03-20 13:33:01",
            "text": "Really cool spot. About a dozen food trucks with great food. The lobster rolls were the best I've ever had. The Greek truck had fantastic gyros! Cool litte circle bar for the drinks and live music. Had a blast. Will definitely return.",
            "rating": 5
          },
          {
            "time": "2022-04-07 20:26:33",
            "text": "I recommend this place. Great selection of food and a nice relaxed atmosphere. It gets HOT there so dress light. My only recommendation is that they should have more misters around the park. It would make they experience so much more enjoyable.",
            "rating": 4
          },
          {
            "time": "2022-03-24 14:22:34",
            "text": "My family and I decided to stop here after a trip to the zoo. I was pleasantly surprised by all of the options and never thought of food trucks having good food. I had a mozzarella and tomato panini. It was nice to enjoy our meal by the water as we watched boats pull on to enjoy a meal here. It was a family-friendly establishment,  which appears to be rare in Naples. I recommend having a good lunch here.",
            "rating": 4
          },
          {
            "time": "2022-02-18 18:45:43",
            "text": "Little bit of entertainment. Beautiful atmosphere. And all the little food trucks. Beautiful place relaxing and the people were just absolutely happy and having a good time. This is definitely a place you want to go to relax and unwind. The bar made was so pleasant. Her name was very unique and I can't believe I forget it.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "The Great Foodini’s Mobile Bistro",
      "address": "2880 Becca Ave, Naples, FL 34112",
      "phone": "(239) 273-0371",
      "lat": 26.126096356993077,
      "lng": -81.77084317214324,
      "rating": {
        "Yelp": 5.0,
        "Google": 4.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-08 16:13:05",
            "text": "I have to say it was the best lobster roll I've ever had! And I am a true foodie! Thanks to the great Foodini's Mobile Bistro!",
            "rating": 5
          },
          {
            "time": "2022-01-22 10:13:44",
            "text": "So disgusting I ate almost everything....  Best lobster roll I've ever had.  Photo was the king crab dip and lobster and grits. Both were awesome.",
            "rating": 5
          },
          {
            "time": "2022-02-28 10:10:58",
            "text": "Wonderful food.  Great service and attitude.  The lobster bake was the best seafood we've had and for a food truck, fantastic.  Next time we want to try the...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-17 13:17:40",
            "text": "This is one of the best food truck I have ever eaten at. Slinging this kind of quality food out of a food truck is nuts. I imagine most people are buying lobster rolls, but I asked chef what he thought was underrated on his menu, so I ordered the lamb ribs and porchetta sandwich. I also grabbed onion rings because I'm a die-hard onion ring fan.\n\nChef is awesome and answered a bunch of my questions, including how he cooked the ribs. Onion rings were insanely good.\n\nJust eat here.",
            "rating": 5
          },
          {
            "time": "2022-02-02 07:34:11",
            "text": "Family members told us about this park in Naples that had these permanent food trucks and a bar/view of the water - that alone would have been reason to go out of the way to visit this spot.  Then we heard about this food truck that is a mobile 5 star restaurant that uses the best ingredients, prepared by an expert chef.\n\nI dont say this lightly; it was the best lobster roll we've ever had AND I've spent summers in Maine and CT.  We also ordered the Cuban sandwich and that too was the best Cuban we have ever had.  The meat was smoked beautifully and the bread ratio was perfect and crunchy on the outside with all the right flavors.  I cannot recommend this place enough and will be swinging by again on our way back to Ft. MYERS airport.",
            "rating": 5
          },
          {
            "time": "2022-01-26 12:20:40",
            "text": "Hot Lobster Roll was delicious, one of the best I’ve had. Although a bit pricey, well worth it for a special treat. You can tell the chef prepares each order with great care and attention. Looking forward to trying more items from the extensive menu, many of which sound like dishes you’d get at a high-end restaurant.",
            "rating": 5
          },
          {
            "time": "2022-03-11 20:32:58",
            "text": "Such a unique experience! The food is absolutely outstanding - we tried the mini lobster roll, the lobster corndog, the “soul dog”, the Korean fried chicken sandwich, and the potato pancakes (over two days)…truly out of this world!!! If you’re in Naples and don’t seek this place out, shame on you!",
            "rating": 5
          },
          {
            "time": "2022-02-04 21:28:36",
            "text": "This lobster roll was like nothing I’ve ever had before , and I grew up in lobster!  David truly loves making his food a masterpiece and puts care and art into everything he makes. Anyone who likes lobster needs to go to the GREAT FOODINI in Celebration Park.  David is a chef who loves making people happy, from his delicious food to the live screen of Times Square New York.   Get one of the lobster dishes and you will not be disappointed.   I can’t wait to go back!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "AZN Azian Cuizine",
      "address": "9118 Strada Pl, Ste 8155, Naples, FL 34108",
      "phone": "(239) 593-8818",
      "lat": 26.252582897283126,
      "lng": -81.79772867304794,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.1
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-25 18:39:10",
            "text": "Seafood soup - 4.5\nGreen beans and beef - 4.5\nService - 4.5\n\nPrice was solid except the sushi was overpriced \n\nOverall a very good place.",
            "rating": 4
          },
          {
            "time": "2022-03-26 17:41:26",
            "text": "Do not come here - You've been warned. We went against our better judgement and came even though the reviews were horrible. Just like the previous reviews...",
            "rating": 1
          },
          {
            "time": "2022-03-01 10:47:02",
            "text": "I'm giving AZN 3 stars based more on our server than the food. The person who seated us had such a scowl on her face that we almost decided to leave. She...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-01-09 02:23:23",
            "text": "What a great spot! Amazing food with a great variety and owner Michael is the king of hospitality.  One of the best spots in SWFL.",
            "rating": 5
          },
          {
            "time": "2022-01-05 23:11:09",
            "text": "Great spot!  Menu is constantly updated and so many options. Owner. Michael is always there to say hello and make sure you get a great meal and even better experience. 5 stars ++++++",
            "rating": 5
          },
          {
            "time": "2022-04-03 18:20:49",
            "text": "The food was excellent. Seated outside on a beautiful afternoon for an enjoyable experience.",
            "rating": 5
          },
          {
            "time": "2022-01-23 14:43:01",
            "text": "Upscale Asian restaurant with great food.  They have many kinds of sushi rolls along with other entrees, appetizers, and drinks.  They have a very extensive sake menu as well. The staff was courteous and brought the food quickly.",
            "rating": 5
          },
          {
            "time": "2021-12-09 21:01:21",
            "text": "Delicious meal. Happy hour is 4-6pm with 20% off entree prices at the bar. We had the shaken Vietnamese filet special and the short rib steamed bun app. Everything was very good!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 3
      },
      "opening_hours": [
        "Monday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Tuesday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Wednesday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Thursday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Friday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Saturday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM",
        "Sunday: 11:30 AM – 2:00 PM, 4:00 – 9:00 PM"
      ]
    }
  ],
  "japanese": [
    {
      "name": "Namba Ramen & Sushi",
      "address": "8847 Tamiami Trl N, Naples, FL 34108",
      "phone": "(239) 592-4992",
      "lat": 26.249530828044378,
      "lng": -81.80281587053756,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-03 19:12:01",
            "text": "By far and away the best sushi in west Florida. Comparable to spots in nyc, Chicago, LA, and Miami. So thankful this place exists in Naples, coco the owner...",
            "rating": 5
          },
          {
            "time": "2022-02-28 18:51:45",
            "text": "Amazing ambiance and even better ramen. For appetizers, we had the skewers however the Berkshire Pork Belly Bun has been by far my favorite. The Hokkaido...",
            "rating": 5
          },
          {
            "time": "2022-03-15 12:52:49",
            "text": "It is truly amazing. The wait is long but it is to be expected their food and service are great.",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-09 22:02:12",
            "text": "The best sushi ever. The staff was beyond friendly and helpful. Ivan was extremely sweet and showed great hospitality. Will make sure to come back here again.",
            "rating": 5
          },
          {
            "time": "2022-02-21 03:40:00",
            "text": "Gotta admit. Ive been in living in Naples for over 35 yrs. Hands down best fresh sushi hands down.  Been to every sushi bar/ restaurant here  but they are top notch. Service was outstanding and so was all the other Appetizers/ platters we ordered absolutely worth the menu price.",
            "rating": 5
          },
          {
            "time": "2022-03-27 08:08:54",
            "text": "This place is incredible. We had the privilege of sitting at the sushi bar. Chef KoKo and his team make creating sushi look like art! The food is to die for, it literally melts in your mouth - best sushi I’ve EVER had!",
            "rating": 5
          },
          {
            "time": "2022-01-23 22:30:33",
            "text": "We were visiting Vanderbilt beach and found this place, a hidden gem, serving the most authentic ramen I've ever had in Florida. Great for casual date night. In addition, it is close to stores making it a great stop for visitors.",
            "rating": 5
          },
          {
            "time": "2021-10-18 13:29:10",
            "text": "This place is our absolute favorite! Phenomenal menu, so may unique options and completely worth the no-reservations wait. Would highly recommend!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Tuesday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Wednesday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Thursday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Friday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Saturday: 11:30 AM – 3:00 PM, 5:00 – 9:30 PM",
        "Sunday: 5:00 – 9:30 PM"
      ]
    },
    {
      "name": "Tokyo Thai Sushi",
      "address": "3743 Tamiami Trl E, Naples, FL 34112",
      "phone": "(239) 775-3388",
      "lat": 26.12145,
      "lng": -81.75881,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-06 07:51:15",
            "text": "Hidden gem in Naples, Florida. Great food, great service and great prices. The waitresses and chefs were so sweet to my friends and I and They even threw in...",
            "rating": 5
          },
          {
            "time": "2021-12-30 05:15:15",
            "text": "It was hubby's birthday and we decided to have an adventure in Naples. Beautiful city with nice shops, classy restaurants, crystal clear beaches. After some...",
            "rating": 4
          },
          {
            "time": "2022-01-04 05:55:11",
            "text": "Have been to Tokyo Thai Sushi several times and they never disappoint!  We love sushi and find theirs one of the best in Naples.  The Monster Lobster Roll...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-15 22:31:42",
            "text": "Ordered takeout over the phone and had an pleasantly easy time ordering. The rice was well seasoned and the accompanying sauces were a nice addition. Their menu is extensive and they were eager to make our experience positive even just for takeout. Will be returning for dine-in to this unassuming and delicious spot! 🍣 🍱",
            "rating": 5
          },
          {
            "time": "2022-02-02 21:38:43",
            "text": "We loved this place! Visited Naples for the day and wanted some great sushi after the beach- the service here is incredible. Family owned. They really went above and beyond to take care of us. We loved the Awesome roll, but enjoyed everything. Ordered tea, and they kept bringing a new pot when we drank it all. Nigiri was so fresh tasting. If we lived here we would be instant regulars!",
            "rating": 5
          },
          {
            "time": "2022-01-18 11:40:13",
            "text": "Tokyo Thai Sushi has the best sushi and Thai food. The service is consistently the best, and the food is always fresh, tasty, and reasonable. The family that owns this business is extremely personable and very welcoming. Tokyo Thai Sushi is a fantastic asset to Naples. I highly recommend dining here.",
            "rating": 5
          },
          {
            "time": "2021-11-06 21:41:44",
            "text": "Excellent food! When I first walked in I thought it can't be good because it is a small place that does not look very fancy. But the food is the quality and presentation of an upscale restaurant.  The waiters were very nice and gave us free tea. We also did not have to wait to long to get the food. On top of all the price is so reasonable.",
            "rating": 5
          },
          {
            "time": "2022-03-28 10:17:01",
            "text": "Love this place, the sushi is exquisite! My girlfriend and I visit every week, we are blown away by the kindness of the staff and quality of the food. It's our go to date night restaurant.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Wednesday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Thursday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Friday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Saturday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM",
        "Sunday: 11:00 AM – 2:30 PM, 4:00 – 9:30 PM"
      ]
    },
    {
      "name": "DaRuMa Japanese Steakhouse and Sushi Lounge",
      "address": "241 Center St N, Naples, FL 34108",
      "phone": "(239) 591-1200",
      "lat": 26.2541699,
      "lng": -81.820704,
      "rating": {
        "Yelp": 3.0,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-16 05:47:10",
            "text": "Excellant sushi and sashimi.  The staff was attentive and friendly. Will return soon!",
            "rating": 5
          },
          {
            "time": "2022-04-04 07:39:09",
            "text": "Food and chef were good. Service was unapologetically moody and terrible. We had a reservation at 7 pm, didn't get seated until 8 pm, and food didn't start...",
            "rating": 2
          },
          {
            "time": "2022-04-16 09:57:59",
            "text": "The only place I'll eat sushi. It's the best!!!",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-19 08:01:02",
            "text": "Best experience in Hibachi.\nIt was my daughter's birthday dinner and the experience was out of this world. I had so much fun and enjoy my meal and so did my family.\nIt was my first time in a Japanese restaurant but by far the best. The ninja drink was excellent. I truly recommend this place best of all is placing a reservation.",
            "rating": 5
          },
          {
            "time": "2022-02-03 22:46:55",
            "text": "We came for my birthday dinner and absolutely NOTHING was done special. As a matter of fact nothing was done at all!!!! We were a few minutes late which wasn’t an issue it seemed to the host, so we waited a few minutes which again was not an issue, totally our fault! We got seated and we (my husband and I) were the only ones at the table. Anyhow in the mean time after getting sat, our server was amazing! She was very friendly. We waited awhile to see if any other people were going to be seated with us and it ended up just being us two, which again totally fine with us. Well the cook came out and he was very well aware it was my birthday and legit cooked our food and that was it!!!!!! We’ve been to Hibachi restaurants before (even this one) and the experience was NOTHING even worth paying for, which is what you pay for when you eat at a hibachi restaurant is the fun cooks and interactive experience even when it’s not a special occasion. No flaming volcano, no interactive food “games”  just plain out cooked our food and cleaning the table! Then to make the experience even better the closing bussers started using our table as a holding place for the salt/pepper shakers etc while we had had just had gotten our food and we’re eating. The only thing the chef did different was sang happy birthday in his native language. It was severely underwhelming. Again I’d like to say the server was amazing that is the only reason it’s even getting 2 stars!",
            "rating": 2
          },
          {
            "time": "2022-04-20 19:21:41",
            "text": "This is amazing I totally recommend! The soup is amazing, the salad is amazing, all the drinks are just amazing!! It’s totally worth it and I recommend going there having dinner",
            "rating": 5
          },
          {
            "time": "2022-04-01 17:20:00",
            "text": "It was our first time. My wife's birthday. NOTHING special for a celebration. Just the chef asked if there was any celebration and my wife rose her hand and said \"It is my birthday\" and the chef only said: \"Oh, Happy Birthday\". So boring! The server (IIS), an Asian woman, she was VERY RUDE AND MEAN. No patience at all. No body explained us how that worked, no body asked us whether it was our first time or not, NOTHING! Such a TERRIBLE experience for this restaurant category. The server was hurrying us all the time to order the food. The chef was kind, food good. His show was ok, nothing from other world. But again, we expected more for what we got. On top of that, they charge you 20% tip. Believe me, I wasn't going to tip a cent! Nothing for such an awful experience.",
            "rating": 1
          },
          {
            "time": "2021-12-24 09:31:26",
            "text": "AMAZING! Had such a wonderful family dinner last night. Bruce Lee-Roy was amazing! Entertaining from beginning to end and of course our food was absolutely delicious! Liz was our server and she went above and beyond to make sure we had the best time! Highly recommend requesting them for your next dine in experience!!!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": 3
      },
      "opening_hours": [
        "Monday: 5:00 – 10:00 PM",
        "Tuesday: 5:00 – 10:00 PM",
        "Wednesday: 5:00 – 10:00 PM",
        "Thursday: 5:00 – 10:00 PM",
        "Friday: 5:00 – 10:00 PM",
        "Saturday: 5:00 – 10:00 PM",
        "Sunday: 5:00 – 10:00 PM"
      ]
    },
    {
      "name": "Maguro Japanese Steak House",
      "address": "895 Wiggins Pass Rd, Naples, FL 34110",
      "phone": "(239) 591-0003",
      "lat": 26.294402,
      "lng": -81.802399,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-17 15:22:40",
            "text": "Love this place. We go here a lot for hibachi. Good food, good portions and good service. Very accommodating. Desserts aren't my favorite but everything...",
            "rating": 5
          },
          {
            "time": "2022-04-15 15:24:38",
            "text": "Worst takeout I've ever gotten. Hibachi chicken was hard as a rock. Tuna in the sushi tasted fishy as can be. Worried we may get sick from the food. We...",
            "rating": 1
          },
          {
            "time": "2022-02-22 12:05:24",
            "text": "I made reservations a week before Valentine's Day for a party of two for Teppanyaki. Unfortunately the reservation didn't get written down, however we were...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-02-22 20:06:46",
            "text": "I go there all the time, foods great, staff is fantastic. Little quiet Latino chef is one of the best in town.",
            "rating": 5
          },
          {
            "time": "2021-07-30 20:03:45",
            "text": "We’ve been here a few times but our most recent visit may be our last. We went specifically for sushi but ended up ordering hibachi due to the temperatures at which the raw fish and sushi is kept at. We believe the raw fish is kept and held above safe temperatures for an extended period of time. I don’t like to do this but I’m certain the sushi bar cooler/storage is not working correctly and the fish is stored above minimum acceptable temperatures. According to safe handling requirements sushi is to be kept below 41 degrees Fahrenheit and I’m certain their “cooler” is near or above 60. Needs to be fixed or adjusted to appropriate temperatures.",
            "rating": 2
          },
          {
            "time": "2021-12-29 07:14:48",
            "text": "I come here is my first time because I just pass and I feel hungry. I never posting in anywhere if I go eat in the restaurant. Because I’m the chef too. I respect to the all chef how they do and make the food. Sometimes we make mistakes and not every time. So when I come here that’s very busy and my food just little taste not good but is ok I understand they busy. And I don’t want to said who the chef . But he have good attitude. He put the food on plate good. So this is attention for all costumer when you eat and comment don’t just said anything bad for the chef if you don’t know how to cook. They trying the best they can . They not work for make some bad food . And try to respect to the chef . I will be back when I pass this restaurant again.",
            "rating": 5
          },
          {
            "time": "2021-12-31 16:26:14",
            "text": "Best sushi and hibachi in town in my opinion.  Have been there many times over several years and they never disappoint.",
            "rating": 5
          },
          {
            "time": "2022-04-19 19:09:05",
            "text": "Really fun place to eat, Andy has got to be the most entertaining chef my family has ever enjoyed at any hibachi ever!!!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 3:00 PM, 5:00 – 10:00 PM",
        "Tuesday: 11:00 AM – 3:00 PM, 5:00 – 10:00 PM",
        "Wednesday: 11:00 AM – 3:00 PM, 5:00 – 10:00 PM",
        "Thursday: 11:00 AM – 3:00 PM, 5:00 – 10:00 PM",
        "Friday: 11:00 AM – 3:00 PM, 5:00 – 11:00 PM",
        "Saturday: 11:00 AM – 3:00 PM, 5:00 – 11:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Fuji Sushi Bar & Asian Bistro",
      "address": "6355 Naples Blvd, Ste 7, Naples, FL 34109",
      "phone": "(239) 593-5550",
      "lat": 26.2199274143022,
      "lng": -81.7727128055573,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-01 16:38:45",
            "text": "Fantastic sushi and even better staff! I rarely take the time write reviews, but felt compelled after the great food and sincerely nicest, most considerate...",
            "rating": 5
          },
          {
            "time": "2022-01-08 19:23:31",
            "text": "Great sushi!!\nI have been eating at Fuji for years now and it has easily become my favorite place for sushi. I love to order the different roles here but my...",
            "rating": 4
          },
          {
            "time": "2021-08-07 18:30:44",
            "text": "Nice menu and lunch specials \nHowever not cheap \nFood was fresh but brown rice was hard and cold \nLike the seafood choices, got salmon \nEat in or out \nCheck...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-04-02 22:33:40",
            "text": "Fuji Sushi was terrific. The fish was so fresh, flavors were interesting—it really was delicious. Plus, the owner was so careful about my allergies. She personally came to our table to confirm she knew what I could (and couldn't) eat—and made sure the kitchen made the required changes. Such a welcome change from how restaurants often deal with my allergies. Love them!!",
            "rating": 5
          },
          {
            "time": "2020-08-26 20:23:07",
            "text": "The food and the service in this place are always on point.",
            "rating": 5
          },
          {
            "time": "2021-12-02 19:03:10",
            "text": "Surprisingly good. Sushi bites are small like they should be. It's more tasty.  Very few places outside Japan understand this.  My favorite place in Naples.",
            "rating": 5
          },
          {
            "time": "2022-01-05 23:09:11",
            "text": "Been coming here for almost 10 years now. The best and most fresh sushi in Naples. Great staff and the owner is super friendly",
            "rating": 5
          },
          {
            "time": "2021-11-22 13:12:27",
            "text": "When you talk about Sushi in Naples, I believe Fuji is the good standard. Really good, fresh sushi and good service. I’ve been coming here for 10 years now",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:00 PM",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: 12:00 – 9:00 PM",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Sarku Japan",
      "address": "1900 Tamiami Trl N, Naples, FL 34102",
      "phone": "(239) 213-0659",
      "lat": 26.170184,
      "lng": -81.796437,
      "rating": {
        "Yelp": 5.0,
        "Google": 4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-10-04 13:34:48",
            "text": "There's a common misconception that the quality of food is directly correlated with its price. Sarku Japan serves as explicit testament against that...",
            "rating": 5
          },
          {
            "time": "2019-09-12 17:36:42",
            "text": "They have good food I alaways get the food and it is always tasty I like how the chicken is",
            "rating": 5
          },
          {
            "time": "2015-07-19 11:01:32",
            "text": "Always love this place, especially when they used to be around the corner from me in Portland, Maine. By far, this is my favorite cheap food to have. \n\nWish...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-01-27 11:10:10",
            "text": "Open- not open….. website says opwn at 11, but when i went in line, cashier says they open at 11:15. For people whose lunch time is very limited ( health care), deliver as you promise. Im now at panda express who opened their atore at exactly 11 as their website says.",
            "rating": 1
          },
          {
            "time": "2021-12-18 19:55:15",
            "text": "Love the Chicken Teriyaki Plate but if you have a shrimp allergy beware of cross contamination. There was a mountain of shrimp cooking next to  a pile of chicken on the same skillet.",
            "rating": 1
          },
          {
            "time": "2021-06-27 15:40:06",
            "text": "I really don’t understand this place. Why would someone eat here when Panda Express and that Thai place are next door? I guess teriyaki chicken is good but steamed vegetables and white rice are pretty bland.",
            "rating": 2
          },
          {
            "time": "2021-03-18 18:12:27",
            "text": "It's always  has fast service I've never had reason to complain.",
            "rating": 3
          },
          {
            "time": "2021-06-23 19:08:03",
            "text": "For the second time the food is terrible.  I will not eat here anymore",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": 1
      },
      "opening_hours": [
        "Monday: 11:00 AM – 7:00 PM",
        "Tuesday: 11:00 AM – 7:00 PM",
        "Wednesday: 11:00 AM – 7:00 PM",
        "Thursday: 11:00 AM – 7:00 PM",
        "Friday: 11:00 AM – 8:00 PM",
        "Saturday: 11:00 AM – 8:00 PM",
        "Sunday: 12:00 – 6:00 PM"
      ]
    },
    {
      "name": "USS Nemo Restaurant",
      "address": "3745 Tamiami Trl N, Naples, FL 34103",
      "phone": "(239) 261-0775",
      "lat": 26.1915891738039,
      "lng": -81.8006497394205,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-18 11:18:15",
            "text": "Great Food and Service. Would love a full bar!\nBill @ BK Homes Powered by KW Naples / email: W.Archer@Kw.com PH#239.324.9845  https://homesbybillandkatie.kw.com",
            "rating": 5
          },
          {
            "time": "2022-01-05 12:58:43",
            "text": "Only some of the best seafood you can get!! The dishes are FRESH. You can taste it. Its delicious, its clean, its straight to the point and it's...",
            "rating": 5
          },
          {
            "time": "2022-04-14 12:35:34",
            "text": "We found the USS Nemo on Yelp and we were excited to try it. I'll be honest that our experience did not start out great. The menu prices online looked...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-08 08:05:37",
            "text": "We had no reservation but 2 spots at the bar opened up! Lucky us! We had the Tuna (East & West style) and enjoyed it very much! Great fish and well prepared! If you are looking for a great seafood place in Naples - you've found it right there! Do get a reservation if you can!",
            "rating": 5
          },
          {
            "time": "2022-01-04 12:49:36",
            "text": "Superb cuisine prepared by a French Canadian master with an eye for presentation.  I had the Crisp Grouper Bowl today for lunch which was (as usual) cooked perfectly, with a really neat sauce adjacent to the grouper, covered by a light blanket of tasty salad.  Wife's Snapper Salad consisted of snapper filets (cooked perfectly, of course) over an interesting combination of greens, tomato, black olives, cucumber with a special dressing.  Naples is the place for seafood, USS Nemo is where you get it upscale and elegant in the French style.  Recon the place at lunch.  Entrees are from about the same menu, but it will give you a chance to evaluate the very poor audio characteristics of the place which has a tin ceiling.  Not the fault of the chef-owner, but can be very noisy in the evening when at capacity and people are drinking.  Otherwise, superb in both food and service.",
            "rating": 5
          },
          {
            "time": "2022-01-16 19:22:02",
            "text": "Our daughter has been wanting my wife and I to go to Nemo now for over 1 year.\nWe went today and now we cannot wait to go back\nOwner greeted us at the door, gave us the table we wanted talked to us about the menu.\nOur waiter was great, the sea bass and the hogfish were even better.\nWe really enjoyed",
            "rating": 5
          },
          {
            "time": "2022-02-17 13:43:11",
            "text": "What a great venue for our Valentine's dinner! Great food, awesome service!  Food was amazing. Highly recommended",
            "rating": 5
          },
          {
            "time": "2022-04-03 21:41:25",
            "text": "The place was packed but the service was great and the food was amazing. I had the Sea Bass and my husband has the Scallops. Would definitely go back for more!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": 3
      },
      "opening_hours": [
        "Monday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Tuesday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Wednesday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Thursday: 11:30 AM – 2:00 PM, 4:00 – 9:30 PM",
        "Friday: 11:30 AM – 2:00 PM, 4:00 – 10:00 PM",
        "Saturday: 4:00 – 10:00 PM",
        "Sunday: 4:00 – 9:30 PM"
      ]
    },
    {
      "name": "Araya Sushi Asian Grill",
      "address": "2650 Immokalee Rd, Naples, FL 34110",
      "phone": "(239) 593-3344",
      "lat": 26.272363,
      "lng": -81.7687444,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-04 11:38:04",
            "text": "Outstanding sushi, great Asian options in a sweet and charming atmosphere. The patio is adorable and the service exquisite.",
            "rating": 5
          },
          {
            "time": "2022-01-02 14:12:00",
            "text": "This was our first experience in Araya. It is Excellent!!!!! Great service and delicious Thai and sushi food!!!!! Nina, our waitress, was so wonderful...",
            "rating": 5
          },
          {
            "time": "2022-01-27 16:42:10",
            "text": "Fellow yelper's were right on the mark with their ratings. The ambiance, service and food are 1st rate. A delightful treat when so many places down here are...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-03-08 22:39:31",
            "text": "The first time we went we were not a fan of the items we ordered. We thought we give it a try again since a good friend of ours loves this place. This time we ordered all different stuff and we loved everything we ordered. My bf also ordered a salmon entree very very good, but not pictured.",
            "rating": 5
          },
          {
            "time": "2022-04-01 07:32:34",
            "text": "Outstanding food, friendly and fast staff. The selections are really cool and creative. I recommend this restaurant to all of my friends! The patio is super cute and cozy, the I side is warm and inviting. Go have launch or dinner and see what I’m raving about.",
            "rating": 5
          },
          {
            "time": "2022-01-23 01:44:07",
            "text": "I went to Araya yesterday evening with my husband, mother and one year old daughter for dinner. Upon arrival we were greeted and sat at a table. Once seated we were told that, due to the weather, all of their outside reservations needed to be moved inside and therefore it was going to be very busy within the next 30-60 minutes. That was fine with us as we just wanted to eat and leave to finish running errands. We were given water and menus. We proceeded to wait for 15 minutes for a server to return to take our order. Within that time several other tables of customers had been seated and helped by servers, as we were ignored. At that point we decided to leave and find somewhere else that was willing and able to accommodate us. My husband and I have been to this restaurant before and have enjoyed the food. However, this evening we felt as though the customer service was completely lacking. If they were unable to accommodate us, due to not having a reservation, they could have been forthcoming about that upon our arrival. Instead they sat us, basically told us we need to hurry up and then proceeded to ignore us. We are very disappointed with the service and have never been treated as such an inconvenience.",
            "rating": 1
          },
          {
            "time": "2022-02-01 08:32:38",
            "text": "I took my boyfriend here for his 23rd birthday! He loved it. The staff was courteous and attentive. The presentation was beautiful and well thought out. The chef is incredibly talented. The food was absolutely delicious",
            "rating": 5
          },
          {
            "time": "2022-04-16 17:02:56",
            "text": "Nice, new outdoor patio with friendly and accommodating service!  We didn't have a reservation, but figured to try to dine in and patio seating would be a plus on a pleasant evening.  We lucked out and got a table for 4 and food was phenomenal!  Grilled octopus, sushi/sushimi boat, and blue crab fried rice was a big hit for our teenage boys!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:00 PM",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: 12:00 – 9:00 PM",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Ninja Steak & Sushi Bar",
      "address": "2371 Vanderbilt Beach Rd, Unit 701, Naples, FL 34109",
      "phone": "(239) 888-8889",
      "lat": 26.245473,
      "lng": -81.769903,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-16 20:15:32",
            "text": "The best hibachi restaurant our family has ever been to! The food was good but what makes the restaurant stand out is the outstanding service that out cook,...",
            "rating": 5
          },
          {
            "time": "2022-04-09 17:39:11",
            "text": "We felt rushed . Everyone especially the front of the house was very nice , specifically the female bartender \nWe sat and within 5 minutes we had our soup ,...",
            "rating": 2
          },
          {
            "time": "2022-03-26 05:02:40",
            "text": "Dinner and a show, right?!  We love Japanese hibachi steak houses and Ninja Steak and Sushi Bar was the perfect location for our evening.  We were a party...",
            "rating": 4
          }
        ],
        "Google": [
          {
            "time": "2022-01-26 13:53:24",
            "text": "Great service, great place, great food. Ordered takeaway for the workplace and it was ready in 20mins, everything was perfect and delicious. Also, when I asked for extra spicy mayo they provided it with no additional charge which is nice. I just fell in love with their Clear Soup, never having it before not much to compare it to all I know is I was full from my roll and still drank it up. I also loved the location, looks like a nice place to go for dinner, they had a nice patio and it didn't give you the crammed in like sardines feeling I get at other Hibachi places.\nWill definitely be revisiting.",
            "rating": 5
          },
          {
            "time": "2022-04-16 20:29:34",
            "text": "10/10! I’ve only done regular dining not hibachi and the experience is just as great. Not to mention the hibachi side always sounds like they’re having fun! The interior is beautiful and my server Grace is always super nice and caring. Love this place!",
            "rating": 5
          },
          {
            "time": "2022-02-19 17:29:09",
            "text": "Just left Ninja and left so impressed! The interior is very clean and modern. Love the hibachi grill area. The service and attention from staff was outstanding. Our server, Chandler, was constantly checking up on us and is very familiar with the menu. He elevated the experience even more! Our chef was so entertaining and cooked everything to perfection. We had a couple add ons like sushi and seaweed salad and those were superb as well. All food was delicious and fresh. Definitely a new favorite in town. Beats out the other places here in Naples. I wish I would’ve taken more pictures but I was enjoying everything so much. Thank you Ninja and Chandler for the amazing experience, we’ll definitely be back soon.",
            "rating": 5
          },
          {
            "time": "2022-02-22 01:10:37",
            "text": "The hibachi from the kitchen was awful.  the cut of meat was terrible for the price and over cooked… the vegetables under cooked and no flavor ! I sent it back ….One of the owners or managers came back to the table .. put the plate back on our table picked the steak up out of the plate pulled it apart and told us that she tasted it and it was fine and then took our fork off of the table and poked it I couldn’t believe it I’ve never had someone literally put their fingers in my food specially a manager or owner. And after we said that it was over cooked she then asked us if we wanted medium well. We said no it was supposed to be medium rare.  We ordered a lot of food and appetizers and drinks we were very nice and our bill was a lot I couldn’t believe how rude and disrespectful the manager was. Two stars for our server she was awesome!!! We loved her :)",
            "rating": 2
          },
          {
            "time": "2021-12-13 20:13:05",
            "text": "This is by far the best Hibatchi place I've ever been at(and I've been at a bunch).  The food is delicious, the staff is top notch.  They go out of their way to make the whole experience memorable and fun. I cant speak enough of how cool this place is.  Highly recommended!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 10:00 PM",
        "Tuesday: 11:00 AM – 10:00 PM",
        "Wednesday: 11:00 AM – 10:00 PM",
        "Thursday: 11:00 AM – 10:00 PM",
        "Friday: 11:00 AM – 11:00 PM",
        "Saturday: 11:00 AM – 11:00 PM",
        "Sunday: 12:00 – 10:00 PM"
      ]
    },
    {
      "name": "Fujiyama Steak House of Japan",
      "address": "2555 Tamiami Trl N, Naples, FL 34103",
      "phone": "(239) 261-4332",
      "lat": 26.1781883239746,
      "lng": -81.8005294799805,
      "rating": {
        "Yelp": 3.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2018-01-07 15:26:50",
            "text": "Found this place on my way to Naples Pier and decided to give it a shot since most reviews were on the positive side.\nI know most reviews recommended a...",
            "rating": 4
          },
          {
            "time": "2021-08-22 06:02:07",
            "text": "Food was subpar at best. Salad was soft like it had been sitting for days. Service was terrible, but since gratuity was added for a 2 person party we know...",
            "rating": 1
          },
          {
            "time": "2021-08-07 20:01:01",
            "text": "Food wasn't the best and the service was even worse. Cara our server only stopped by twice the entire night, but when gratuity is automatically applied to...",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-02-20 19:28:13",
            "text": "Always good and fun. We go around valentine's day every year with family and friends. Great experience every time.",
            "rating": 5
          },
          {
            "time": "2021-11-16 23:51:24",
            "text": "They don’t have sushi and the website is not at all what they advertised.  It’s located inside an inn and very small. It’s clean, but not fancy.  The chefs are mediocre, I will say I had the best steak filet, but my lobster was over cooked and I paid $60 for it. The clear soup tasted like a stock soup, the lettuce in my salad wasn’t fresh. The ginger dressing was very good though. What is normally a yum yum sauce was more like a horseradish sauce and my kids who normally love the food hated it. The rice was very good! Everything was just hit and miss. We came to this restaurant thinking it was going to be top notch ready to dump a bunch of money and it was sub par to even an average Japanese restaurant.",
            "rating": 2
          },
          {
            "time": "2021-07-01 14:25:08",
            "text": "Great food and drinks! Entertaining and fun place. Have been going there for years.",
            "rating": 5
          },
          {
            "time": "2022-03-12 05:03:13",
            "text": "Very good and the the chef was very entertaining.   I think he actually liked his job.",
            "rating": 5
          },
          {
            "time": "2021-11-05 11:10:38",
            "text": "Delicious food and really generous portions. Rosa our waitress was very kind as well as chef Arnie. Not a 5 star restaurant cause its lacking ambience.",
            "rating": 4
          }
        ]
      },
      "price": {
        "Yelp": "$$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 5:00 – 10:00 PM",
        "Thursday: 5:00 – 10:00 PM",
        "Friday: 5:00 – 10:00 PM",
        "Saturday: 5:00 – 10:00 PM",
        "Sunday: 5:00 – 10:00 PM"
      ]
    }
  ],
  "latin": [
    {
      "name": "Rumba Cuban Cafe",
      "address": "1265 Airport Pulling Rd S, Naples, FL 34104",
      "phone": "(239) 659-2996",
      "lat": 26.140919475611877,
      "lng": -81.76613717305902,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-07 13:38:17",
            "text": "I've stopped reviewing restaurants because I do not want to disappoint anyone because I was raised to be polite . . . . Nor am I paid to critique but I'm...",
            "rating": 5
          },
          {
            "time": "2022-03-07 16:47:56",
            "text": "We wanted a Cuban while in Florida and this place was great! We probably could have split one sandwich for us two adults, especially if you add the beans,...",
            "rating": 5
          },
          {
            "time": "2022-04-14 12:07:58",
            "text": "Amazing food. Friendly staff. Would eat here again and again. Everything on the menu looked good and from the assortment we ordered, I bet it's true.",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-08 14:49:13",
            "text": "My family and I are so happy to have found Rumba Cuban Cafe. The food is amazing and unlike any Cuban food we have ever had, so authentic and delicious! The customer service couldn’t be better and the Reyes family welcomed us into their restaurant with open arms, we felt like family. We will definitely be back and couldn’t recommend this restaurant enough!! You will not be disappointed!! With love from the Acosta family",
            "rating": 5
          },
          {
            "time": "2022-01-25 12:49:27",
            "text": "We went here based on reviews and they were right!  I had the best Cuban sandwich I ever ate. Our waitress, Jessica, was pleasant, professional, and warm. The restaurant is small, inviting and clean.  They have about 12 tables inside and another six outside.   The outside tables are set up with linen and they are very nice.",
            "rating": 5
          },
          {
            "time": "2022-02-02 12:31:08",
            "text": "I declare! This place will serve you the BEST Cuban sandwich in all Florida! I promise!\nWe have tried a lot of upscale and average places, and while this won't be a fine dining restaurant, it really deserves more than 5 stars for food, freshness of ingredients and service 👌 it's breakfast and lunch only but really worth it!!!",
            "rating": 5
          },
          {
            "time": "2022-03-17 12:23:50",
            "text": "Best Cuban food in town!! Everything I have ordered has exceeded my expectations. We are big foodies and this place is exceptional in every way!",
            "rating": 5
          },
          {
            "time": "2022-02-21 12:53:41",
            "text": "Best Cuban restaurant in town. Authentic Cuban. Kind and attentive staff. Generous portions and amazing vibe. Our go to place for a guaranteed great meal.",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 3:00 PM",
        "Tuesday: 11:00 AM – 3:00 PM",
        "Wednesday: 11:00 AM – 3:00 PM",
        "Thursday: 11:00 AM – 3:00 PM",
        "Friday: 11:00 AM – 3:00 PM",
        "Saturday: Closed",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Latin Family Bakery",
      "address": "5435 Airport-Pulling Rd, Naples, FL 34109",
      "phone": "(239) 598-3244",
      "lat": 26.2143558714772,
      "lng": -81.7702236087689,
      "rating": {
        "Yelp": 4.0,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-12 16:42:53",
            "text": "Delicious Colombian food! Best empanadas. My kids also love them. Definitely a must try!",
            "rating": 5
          },
          {
            "time": "2021-03-26 08:01:35",
            "text": "My wife is colombian, so I defer to here comment of authenticity, and the food is wonderful. I have no complaints on food but I would deduct the one star...",
            "rating": 4
          },
          {
            "time": "2021-06-23 17:34:27",
            "text": "Delicious food and amazing service. Definitely come here if you're craving some good Latin American plates. Best bandeja paisa I've ever had!",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2020-09-11 20:08:00",
            "text": "Amazing",
            "rating": 5
          },
          {
            "time": "2022-02-26 13:50:05",
            "text": "Great food. Ordered ahead for take out and the service was a little slow but pleasant. Food does not heat up well.",
            "rating": 4
          },
          {
            "time": "2022-04-15 20:06:09",
            "text": "Authentic Colombian food. The empanadas were amazing and the bandeja paisa plus the jugo en mora yum. Visited Naples for the week and hit this place on the way to Marco Island.",
            "rating": 5
          },
          {
            "time": "2022-01-24 16:41:44",
            "text": "Very impressive selection of exotic and tasty Columbian and assorted pastries, breads and assorted other tasty', unique and delightful things to enjoy.  Check it out and its also very clean with polite and helpful service staff.  Blessings JMAC 😉🤗😎",
            "rating": 4
          },
          {
            "time": "2022-03-21 14:48:35",
            "text": "It was not the best, its a very small place that has no organization at all, when you walk in you dont know if you sit yourself or you wait for someone. Also food was not that good and there was even a small eyelash on one of our servings, ive been to worst places but i dont think i wont be coming back anytime soon.",
            "rating": 2
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": null
      },
      "opening_hours": [
        "Monday: 10:00 AM – 3:00 PM",
        "Tuesday: 10:00 AM – 8:00 PM",
        "Wednesday: 10:00 AM – 8:00 PM",
        "Thursday: 10:00 AM – 8:00 PM",
        "Friday: 10:00 AM – 8:00 PM",
        "Saturday: 9:00 AM – 8:00 PM",
        "Sunday: 9:00 AM – 6:00 PM"
      ]
    },
    {
      "name": "Martin Fierro",
      "address": "13040 Livingston Rd, Ste 11, Naples, FL 34105",
      "phone": "(239) 300-4777",
      "lat": 26.2103751,
      "lng": -81.7500883,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.3
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-16 18:56:29",
            "text": "Excellent Argentinian  restaurant. I wanted a BBQ style restaurant tonight and was not disappointed. I was really surprised and happy to see they have an...",
            "rating": 5
          },
          {
            "time": "2022-04-04 08:59:39",
            "text": "Updating my review. This is my second time here and it just wasn't the same.\n1. We called and made a reservation - we arrived and they didn't have the...",
            "rating": 3
          },
          {
            "time": "2021-12-28 13:08:18",
            "text": "I'm not going to lie, I dug into this so quick I didn't get a picture of everything. Sweet plantains we're delicious, yuca fries were so crispy, French...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-12-03 12:33:48",
            "text": "Unassuming and easy to mix in the strip mall, this place is fab! Had lunch a couple of times during our Larson courses and were VERY happy. Great lunch offers with delicious steak and salmon. The dill sauce is amazing, and anything with it should be great! Fresh, wood fired food.",
            "rating": 5
          },
          {
            "time": "2022-01-09 11:17:53",
            "text": "The food is always great. Servers are wonderful too. Only bad thing I have to say is the metal chairs hurt after awhile. They're curved and hug your hips tight.  You can't sit back in them. Not all the chairs are like that only a few tables..",
            "rating": 5
          },
          {
            "time": "2021-12-29 18:51:50",
            "text": "Great food and service. I ordered the salmon with the dill sauce and it was cooked just right. The hamburger was a little overcook. The flank was cooked good. Great place will be returning. Would recommend.",
            "rating": 5
          },
          {
            "time": "2021-10-03 14:16:44",
            "text": "Unfortunately, I went on a Sunday at 2:00 pm and only two servers were available. I asked for a table and half the restaurant was empty and they told me it was 45 minute wait. I know it’s hard to get servers now so I’m doing this review more to ensure the owner is aware of what’s going on.",
            "rating": 1
          },
          {
            "time": "2020-09-10 23:26:53",
            "text": "Clean, awesome service, awesome food",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Mango's Cuban Cafe",
      "address": "1826 Trade Center Way, Ste C, Naples, FL 34109",
      "phone": "(239) 593-5099",
      "lat": 26.22464,
      "lng": -81.7803,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2021-07-26 09:06:05",
            "text": "Went here for lunch today with my wife after seeing the great reviews for this place and I had a hankerin' for a Cuban sandwich.  Even at 11am the place was...",
            "rating": 5
          },
          {
            "time": "2021-07-09 13:28:16",
            "text": "They make really good food. Cuban, Colombian, and  Venezuelan dishes.\nOxtail, cheese bread, choclo (corn) pie, tequenos were delicious. Empanadas I liked...",
            "rating": 5
          },
          {
            "time": "2019-05-21 07:25:20",
            "text": "Excelente place for Latin food! \nThis place isn't far from Tamiami trail road , GPS works fine to get there! \nVery good prices, come a check it out, they...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-04-16 08:23:22",
            "text": "Best Biscuits and gravy. Awesome.Cuban coffee. Great prices for the value. My favorite breakfast place in SW Fl.",
            "rating": 5
          },
          {
            "time": "2022-03-30 09:52:52",
            "text": "Mangos keeps us working men and women going! Best Coffee in town! Avoid Starbucks and Dunkin Donuts, give these people some love! :)",
            "rating": 5
          },
          {
            "time": "2022-01-07 18:54:35",
            "text": "I don't order Cuban sandwiches out because they always get them wrong but this place phenomenal!!!!",
            "rating": 5
          },
          {
            "time": "2021-12-21 04:58:53",
            "text": "Very tasty and the order was correct. Arrived hot and quicker than promised.",
            "rating": 5
          },
          {
            "time": "2021-06-20 21:31:08",
            "text": "Wonderful staff and delicious food, their sandwiches are the best!👍✨",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 7:00 AM – 3:00 PM",
        "Tuesday: 7:00 AM – 3:00 PM",
        "Wednesday: 7:00 AM – 3:00 PM",
        "Thursday: 7:00 AM – 3:00 PM",
        "Friday: 7:00 AM – 3:00 PM",
        "Saturday: Closed",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Fernandez The Bull Cuban Cafe",
      "address": "3375 Pine Ridge Rd, Naples, FL 34109",
      "phone": "(239) 653-9097",
      "lat": 26.21228,
      "lng": -81.74958,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.4
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-29 15:46:26",
            "text": "Go, you will be happy. A lively spot with the friendliest and helpful\nservers we have seen in a while.  Hugh menu with all the Cuban\nFavs. The starter bread...",
            "rating": 5
          },
          {
            "time": "2022-01-21 18:14:27",
            "text": "First time to this establishment. Did not get outdoor seating as it was a 20 minute plus wait. Arrived around 6:30 PM. Though we sat inside we could still...",
            "rating": 4
          },
          {
            "time": "2021-12-31 05:17:41",
            "text": "I've been debating on a 2 or 3 star all last night. I settled on the 3. Cuban food, to me, is amazing. It is so close to Puerto Rican (me) and Dominican (my...",
            "rating": 3
          }
        ],
        "Google": [
          {
            "time": "2022-02-11 22:23:18",
            "text": "Fernandez, I suggest (please do not take it wrong) to have you people be more conscious about cleaning and washing hands. Two wrong experiences:\n\n1. When brushing the floor, please do not use the same brush for seats. (I think you have security cameras)\n\n2. When the bar tender goes to the bathroom, he needs to wash his hands.\n\nStill supportive to your legacy, just make sure restaurant management is present.\n\nBy the way, I love friday music. (Positive)",
            "rating": 1
          },
          {
            "time": "2020-09-20 15:59:16",
            "text": "Soo good to be home.",
            "rating": 5
          },
          {
            "time": "2022-04-14 18:53:28",
            "text": "Great customer service.  The food is off the chain. Amazing portions.  Even better the next day.  A don't miss dining experience!!!",
            "rating": 5
          },
          {
            "time": "2022-04-07 11:40:25",
            "text": "We always wanted to try FTB Cuban Cafe, last night we did and loved it. Ordered tamales, paella, shredded pork, everything was awesome! Ingrid was our server thank you you were wonderful, spot on and always checking. We will certainly be back.",
            "rating": 5
          },
          {
            "time": "2022-02-27 20:35:11",
            "text": "Such kind servers who recommended the perfect dish! Food tasted amazing! Highly recommend if you are looking for a great meal with great service and a great cost!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 11:00 AM – 10:00 PM",
        "Sunday: 11:00 AM – 9:00 PM"
      ]
    },
    {
      "name": "Bodega Ole",
      "address": "965 4th Ave N, Naples, FL 34102",
      "phone": "(239) 304-8108",
      "lat": 26.15213,
      "lng": -81.79526,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-01-20 13:23:53",
            "text": "I have been to Bodega Ole twice now and it was excellent both times. It's in a strip mall in an up and coming area of town near the Naples Design District....",
            "rating": 5
          },
          {
            "time": "2021-11-13 18:15:26",
            "text": "This area of Naples starts to become more and more unique and fun. It's already 2 or 3 times we come and the restaurants are really different and...",
            "rating": 5
          },
          {
            "time": "2021-09-20 19:13:31",
            "text": "My daughter and I stopped by the bar for drinks and tapas. The bartender (Nick, I think), makes a terrific sangria rojo. We ended up ordering Drunken Figs,...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-02-24 23:03:57",
            "text": "Bodega Ole lives up to being a neighborhood gem. If you've never eaten tapas this is the place to go. Each menu option is authentic and there's something special for everyone. The ambiance is excellent whether you sit inside or outside. I will definitely be back!",
            "rating": 5
          },
          {
            "time": "2022-03-23 23:37:52",
            "text": "The building, walls or something smells bad.  Humidity or something smells old.  Server needs to know a little bit more of the menu items, but service was great as well the food .  Nice environment including the live music.  Definitely will be back.",
            "rating": 4
          },
          {
            "time": "2022-01-07 19:55:41",
            "text": "My husband and I are big Tapas fans. Having first tried it in Barcelona,  we were spoiled for the authentic dishes we enjoyed there. We travel all over the US and look for it everywhere we stop. Unsurprisingly,  it isn't easy to find the real thing.\n\nTonight we discovered a wonderful Spanish restaurant in Naples with a well-presented classic Tapas selection. We were in heaven.\n\nThe wait staff was attentive and pleasant, the restaurant was clean and simply decorated. White tablecloth and linen napkins. And delicious,  food in perfect portions.\n\nAs a bonus, a guitarist/vocalist started playing and he was perfect.\n\nThey have soup, salad, and entrees on the menu for a more traditional din.  Ingredients experience.\n\nI highly recommend Bodega Ole.",
            "rating": 5
          },
          {
            "time": "2022-03-19 23:06:18",
            "text": "My wife and I stumbled across Bodega and boy a we glad we did. Great staff, great food, wine, space and great people! We love it. We'll be back!",
            "rating": 5
          },
          {
            "time": "2021-11-22 10:44:50",
            "text": "We had an excellent night at Bodega Ole. We were a group of 4 couples. We enjoyed the food, live music and service at the restaurant. The tapas, salads, and paella were delicious! My husband said the octopus was one of the best  he has had in Naples. I love the salad with micro greens and melon with shrimp. The wine selection is top notch!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: 11:00 AM – 9:00 PM",
        "Tuesday: 11:00 AM – 9:00 PM",
        "Wednesday: 11:00 AM – 9:00 PM",
        "Thursday: 11:00 AM – 9:00 PM",
        "Friday: 11:00 AM – 10:00 PM",
        "Saturday: 4:00 – 10:00 PM",
        "Sunday: 4:00 – 8:00 PM"
      ]
    },
    {
      "name": "La Cuisine Peruvian Roots",
      "address": "3861 Tamiami Trl E, Naples, FL 34112",
      "phone": "(239) 285-3924",
      "lat": 26.1188484728336,
      "lng": -81.758358925581,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-04-18 10:32:05",
            "text": "The food was excellent. \nWe have been there four different times this past year. \nConsistently authentic Peruvian cuisine. \nWe highly recommend this restaurant.",
            "rating": 5
          },
          {
            "time": "2022-03-12 10:20:57",
            "text": "Tucked away in a corner of a strip mall, near Mr Tequila  . Its a small, but nicely appointed place. Only had Peruvian food once before (in South Beach,) so...",
            "rating": 4
          },
          {
            "time": "2021-11-19 14:09:25",
            "text": "Still five stars. Javiar was great. We tried the Arroz con Mariscos and loved it.",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-01-22 15:16:25",
            "text": "Had a great lunch here. Staff very helpful and friendly. Had delicious octopus appetizer and wonderful seafood and fish ceviche. Will definitely come here again the next time I am in Naples.",
            "rating": 5
          },
          {
            "time": "2022-01-16 23:44:48",
            "text": "Small neighborhood place, maybe 10 tables, but let me tell you the food was delicious. This was my first visit here, but it will not be my last..Well done..",
            "rating": 5
          },
          {
            "time": "2022-04-09 19:05:29",
            "text": "We had the lamb and the steak, it was absolutely wonderful! Authentic flavors and well priced. Don't miss this hidden treasure in Naples.",
            "rating": 5
          },
          {
            "time": "2022-02-27 19:15:20",
            "text": "Amazing! Good food great service! If you want food that is different and unique this is the place to go. If you love seafood try this place.",
            "rating": 5
          },
          {
            "time": "2021-10-05 08:15:59",
            "text": "Went with my fiancee, was asked what we wanted to drink, ordered some wine, was told they were out of it. Strike one. Had to order an alternative. Then it came to order the appetizer. They were out of what we wanted. Strike two. Time to order main course, yep you guessed it. Strike three. BTW did I mention, we were the only customers the whole time we were there. Maybe that should have been a clue.",
            "rating": 3
          }
        ]
      },
      "price": {
        "Yelp": "$$",
        "Google": 2
      },
      "opening_hours": [
        "Monday: 12:00 – 9:00 PM",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: 12:00 – 9:00 PM",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 10:00 PM",
        "Saturday: 12:00 – 10:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Havana Blue Cuban Cuisine & Lounge",
      "address": "2355 Vanderbilt Beach Rd, Ste 200, Naples, FL 34109",
      "phone": "(239) 591-5149",
      "lat": 26.246808909915675,
      "lng": -81.77119895889555,
      "rating": {
        "Yelp": 3.5,
        "Google": 3.9
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-02 19:02:34",
            "text": "Buena comida y ambiente buena música me gusta todos los sabado el rabo encendido riquísimo",
            "rating": 5
          },
          {
            "time": "2020-10-03 10:51:47",
            "text": "We ordered three meaty dishes: oxtail, ropa vieja, and lechon asado and there are some consistency in the food in that it's salty, dry and luke warm. When...",
            "rating": 2
          },
          {
            "time": "2021-07-10 16:11:45",
            "text": "Bad service! Music extremely loud and no bread before food , waitress never came and refilled tea, never asked if everything was ok:(. Won't be back",
            "rating": 1
          }
        ],
        "Google": [
          {
            "time": "2022-03-31 18:14:04",
            "text": "Great restaurant! Really good drinks and even better food. Very friendly staff and a great ambiance. Would definitely recommend!!",
            "rating": 5
          },
          {
            "time": "2022-02-21 13:58:30",
            "text": "I had a fantastic experience at this place, celebrating my birthday with a group of 9 friends! The staff was very nice, helpful and accommodating. Everyone had a great time.\nEvery dish we ordered was tasty and the service was excellent. I had their signature dish( slow roasted pork). What topped off the evening was the band , El Gato Solea, great music and performance.\nI highly recommend Havana Blue!",
            "rating": 5
          },
          {
            "time": "2021-10-30 13:53:47",
            "text": "It's decent, staff are nice, never crowded at lunchtime.  They serve typical Cuban food at good prices.",
            "rating": 3
          },
          {
            "time": "2022-03-25 12:10:23",
            "text": "We were there last night with friends. They get very busy on weekends and especially on Saturday with the live music but on Thursday night there was was only us and one other table of diners between 6pm and 7:30pm.  Our service was very good but the food was excellent. Our group all ordered a different recipe of pork except me.  I had the Oxtail Stew. I can't say enough about how rich, savory, and delicious it was. I chose Moros and Tostones as sides and both were delicious with the stew.  Our group will be back! We love Cuban food and have eaten it many places including Havana and Calle Ocho in Miami.  The food at Havana Blue is really delicious and authentic Cuban!",
            "rating": 5
          },
          {
            "time": "2022-04-05 17:22:02",
            "text": "Ordered Palomilla steak and it was extremely fatty. Waitress wouldn’t take it back and said it would come out of her paycheck. The owner is the chef and he would not make it right.  Worst service I’ve ever had and will never return. I hope it was worth $16, a bad review, and losing a customer.",
            "rating": 1
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: 12:00 – 9:00 PM",
        "Wednesday: 12:00 – 9:00 PM",
        "Thursday: 12:00 – 9:00 PM",
        "Friday: 12:00 – 9:00 PM",
        "Saturday: 12:00 – 9:00 PM",
        "Sunday: 12:00 – 9:00 PM"
      ]
    },
    {
      "name": "Deliciously Round",
      "address": "2180 Kirkwood Ave, Naples, FL 34112",
      "phone": "(954) 647-2224",
      "lat": 26.13715,
      "lng": -81.77801,
      "rating": {
        "Yelp": 5.0,
        "Google": 5
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-03-26 18:20:53",
            "text": "Amazing food! Very cool to see such talented chefs making great Argentinan food in Naples. It was my first time and I hope to get it again.",
            "rating": 5
          },
          {
            "time": "2021-10-24 13:33:23",
            "text": "What a great place!  We especially like the pork arepas and the cheese empanadas.  Delicious and round, indeed.\nIt's a food truck, so it's only to go.  (And...",
            "rating": 5
          },
          {
            "time": "2021-09-12 08:25:42",
            "text": "Deliciously Delicious! Best empanadas I've ever had, made fresh in front of you. Also tried the beef and Gouda arepa and chacapas! Both were incredible,...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2021-10-07 13:51:09",
            "text": "",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": null,
        "Google": null
      },
      "opening_hours": [
        "Monday: Closed",
        "Tuesday: Closed",
        "Wednesday: 12:00 – 7:00 PM",
        "Thursday: 12:00 – 7:00 PM",
        "Friday: 12:00 – 7:00 PM",
        "Saturday: 12:00 – 7:00 PM",
        "Sunday: Closed"
      ]
    },
    {
      "name": "Taqueria San Julian",
      "address": "3575 Bayshore Dr, Naples, FL 34112",
      "phone": "(239) 775-6480",
      "lat": 26.12,
      "lng": -81.77019,
      "rating": {
        "Yelp": 4.5,
        "Google": 4.6
      },
      "reviews": {
        "Yelp": [
          {
            "time": "2022-02-10 07:10:30",
            "text": "My friend and I had dinner there last night. What a jewel in disguise. Very small unpretentious local, but what delicious authentic Mexican food.  Best...",
            "rating": 5
          },
          {
            "time": "2022-01-20 09:10:51",
            "text": "Every visit to Naples and surrounding area we make sure to stop by here. These tacos are authentic as they come. A Cali-girl with tacos at every corner;...",
            "rating": 5
          },
          {
            "time": "2021-11-29 11:09:46",
            "text": "Delicious tacos and margaritas at such a cheap price point. Run by three Latin women so you know it's good and the real deal. Definitely check this spot out...",
            "rating": 5
          }
        ],
        "Google": [
          {
            "time": "2022-03-29 02:58:11",
            "text": "Now if your looking for a place for authentic and a quick dinner I would recommend the shrimp quesadillas, and the hibiscus water. Make sure to place the pink ones that are given on top and the green salsa that is also given and you will be very pleased! Ordered like 2 and still hungry. The tacos are also great recommend them too! Make sure to sit outside when its evening and the sun does not burn you and it's a great place to eat with your pets after a long day walking!",
            "rating": 5
          },
          {
            "time": "2022-04-10 23:00:15",
            "text": "An awesome, “local fave” appreciated by visitors. Easily order at the counter and have your food brought to you at a table. The trios of veg and hot sauces are unique and delicious. Fairly priced, quick service and a great vibe overall.  🌮",
            "rating": 5
          },
          {
            "time": "2022-03-13 19:42:55",
            "text": "The foods that we ordered for dine in & take out are Delicious!\nWe ordered 4-5 different kinds from the menu🙂😋\nLady server was nice.\nDefinitely we'll come back.\nThank You!!!",
            "rating": 5
          },
          {
            "time": "2020-08-30 04:32:01",
            "text": "best authentic mexican food.i always eat soup,shrimp soup with corn.tortillas,is very good for hangover.the soup,cures it right away.👍🏻👍🏻👍🏻",
            "rating": 5
          },
          {
            "time": "2020-09-10 23:26:28",
            "text": "We got a little bit of everything- it was that good!",
            "rating": 5
          }
        ]
      },
      "price": {
        "Yelp": "$",
        "Google": 1
      },
      "opening_hours": [
        "Monday: 10:00 AM – 10:00 PM",
        "Tuesday: 10:00 AM – 10:00 PM",
        "Wednesday: 10:00 AM – 10:00 PM",
        "Thursday: 10:00 AM – 10:00 PM",
        "Friday: 10:00 AM – 10:00 PM",
        "Saturday: 10:00 AM – 10:00 PM",
        "Sunday: 10:00 AM – 10:00 PM"
      ]
    }
  ]
}